{
    "link": "",
    "hours": "(Sunday - Saturday: 08:00 - 01:00)",
    "tel": "tel: 807-286-0300",
    "sms": "",
    "address": "Address: 701 Memorial Avenue, Unit 4",
    "map": "https:\/\/maps.app.goo.gl\/76W3ogeDockk8VpK6",
    "updated": "Updated: 2025-05-11",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Build Your Own Meal<br\/><br\/>Step 1: Choose Your Base: Burrito Bowl, Burrito, Quesadilla<br\/>Step 2: Rice &amp; Beans: Yellow\/Brown Rice with Chickpeas\/Black Beans<br\/>Step 3: Pick a Protein ($11.99): Butter Chicken, Chicken Tikka, Lamb Curry, Ground Beef, Seasonal Chicken, Paneer Tikka Masala, Chickpea Curry, Shahi Paneer, Black Lentils<br\/>Step 4: Fillings: (Details not clear)<br\/>Step 5: Sauces and Spices: (Details not clear)<br\/>Step 6: Extras or Add-Ons: (Details not clear)<br\/>Combos<br\/><br\/>Chips and Salsa: $2.99<br\/>Chips, Salsa, and Drink: $3.99<br\/>Chips &amp; Guacamole: $3.99<br\/>Chips, Guacamole &amp; Drinks: $4.99<br\/>Chips &amp; Queso: $4.99<br\/>Chips, Queso and Drink: $5.99<br\/><br\/>Signature Bowls<br\/><br\/>Bhangra Bowl: $11.99 - Spiced roasted cauliflower, curried chickpeas, yellow\/brown basmati rice, spice, New Delhi slaw, red onions, carrots, street crunch, cilantro, and raita.<br\/>Rangila Bowl: $11.99 - Brown\/yellow basmati rice, paneer tikka masala curry, kachumber salad, tamarind chutney, street crunch, raita, and cilantro.<br\/>Perks of Being Cauliflower: $11.99 - Seasoned Tofu and cauliflower, lemon turmeric rice, cucumber cubes, pumpkin seeds, and cilantro chilli lime dressing.<br\/>Mumbai Masala Bowl: $11.99 - Brown\/yellow basmati rice, butter chicken curry, red slaw, cucumber, tamarind chutney, sev crunch, and spinach.<br\/>New Delhi Bowl: $11.99 - Mutton curry (Lamb curry), turmeric-infused basmati rice, red onions, Green Chutney, lime, and Cilantro.<br\/>Tikka Chance on Me: $11.99 - Gluten friendly. Brown\/yellow basmati rice, chicken tikka masala curry, corn, kachumber salad, green chutney, raita, and street crunch.<br\/>Madras Bowl: $11.99 - Gluten friendly. Brown\/yellow basmati rice, chicken Madras curry, red slaw, Pico Kachumber, green chutney, raita, and spicy sev crunch<br\/>Pacifica Bowl: $11.99 - Warm quinoa, baby spinach, tomato, carrots, chicken, goat cheese, tortilla chips, cilantro, and avocado. Lime-cilantro jalape&#241;o vinaigrette and goodlife hot sauce.<br\/><br\/>Salad Menu<br\/><br\/>Meat Salads<br\/>Aphrodite Salad: $11.99 - Mixed greens, strawberries, apple, almonds, mozzarella cheese, cucumbers, and chicken with Raspberry dressing.<br\/>Super Food Salad: $11.99 - Mixed greens, chicken, apple, pear, walnut, and cheese with your choice of dressing.<br\/>Grain Of Thrones: $11.99 - Mixed greens, chicken, quinoa, corn, avocado, house spice, and pumpkin seeds with your choice of dressing.<br\/>District Cobb: $11.99 - Mixed greens, chicken, avocado, corn, red onions, hard boiled egg, tomatoes, house seasoning, blue cheese dressing, and bacon.<br\/>Don Quixote: $11.99 - Mixed greens, chicken, avocado, mango, roasted corn, and Jack cheese with your choice of dressing.<br\/>Summer Cobb: $11.99 - Chicken, fresh peaches, avocado, corn, goat cheese, pickled red onions, eggs, spring mix, and house seasoning with honey dijon vinaigrette. &#160; <br\/>Vibrant Venus: $11.99 - Strawberries, goat cheese crumbles, spinach, chicken, red onions, walnuts, and balsamic vinaigrette.<br\/>Vegan Salads<br\/>Good Life Salad: $11.99 - Chickpeas, cucumbers, tomatoes, spinach, kale, red onions, and toasted sesame seeds.<br\/>Happy Vegan Salad: $11.99 - Spinach, kale, quinoa, carrots, green beans, and edamame.<br\/>Protein Bowls<br\/><br\/>Meat (Non-Veg)<br\/>Harvest Bowl: $11.99 - Brown rice or quinoa with lime, topped with chicken, apple, shredded kale, and toasted pumpkin seeds.<br\/>Southwest Bowl: $11.99 - Brown rice or quinoa, chicken, spinach, roasted corn, avocado, tomatoes, cheese, and cilantro vinaigrette.<br\/>Vegetarian<br\/>Hungry Buddha Bowl: $11.99 - Quinoa or brown rice, tofu, spinach, red onions, pumpkin seeds, edamame, carrots, and tahini dressing.<br\/>Mediterranean Escape Bowl: $11.99 - Warm chickpeas, warm quinoa, shredded carrots, spinach, raisins, red onions, tomatoes, almonds, jalapenos, olive oil, and cilantro. &#160; <br\/>Falafel Radio Bowl: $11.99 - Falafel, pineapple, brown basmati rice, broccoli, kale, shredded carrots, and sesame seeds.<br\/><br\/>BURRITOS<br\/><br\/>Hella Vegan Burrito (Vegan): $10.99 - Chickpea curry with rice and pico de gallo layered in a tortilla.<br\/>Chicken Club: $11.99 - Chicken tikka, lettuce, shredded cheese, pico de gallo and chipotle ranch dressing layered in a grilled tortilla.<br\/>Beef Raider: $11.99 - Seasoned ground beef, yellow basmati rice, black beans, pico de gallo, cheddar cheese, sour cream, and lettuce with your choice of sauce.<br\/>Funky Chicken: $11.99 - Butter chicken curry and chicken tikka masala curry with basmati rice, pico de gallo, cheese, walnuts, and raisins.<br\/>Masala Mama Burrito: $11.99 - Your choice of chicken or paneer tikka masala, basmati rice, pico kachumber, mango chutney, yogurt, and cilantro.<br\/>Jumma Burrito (Butter Chicken Burrito): $11.99 - Butter chicken, rice, pico kachumber, green chutney, raita, and street crunch.<br\/>Desi Chicken (Chicken Tikka Masala): $11.99 - Chicken tikka masala, rice, mango chutney, curried chana chickpeas, pico kachumber, and spring leaf mix.<br\/>QUESADILLA<br\/><br\/>Chicken Club: $11.99 - Chicken tikka, lettuce, shredded cheese, pico de gallo and chipotle ranch dressing layered in a grilled tortilla.<br\/>New Delhi: $11.99 - Butter chicken curry, basmati rice, pico de gallo, mozzarella cheese and cilantro in a flour tortilla. Served with salsa and sour cream.1 &#160; <br\/>1.<br\/>www.skipthedishes.com<br\/>www.skipthedishes.com<br\/>Oh Calcutta (Vegetarian): $11.99 - Seasoned Tofu and cauliflower, light spiced vegetables, and mozzarella cheese in a flour tortilla. Served with salsa and sour cream.<br\/>Mexico City: $11.99 - Seasoned ground chicken, chorizo, and Monterey Jack and Pico de Gallo in a flour tortilla. Served with salsa and sour cream.<br\/>SPECIAL EATS<br\/><br\/>Desi Butter Chicken Poutine: $12.99 - French fries with cheese, onions, cilantro, and butter chicken.<br\/>FIRE on the MOUNTAIN NACHOS: $11.99 - Nachos with queso, ground beef, jalapenos, tomatoes, cilantro, sour cream, guacamole &amp; hot salsa.<br\/>Classic Nachos: $11.99 - Tortilla chips topped with beans, creamy queso cheese, sour cream, pico de gallo, guacamole, and sliced jalapenos.<br\/>PIZZAS<br\/><br\/>Butter Chicken: $11.99 - Butter chicken cooked in a creamy tomato butter sauce, green peppers &amp; mozzarella.<br\/>Chicken Tikka: $11.99 - Chicken cooked in tikka sauce, onions, green peppers, mozzarella and cilantro.<br\/>Paneer Tikka: $11.99 - Paneer cooked in tikka sauce, onions, green peppers, mozzarella and cilantro.",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "name": "Goodlife Foods Co"
}