{
"name" : "Seler Restaurant & Wine",
"status" : "",
"link" : "https://seler.ca/", 
"hours" : "(Tuesday - Friday: 11:00 - 14:30), (Tuesday - Saturday: 17:00 - 22:00)", 
"tel" : "tel: 807-622-2478", 
"sms": "", 
"address" : "Address: 555 Dunlop Street", 
"map": "https://maps.app.goo.gl/rVX5CoNXbnErGUYF7", 
"updated" : "Updated: 2025-09-07", 
"courtesy" : "Courtesy: Justin Menu", 
"text" : "Dinner
<br>We invite you to experience an intimate dining atmosphere where exceptional cuisine meets warm hospitality. Whether you're celebrating a special occasion or simply enjoying a quiet evening out, let us create a memorable experience for you. We look forward to welcoming you.
<br>
<br>Dinner Hours:
<br>Tuesday - Saturday from 5pm-10pm
<br>
<br>Appetizers
<br>Goat Cheese Aubergine, Panko Crusted Eggplant, Warm Goat Cheese, Spiced Red Peppers, Basil Pesto, Arugula, Balsamic Glaze - $19
<br>Ahi Tuna, Blackened, Mango Chipotle Coulis, Cucumber Chutney, Wonton Crisps - $22
<br>Pork Belly, Sweet Tamari Glaze, Toasted Sesame, Gochujang, Heirloom Tomatoes, Pea Shoots - $18
<br>Digby Scallops, Creamed Corn Succotash, Peppered Pork Belly, Roasted Garlic. - $21
<br>Tempura Fried Shrimp, Spiced Meyer Lemon Coulis, Toasted Coconut. - $20
<br>Arancini, Arborio Rice, Cream Cheese, Smoked Tomatoes, Roasted Bell Peppers, Asparagus, Shaved Parmesan Cheese. - $17
<br>
<br>Salads
<br>Caesar Salad, Crisp Romaine Lettuce, Peppered Bacon, Charred Lemon Caesar Dressing, Pangrattato, Shaved Parmesan. - $12/$20
<br>Tomato Salad, Basil Pesto, Fior Di Latte, Balsamic Glaze, Baby Cucumber, Basil Glass - $17
<br>Peach and Burrata Salad, Grilled Peaches, Burrata, Arugula, Toasted Almonds, Chili Honey Vinaigrette - $23
<br>
<br>Entrees
<br>Lobster Risotto, Fresh Butter Poached Atlantic Lobster, White Wine Cream, Heirloom Carrots, Spiced Lobster Nage - $57
<br>Grilled Ribeye, Swiss Chard, Peppercorn Demi Glace, Charred Corn, Lime Aioli, Garlic Parmesan Fingering Potatoes - $60
<br>Filet Mignon, Red Wine Demi-Glace, Roasted Heirloom Carrots, Broccolini, Crisp Potato Stew, Dill Aioli
<br>(add braised crimini mushrooms, red wine, beef stock, goat cheese $2, add 4oz fresh butter poached lobster $2) - $55
<br>Pesto Crusted Salmon, Lemon Beurre Blanc, Rice Pilaf, Broccolini, Grilled Lemon - $39
<br>Pork Tenderloin, Peanut Satay Sauce, Fire Roasted Peanuts, Maple Soy Glaze, Napa Fried Rice, Broccolini - $36
<br>Pan Seared Parmesan Crusted Chicken Breast, Lemon Butter, White Wine Cream, Risotto, Seasonal Vegetables. - $30/$37
<br>Big Lake Peppered Linguine Shrimp, Scallops, Crispy Pancetta, White Wine Cream Sauce, Cherry Tomatoes. - $36
<br>Seared Duck Breast, Rice Noodles, Miso Soy Sauce, Chili Garlic, Bok Choy, Carrots, Bean Sprouts, Toasted Sesame, Grilled Lime - $38
<br>Fiorelli, Smoked Tomatoes, Roasted Red Peppers, Spinach, Crimini Mushrooms, Herbed Goat Cheese, Toasted Pine Nuts
<br>(add blackened chicken $8, shrimp $2, yellowfin tuna $8, fresh butter poached lobster $2) - $28
<br>
<br>We invite you to join us for lunch, Tuesday through Friday. Enjoy a delightful dining experience with exceptional service. We look forward to welcoming you!
<br>
<br>Lunch Hours:
<br>Tuesday - Friday from 11am- 2:30pm
<br>
<br>Appetizers
<br>Tempura Sushi Roll, Sushi Rice, Nori, Yellowfin Tuna, Gojuchang, Seasonal Vegetables, served with Ponzu Sauce & Sriracha Aioli - $19
<br>Crisp Romaine Lettuce, Peppered Bacon, Charred Lemon Dressing, Pangrattato - $15
<br>BLT Steak Salad, 6 oz New York Steak, Peppered Bacon, Mixed Greens, Tomatoes, 26 Buttermilk Ranch, Blue Cheese - $25
<br>Shrimp Spring Roll, Marinated Shrimp, Shaved Carrots, Cabbage, Chinese Five Spice, Soy Peanut Sauce, Nuoc Cham Sauce - $15
<br>10 oz Seasonal Soup, served with a Garlic Baguette - $14
<br>Goat Cheese Aubergine, Panko Crusted Eggplant, Warm Goat Cheese, Spiced Red Peppers, Basil Pesto, Arugula, Balsamic Glaze - $16
<br>Seared Salmon Salad, Gojuchang, Arugula, Butter Leaf Lettuce, Roasted Red Peppers, Radish, Orange Peppercorn Vinaigrette, Toasted Sesame - $25
<br>Grilled Peach Salad, Fior Di Latte, Arugula, Blistered Cherry Tomatoes, Burnt Honey Chili Vinaigrette - $17
<br>Soup & Salad, Daily Soup with choice of Caesar Salad or Tomato Salad, served with a Garlic Baguette - $18
<br>
<br>Classics
<br>Grilled Shrimp Tacos, Tomatillo Chutney, Pickled Jalapeno, Avocado Crema, Cotija Cheese, Corn Tortillas - $20
<br>Buttermilk Fried Chicken Tenders, served with Seasoned Potato crisps, Honey Dill Sauce - $23
<br>Blackened Chicken Sandwich, Wilted Spinach, Cream Cheese, Romaine, Pangrattato Parmesan, Garlic Aioli, Brioche Bun, served with Seasoned Potato Crisps - $23
<br>Braised Beef Sandwich, Provolone, Dijon, Horseradish Aioli, Pickled Red Onions, Au Ju, Toasted Focaccia, served with Seasoned Potato Crisps - $24
<br>Pepperoncini Burger, Two 5oz Beef Patties, Crisp Romaine, Pepperoncini Jelly, Goat Cheese, Potato Bun, served with Seasoned Potato Crisps - $24
<br>Maple Chicken Floretta, Roasted Chicken, Bacon, Cream, Maple Syrup, Parmesan, Toasted Focaccia - $22
<br>Crispy Eggplant Wrap, Spinach, Olives, Whipped Ricotta, Pesto, Smoked Tomatoes, Parmesan, Flour Tortilla, served with Seasoned Potato Crisps - $20
<br>Buddha Bowl, Red Arborio Rice, Soft Boiled Soy Egg, Pickled Ginger & Cucumber, Edamame, Radish, Avocado, Sesame Seeds, topped with Hoisin Glaze & Sriracha Aioli - $22
<br>
<br>Accompaniments
<br>Blackened Chicken $8, Shrimp $8, Yellowfin Tuna $8",
"image0" : "img2.webp",
"image1" : "img3.webp"
}