{
"name" : "Eddy Restaurant (Kakabeka Falls), The",
"status" : "",
"link" : "https://theeddyrestaurant.com/", 
"hours" : "(Sunday: 10:00 - 20:00), (Monday - Friday: 09:00 - 20:00), (Saturday: 08:00  - 20:00)", 
"tel" : "807-474-3339", 
"sms": "", 
"address" : "4744 Highway 17", 
"map": "https://maps.app.goo.gl/HEj5LQykog1LF7pu6", 
"updated" : "2025-08-28", 
"courtesy" : "Pines Hardware (M!)", 
"text" : "FRESH AND FRAGRANT
<br>STARTERS
<br>MOZZA STICKS $14
<br>Indulge in our house made mozzarella sticks, perfectly crispy and paired with marinara sauce
<br>THE EDDY NACHOS $18
<br>Tortillas crisped in-house then topped with mixed cheese, tomatoes, red & green peppers, green onions, black olives & jalapeños. Served with our chef's house salsa
<br>SWEET POTATO FRIES $10
<br>Fried to a golden crisp. Served with Sweet Chili Aioli
<br>SPINACH & ARTICHOKE DIP $16
<br>Creamy cheese, bell peppers, onion, spinach & artichokes. Dusted with Panko & Parmesan. Served with tortilla chips & fresh salsa.
<br>ONION RINGS $10
<br>Served with house-made beer cheese sauce.
<br>DEEP FRIED PICKLES $12
<br>Fried and served with ranch.
<br>WINGS, RINGS & FRIES $18
<br>Boneless chicken bites tossed in your choice of sauce and a side of ranch, Onion Rings and beer cheese sauce, Fries & Gravy.
<br>SWEET CHILI CHICKEN BITES $18
<br>Boneless chicken bites tossed in sweet chili sauce, red onion, red, green peppers, diced tomatoes and cilantro with sweet chili aioli and served with a side of ranch.
<br>WINGS Single Order - $17 | Double Up - $28
<br>Traditional Bone-in or Boneless Bites
<br>Crisped to perfection then tossed in your choice of sauce. Complimented with Carrot & Celery sticks and ranch for dipping
<br>BUFFALO QUESADILLAS $15
<br>Grilled smokey chicken breast tossed in buffalo sauce, diced tomato, bacon, green pepper, green onion and encased in a crisp tortilla wedge. Served with salsa and sour cream
<br>DAILY-MADE ALWAYS-FRESH
<br>SATISFYING SOUPS
<br>SOUP OF THE DAY Large $9
<br>Made from scratch, in-house and served with a slice of garlic toast.
<br>FRENCH ONION SOUP Large $9
<br>Homemade and rich with caramelized onions. Topped with garlic toast and melted cheese.
<br>A BACK TO TOP
<br>FRESH GREENS
<br>SALADS
<br>CRISP, VIBRANT, AND UTTERLY REFRESHING - NATURE'S BOUNTY IN A BOWL.
<br>SERVED WITH A SLICE OF GARLIC TOAST
<br>CEASER SALAD Side $8/Full $13
<br>Indulge in fresh romaine, bacon bits, and house-made croutons, all tossed in our delectable Ceasar dressing, topped with shredded parmesan
<br>GREEK SALAD Side $8/Full $13
<br>Experience a medley of mixed greens, romaine, tomatoes, red onions, cucumber, and kalamata olives all tossed in our tantalizing Greek dressing. Crowned with feta cheese.
<br>HOUSE SALAD Side $8/Full $13
<br>A delightful blend of spring mixed greens, romaine, tomatoes, cucumber, and red onion, all tossed in our signature house-made vinaigrette.
<br>TREAT YOURSELF!
<br>ADD A GRILLED CHICKEN BREAST TO YOUR SALAD $5
<br>POUTINE
<br>TRADITIONAL $14
<br>Poutine with house-made beef cheese curds, all tossed in a house-made gravy
<br>BUFFALO CHICKEN $17
<br>Deep-fried and breaded chicken bites tossed in buffalo chicken sauce, mixed with cheese curds, all tossed in our house-made gravy and served with buffalo ranch sauce.
<br>THE EDDY POUTINE $17
<br>Hand-cut fries, ground beef, green onions, peppers, tomato & cheese curds covered in house made gravy.
<br>MAINS
<br>MADE WITH LOVE
<br>THE EDDY BURGER $19
<br>Our signature Eddy burger with a juicy beef patty topped with crumbled cheese bacon, mushrooms and onion rings on a freshly toasted brioche bun. Served with a slice of house-made beer cheese sauce. Served with fries.
<br>JALAPENO, BACON, CHEDDAR BURGER $18
<br>A juicy beef patty topped with a bacon, jalapeño, cheddar, lettuce, tomato and red onion. Served with fries
<br>MUSHROOM & SWISS BURGER $18
<br>Juicy beef patty topped with mushrooms, onions, Swiss cheese. Served with bacon and an onion ring.
<br>CHICKEN CORDON BLEU BURGER $17
<br>Crispy chicken breast, ham, Swiss cheese, mayo, and our secret Eddy sauce. Served with fries
<br>BUTTER FINGERS $17
<br>Crispy chicken strips, tossed in a house-made butter sauce. Served with fries
<br>BEER BATTERED FISH FILLETS 1 PIECE - $18 | 2 PIECE - $23
<br>Our crispy, golden beer-battered fish fillets. Served with fries and a side of coleslaw and a wedge of lemon.
<br>BEER BATTERED FISH BURGER $15
<br>Crispy, golden beer-battered fish fillet. Served with tartar sauce, lettuce and tomato. Served with fries and coleslaw.
<br>THE HAMBURGER - $15
<br>START WITH A TOASTY BUN AND OUR HAND PRESSED SOY-GROUND BEEF PATTIES, TOPPED WITH LETTUCE, TOMATO, ONIONS, PICKLES, AND MAYO. ENJOY YOUR BURGER WITH FRIES.
<br>WHAT'S AVAILABLE:
<br>DOUBLE PATTY +$2
<br>TRIPPLE PATTY +$4
<br>ADD CHEESE +$2
<br>ADD BACON +$3
<br>GLUTEN FREE BUN OR BREAD +$2
<br>UPGRADE YOUR SIDE:
<br>SOUP DE JOUR $3
<br>SWEET POTATO SIDES $4
<br>CEASER, GREEK OR HOUSE SALAD $5
<br>BREAKFEAST
<br>MORNING CLASSICS
<br>GET YOUR DAY STARTED RIGHT WITH THESE TIMELESS MORNING DISHES, SERVED WITH CRISPY HOME FRIES AND PERFECTLY TOASTED BREAD.
<br>THE EDDY BENNY $16
<br>Two perfectly poached eggs, ham, and our house-made hollandaise sauce.
<br>THE EDDY $18
<br>Hand-pressed beef patty, hashbrowns, bacon, ham, sausage and two scrambled eggs.
<br>EGGS BENEDICT $16
<br>Two perfectly poached eggs on a toasted english muffin, topped with rich hollandaise sauce and ham.
<br>BREAKFAST BOWLS
<br>SATISFY YOUR HUNGER WITH THESE HEARTY BOWLS, SERVED WITH A SIDE OF TOAST
<br>THE EDDY SCRAMBLER $17
<br>Two perfectly scrambled eggs with ham, bacon, peppers, green onions, mixed cheese, and crumbled eggs. Served with home fries.
<br>BREAKFAST POUTINE $17
<br>Home fries, cheese curds, green onions, mixed peppers, mushrooms, hollandaise sauce, and gravy.
<br>OMELET CHOICES
<br>INDULGE IN THESE FLAVOURFUL OMELETS, SERVED WITH HOME FRIES AND YOUR CHOICE OF TOAST.
<br>MEAT LOVERS $18
<br>A savory omelet filled with bacon, ham, sausage, and mixed cheese.
<br>DENVER $17
<br>A classic Denver omelet with diced ham, bell peppers, ham, bacon, green onion, and mixed cheese.
<br>GREEK $15
<br>A flavorful Greek omelet with black olives, tomatoes, red onions, and tangy feta cheese.
<br>SWEET AND SAVOURY
<br>INDULGE YOUR TASTE BUDS WITH THESE SWEET AND SAVORY OPTIONS. INCLUDES PURE MAPLE SYRUP, SERVED WITH YOUR CHOICE OF BUTTERMILK PANCAKES, BACON, HAM, OR SAUSAGE.
<br>BUTTERMILK PANCAKES $15
<br>Three fluffy pancakes with pure maple syrup.
<br>FINN PANCAKES $15
<br>Three pancakes with blueberries, served with bacon, ham, or sausage.
<br>FRENCH TOAST $14
<br>Three pieces of perfectly grilled bread, accompanied by your choice of bacon, ham or sausage.
<br>LIGHER OPTIONS
<br>ENJOY A LIGHTER BREAKFAST WITH THESE GOURMET OPTIONS.
<br>SENIOR SPECIAL+ $13
<br>One egg, your choice of bacon, ham, or sausage, and a slice of toast.
<br>ONE EGGER $9
<br>One egg, your choice of bacon, ham, or sausage, a slice of toast.
<br>LITTLE CAKES $7
<br>Two pancakes served with your choice of pure maple syrup.
<br>HANDHELD TREATS
<br>FOR A QUICK AND SATISFYING BREAKFAST, TRY THESE HANDHELD DELIGHTS
<br>BREAKFAST SANDWICH $9
<br>A classic fried egg with melted cheese on a toasted English muffin
<br>WESTERN SANDWICH $12
<br>A classic Western omelet with two scrambled eggs, ham, bacon, sausage, green onion, and a drizzle of hollandaise. Served with salsa
<br>KB WRAP $12
<br>A soft flour tortilla filled with grilled chicken breast, bacon, green onions, and salsa. Served with fries or salad
<br>DENVER SANDWICH $18
<br>A classic Denver sandwich with two scrambled eggs, ham, bell peppers, green onion, and a drizzle of hollandaise. Served with fries or salad
<br>TREAT YOURSELF!
<br>ADD HOME FRIES ON THE SIDE $4
<br>SIDES
<br>HOME FRIES $4
<br>TOAST $3
<br>SIDE BACON, HAM, OR SAUSAGE $5
<br>EGG $2.50
<br>BUTTERMILK PANCAKE $5
<br>FINN PANCAKE $5.50
<br>BEVERAGES
<br>COFFEE CORNER
<br>FRESHLY BREWED MOTHER PARKER'S
<br>REGULAR COFFEE $2.75
<br>DECAF COFFEE $2.95
<br>TEA TEMPTATIONS
<br>SIP AND SAVOR THE FINEST TEA BLENDS
<br>REGULAR TEA $1.95
<br>GREEN TEA $1.95
<br>HERBAL TEA $1.95
<br>Camming Chamomile
<br>Lavender
<br>Peppermint
<br>BLACK TEA $1.95
<br>English Breakfast
<br>Earl Grey
<br>Chai Spice
<br>DECAF BLACK TEA $1.95
<br>MILK MARVELS
<br>CREAMY INDULGENCES FOR ALL AGES
<br>MILK $2.50 / $3.50
<br>CHOCOLATE MILK $2.50 / $3.50
<br>REFRESHING FRUIT JUICES
<br>NATURE'S NECTAR: BURSTING WITH FRESHNESS
<br>APPLE JUICE $2.50 / $3.50
<br>ORANGE JUICE $2.50 / $3.50
<br>FIZZLING FOUNTAIN FAVORITES
<br>BUBBLY BLISS IN EVERY SIP
<br>PEPSI $2.99
<br>DIET PEPSI $2.99
<br>BRISK ICED TEA $2.99
<br>GINGER ALE $2.99
<br>ROOT BEER $2.99
<br>7 UP $2.99
<br>WRAPS
<br>ADD A SIDE OF HAND CUT FRIES - $4
<br>SOUP DU JOUR - $5
<br>SWEET POTATO FRIES - $5
<br>CEASER, GREEK OR HOUSE SALAD - $5
<br>COUNTRY RANCH CHICKEN WRAP $13
<br>Delight in crisp chicken breast strips, mixed greens, tomato, mixed cheese, and our house-made buttermilk ranch
<br>BUFFALO CHICKEN WRAP $13
<br>Savor crispy chicken breast strips tossed in buffalo sauce, mixed greens, bits of bacon, and garlic parmesan aioli
<br>PHILLY STYLE WRAP $14
<br>Tender sliced beef, sauteed onions and peppers, mixed cheese, and Dijon aioli
<br>REUBEN WRAP $14
<br>Montreal smoked meat, sauerkraut, swiss cheese slices and our Roddy sauce all wrapped into a tortilla.
<br>HANDHELDS
<br>SERVED WITH A SIDE OF HAND CUT FRIES
<br>RUEBEN $18
<br>Indulge in Montreal smoked meat, house-made sauerkraut, Swiss cheese, and our secret rody sauce enclosed between marble rye slices
<br>EDDY CLUB $19
<br>Relish a grilled chicken breast crowned with melted cheddar, bacon slices, spring mix, and tomato, all snugly positioned between two slices of toasted bread of your choice brushed with mayo
<br>PHILLY STEAK $19
<br>Satisfy your cravings with a toasted hoagie bun crowned with sliced beef, heaped with sauteed peppers & onions, and smothered in melted mixed cheese
<br>FRISCO MELT $18
<br>Hand-made patty, topped with caramelized onions, signature Roddy's sauce, swiss cheese on grilled rye bread.
<br>BLT $16
<br>Classic BLT with lettuce, tomato, mayo and bacon. Served on your choice of toast.
<br>LUNCH TRIO $16
<br>Soup of the day, half sandwich of the day, and your choice of a small salad.
<br>KID APPROVED
<br>KID MEALS COME WITH A SMALL BEVERAGE
<br>LIL' MARIO BURGER $11
<br>A 5oz patty graced with ketchup and house-made pickles. Served with fries or salad
<br>MAC N CHEESE $9
<br>Delight in creamy cheese sauce cloaking pasta noodles complemented by a slice of toasted white bread
<br>LIL' FINGERS $9
<br>Discover 2 lightly dusted chicken breast fillets, accompanied by plum sauce for dipping, and served with fries or salad
<br>LIL' NACHOS $9
<br>Experience crisp fried corn chips crowned with mixed cheese and served with salsa
<br>SIDES
<br>FRIES $5 / $8
<br>POUTINE $8 / $12
<br>GRAVY $1.50
<br>DIP $1
<br>CHILLED CAN DELIGHTS
<br>CHILL OUT WITH A CAN IN HAND
<br>SPARKLING WATER $1.99
<br>Blackberry Bubbly
<br>Lemon Lime Bubbly
<br>Grapefruit Bubbly
<br>NESTEA $1.99
<br>TONIC WATER $1.99
<br>PEPSI $1.99
<br>DIET PEPSI $1.99
<br>BRISK ICED TEA $1.99
<br>GINGER ALE $1.99
<br>ROOT BEER $1.99
<br>7 UP $1.99
<br>CANNED BEER COLLECTION
<br>CANS OF BREWS TO DELIGHT YOU
<br>Domestic Cans
<br>Bud Light - $5.99
<br>Budweiser - $5.99
<br>Busch - $5.99
<br>Coors Banquet - $5.99
<br>Coors Light - $5.99
<br>Kokanee Original - $5.99
<br>Coolers
<br>Coors Seltzer Extra-Bubbly - $5.99
<br>Clamato Caesar Original - $5.99
<br>Coors Hard Lemonade - $5.99
<br>Palm Bay - $5.99
<br>Twisted Tea - $5.99
<br>Tall Cans
<br>White Claw
<br>Raspberry - $6.99
<br>Blackberry - $6.99
<br>Lime - $6.99
<br>Natural Lime - $6.99
<br>Coors Light Iced T - $6.99
<br>Local Tall Cans (Craft Beers)
<br>Lake Of The Woods
<br>Sultana Gold - $6.99
<br>Lakeside Kolsch - $6.99
<br>Dawson Trail
<br>360 Pale Ale - $6.99
<br>Raspberry Wheat - $6.99
<br>Northern Logger - $6.99
<br>Pilon Belgian Ale - $6.99
<br>Sultana Gold - Blonde Ale - $6.99
<br>RED WINE REVELATIONS
<br>DISCOVER THE RICH AND BOLD REDS
<br>JACKSON - TRIGGS $6.99
<br>Cabernet Sauvignon
<br>Shiraz
<br>Merlot
<br>WHITE WINE WONDERS
<br>ELEGANT WHITES FOR EVERY PALATE
<br>JACKSON - TRIGGS $6.99
<br>Chardonnay
<br>Pinot Grigio
<br>Sauvignon Blanc"
}