{
"name" : "Caddy Shack, The",
"status" : "",
"link" : "", 
"hours" : "(Sunday - Saturday: 10:00 - 19:00)", 
"tel" : "807-475-8925", 
"sms": "", 
"address" : "1350 Mountain Road (Fort William Country Club)", 
"map": "https://maps.app.goo.gl/X75AyzV26A4XkVMW9", 
"updated" : "2025-07-29", 
"courtesy" : "Justin Menu", 
"text" : "THE CADDY SHACK
<br>IN PARTNERSHIP WITH
<br>SELØR
<br>RESTAURANT & WINE
<br>CALL TO ORDER
<br>PICKUP!
<br>807-475-8825 ext 5
<br>BREAKFAST
<br>served until 2pm
<br>Breakfast Sandwich $6
<br>Fried egg & cheddar cheese with your choice of bacon, sausage or grilled tomato on either white Texas Toast, rye, brioche or grilled croissant.
<br>Add home fries for $4
<br>Caddy Shack Breakfast $13
<br>Two eggs & your choice of bacon, sausage or grilled tomatoes, home fries and choice of toast
<br>Eggs Benedict $16
<br>Two soft poached eggs served on top of grilled croissant with choice of bacon, sausage or grilled tomatoes. Topped with house made hollandaise served with home fries.
<br>Roasted Tomato & Feta Omelette $16
<br>Three fresh eggs whipped with roasted tomatoes, spinach and feta cheese, served with home fries and choice of bread
<br>SALADS
<br>Selør Classic $10/$17
<br>Crisp romaine, peppered bacon, charred lemon Caesar dressing, pangrattato, shaved parmesan
<br>Greek Salad $12/$17
<br>Fresh spring mix tossed with greek and feta dressing, cherry tomatoes, red onion, olives, topped with feta cheese
<br>BLT Steak Salad $23
<br>6oz New York Striploin, peppered bacon, mixed greens, tomatoes, buttermilk ranch blue cheese dressing
<br>Buddah Bowl $20
<br>Fried arborio rice, soft boiled soy egg, pickled ginger, variety of fresh vegetables topped with hoisin glaze and sriracha aioli
<br>SNACKS
<br>Chicken Wings 6pc $16/12pc $28/36pc $60
<br>Available in mild, hot, garlic & sesame, salt & pepper, hot honey, caesar, and burnt onion BBQ
<br>Buffalo 'Bon Bon Ribs' $20
<br>Slow cooked baby back ribs, floured and fried golden, tossed in Frank buffalo sauce bbq. Served with your choice of wing sauce
<br>Crispy Dusted Shrimp $15
<br>Lightly dusted and fried jumbo shrimp, served with sweet chili aioli
<br>Grilled Mushroom Flatbread $17
<br>Cremini mushrooms, smoked cheddar cheese, roasted red peppers, & goat cheese, topped with balsamic glaze
<br>HAND HELD
<br>comes with choice of fries or side house salad
<br>upgrade to caesar salad, greek salad or poutine for $3
<br>Chopped Chicken Caesar Wrap $19
<br>Buttermilk fried chicken chopped with peppered bacon, cucumber, Caesar dressing and Parmesan cheese
<br>Buffalo Chicken Wrap $19
<br>Buttermilk fried chicken tossed in our house made buffalo sauce, lettuce, tomato and ranch withen
<br>Caddy Shack Burger $17
<br>Two 3oz fresh ground beef patties topped with caramelized bacon jam, roasted tomatoes, spring mix, shack sauce & smoked cheddar cheese. Served on a grilled brioche bun.
<br>Classic Canadian Burger $17
<br>Two 3oz fresh ground beef patties, cheddar cheese, ketchup, mustard, mayo, house made pickles, served on a grilled brioche bun
<br>...add bacon $2 ...add fried egg $2 ...add bacon jam $2
<br>Montreal Smoked Meat Sandwich $18
<br>Lightly sauteed smoked meat on a grilled sourdough bread with Dijon aioli and fried cabbage
<br>Pulled Pork Grilled Cheese $20
<br>Slow roasted pork tossed in our house made burnt onion BBQ sauce, bacon onion jam, smoked cheddar cheesem a grilled sourdough bread
<br>Caddy Shack Club $20
<br>Grilled chicken breast, tossed in our burnt onion BBQ sauce with smoked cheddar cheese, roasted tomatoes & lettuce. Served on choice of bread
<br>CLASSICS
<br>NY Steak Sandwich $23
<br>Served on grilled focaccia, garlic aioli, sauteed mushrooms in red wine beef paste. Served with choice of side
<br>Shrimp Po Boy $20
<br>Jumbo tiger shrimp, lightly fried, served on grilled focaccia with house made pickles, roasted tomatoes and sweet chili aioli served with choice of side
<br>Orecchiette Pasta $22
<br>Grilled chicken, peppered bacon, roasted red peppers, in a maple cream sauce served with toasted focaccia
<br>Baby Back Ribs Half $20/Full $28
<br>Slow smoked back ribs with our house made burnt onion BBQ sauce, served with choice of side"
}