{
"name" : "Bread & Butter (Inside Goods & Co.)",
"status" : "",
"link" : "https://www.theneighbourscooking.ca/", 
"hours" : "(Sunday: 11:00 - 16:00), (Tuesday - Friday: 11:00 - 18:00), (Saturday: 11:00 - 16:00) * - online orders possible after these times, check the website for availability", 
"tel" : "807-699-6026", 
"sms": "807-699-6026", 
"address" : "251 Red River Road (Inside Goods & Co.)", 
"map": "https://maps.app.goo.gl/qBLufNZdwcFiKdwn6", 
"updated" : "2025-12-05", 
"courtesy" : "Chef Fred",
"text" : "
BREAD & BUTTER
<br>FROM THE NEIGHBOURS' COOKING
<br>Sandwiches
<br>TIMELESS CLASSICS
<br>Traditional Clubhouse $13.99 Chicken, Mayo, Cheese, Lettuce, Tomato; and Bacon on three layers of House Toast
<br>Herbaceous Chicken $11.99 Chicken, Herbaceous Mayo, Leafy Greens, Tomato, Red Onion; and Swiss on Grilled House Loaf
<br>The Reuben $12.99 House Cured Beef, Swiss Cheese, Sauerkraut; and Russian Dressing on Grilled Rye
<br>Beef Dip & Au Jus $15.99 House Roast Beef, Caramelised Onions, Provolone on Baguette; served with Jus
<br>Classic B.L.T. $7.99 Bacon, Lettuce, Tomatoes; and Mayo on House Toast Make it Wicked: Herbaceous Mayo, Celery, Havarti and Dill Bacon + $3
<br>Cubano $10.99 Pulled Pork, Sliced Ham, Mustard, Mayo, Swiss Cheese; and Pickle on Baguette
<br>Grilled Cheese Special $?? Check The Specials Board To See What This Weeks Grilled Cheese Is! (This Item Changes Every Week)
<br>WICKED SANDO'S
<br>The Neighbours Clubhouse $15.99 Chicken, Crave Sauce, Havarti, Lettuce, Tomato, Pickle; and extra Bacon on three layers of Brioche
<br>Jerk Chicken $11.99 Pulled Jerk Chicken, Shaved Lettuce, Tomatoes, Red Onion and Sweet Potato Ginger Puree on Baguette
<br>Pulled Pork $11.99 Tender Pulled Pork, Roasted Garlic Mayo, Havarti; and Crispy Fried Onions on Brioche
<br>Lamb on Rye $11.99 Sliced Gyro Loaf, Roasted Zucchini, Red Onion and Our Green Mayo on Rye
<br>Your Heros Hero $17.99 Sliced Gyro Loaf, Ham, Turkey & Salami with Shaved Lettuce, Tomato, Red Onion, Banana Peppers, Roasted Garlic Mayo, Mustard, Swiss & Havarti on house-made Baguette.
<br>VEGGIE LOVERS
<br>Chickpea $10.99 Chickpea Salad, Mayo, Lettuce, Tomato; and Red Onion on House Toast
<br>Mushroom Dip $16.99 Sautéed Fried Mushrooms, Caramelised Onion, Havarti and Roasted Garlic Mayo on Baguette served w/ Mushroom Jus
<br>Pulled Jack Sandwich $13.99 Tender Pulled Jack Fruit, Roasted Garlic Mayo, Crispy Fried Onions, Havarti on Brioche
<br>Italian Roasted Veg $12.99 Roasted Veg (Zucchini, Eggplant and Red Onions) with Leafy Greens, Tomatoes and Herb Mayo
<br>READY TO ORDER?
<br>VISIT OUR WEBSITE & PLACE YOUR ORDER ONLINE
<br>PRE-ORDER: PICK-UP, DELIVERY, DINE IN
<br>WWW.THENEIGHBOURSCOOKING.CA
<br>Salads
<br>Garden House $10.99 Mixed greens, Tomato, Red Onion, Carrot, Cheddar, and House Croutons. Dressings: Vinaigrette/ Ranch/ Russian/ Horseradish Ranch
<br>As Side: $3.50.
<br>Chickpea Salad $7.99 Chickpea, Celery, Red Onion, Bell Pepper, Dill all tossed in our Creamy Crave Dressing
<br>(as a side $2.99)
<br>Maple Bacon Wedge $12.99 Hearty wedge of iceberg lettuce crowned with smoky maple bacon, house-pickled green beans, and sliced green onions, all finished with our bold horseradish ranch.
<br>Caesar $12.99 Chopped Romaine Lettuce, House made Croutons, Red Onions, Chopped Bacon; and Creaming Caesar Dressing
<br>Boss Bowls
<br>Check Our Specials Board For our Amazing Boss Bowls! Specials Range From Home Made Soups, Stews and Chillis to Oooey Gooey Mac & Cheese. You Never Know What's On Special.
<br>BEVERAGES
<br>POP Cans $1.5
<br>Jones Soda $2.5
<br>Water Btl. $1
<br>Hosting an event? Let's make it delicious.
<br>From team lunches and private dinners to birthdays and pop-ups, we offer flexible catering with bold, homemade flavours you won't forget.
<br>Build your own menu with hot dishes, sandwich platters, salads, and our signature sauces—crafted with the same care we bring to every Neighbours event.
<br>And if you need a venue, we've got you covered. Ask about booking The Spot on Red River for your next gathering.
<br>Great food. Thoughtful service. A space that feels like home.
"
}