{
    "link": "",
    "hours": "(Wednesday - Sunday: 17:00 - 22:00)",
    "tel": "tel: 807-767-2013",
    "sms": "",
    "address": "Address: 230 Bay Street",
    "map": "https:\/\/maps.app.goo.gl\/5nfu1mLU68nDMvmA9",
    "updated": "Updated: 2024-11-07",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Includes a side of Italian Salad with our in-house red wine vinaigrette and fresh homemade bread.<br\/><br\/>Classic Calabrese Spaghetti &amp; Meatballs 24.95 Homemade Calabrese-style meatballs braised in rich marinara sauce and served over a bed of pasta.<br\/>Italian Stuffed Sweet Pepper 27.95 Bell pepper stuffed with a Calabrese-style meat and ricotta cheese mixture, smothered in a rich marinara and topped with melted mozzarella and served with pasta.<br\/>Pork Cutlet 27.95 Lightly breaded pork cutlet smothered in our savory marinara sauce and topped with melted mozzarella cheese. Served with a side of pasta (penne, spaghetti or rigatoni).<br\/>Spinach Manicotti 29.95 Two large manicottis with fresh spinach, herbs, ricotta cheese and marinara, baked to perfection.<br\/>Chicken Cacciatore 27.95 Fall off the bone chicken, slow-cooked in a vegetable broth rich in herbs and vegetables, served on a bed of pasta.<br\/>Shrimp Stuffed Jumbo Shells 29.95 Fresh shrimp, spinach and ricotta cheese stuffed into two jumbo shells and topped with marinara and melted mozzarella cheese.<br\/>Seafood Lasagna 32.95 Crab, scallop &amp; shrimp with herbs and vegetables all combined in a rich cream sauce.<br\/>Chicken Parmesan 27.95 Breaded chicken breast smothered in our marinara and topped with mozzarella cheese, served with pasta.<br\/>Calabrese-Style Meat Lasagna 28.95 Ricotta cheese, herbed ground beef prepared Calabrese-style, slow-baked in rich cheeses and marinara.<br\/>Gnocchi and Marinara 25.95 Hand-crafted gnocchi with herbs - absolutely the best! Served with our in-house marinara sauce.<br\/><br\/>ZUPA E INSALATE (Soups and Salads)<br\/><br\/>Italian Salad $12.95 \/ L $16.95 Romaine lettuce, red onion, tomato and cucumber tossed in our homemade Italian dressing.<br\/>Caesar Salad $12.95 \/ L $18.95 Romaine lettuce, bacon and house-made croutons tossed in creamy Caesar dressing and sprinkled with parmesan cheese.<br\/>Tomato Salad $14.95 \/ L $18.95 Vine ripened tomatoes, red onion, green pepper and fresh basil tossed in a homemade olive oil dressing rich in herbs and sprinkled with fresh oregano.<br\/>Tortellini Soup $14.95 \/ L $17.95 Meat filled tortellini in a rich Calabrese-style vegetable and chicken broth.<br\/>ANTIPASTI (Appetizers)<br\/><br\/>Antipasto Plate 24.95 Homemade Italian bread toasted with a rich garlic butter and cheese.<br\/>Calabrese Bruschetta 14.95 Homemade Italian bread with a generous serving of our bruschetta mixture including olives, tomatoes, peppers, sweet basil, red onion, parmesan and drizzled with melted mozzarella cheese.<br\/>Garlic Bread 6.95 Homemade Italian bread baked with a rich garlic butter and cheese.<br\/>Deep Fried Ravioli 16.95 Lightly breaded ravioli deep-fried and served with marinara sauce.<br\/>Breaded Calamari 16.95 Lightly breaded calamari rings deep-fried and served with marinara sauce.<br\/>Mozzarella Sticks 17.95 Lightly breaded mozzarella sticks served with marinara sauce.<br\/>Shrimp Cocktail 16.95 Fresh jumbo shrimp, chilled and served with a delicious tangy cocktail sauce and fresh lemon.<br\/>GOURMET PIZZA E PANZAROTTO<br\/><br\/>All pizzas and panzarottos include mozzarella cheese. You may choose additional toppings with prices which are included in the price.<br\/><br\/>Pizza 12&quot; $22.95<br\/>Panzarotto 19.95<br\/>Additional Toppings 1.50 each<br\/>Green Olives | Black Olives | Green Pepper | Red Pepper | White Onion<br\/><br\/>Premium Toppings 2.00 each<br\/>Sun Dried Tomatoes | Artichoke | Pancetta | Hot Peppers | Sausage | Sopressata",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "name": "La Casa Nostra Ristorante"
}