{
"name": "Brew Pub, The",
"link": "https://prospectorsteakhouse.com/the-brew-pub",
"hours": "(Sunday - Thursday: 16:00 - 21:00), (Friday - Saturday: 16:00 - 22:00)",
"tel": "tel: 807-345-5833",
"sms": "",
"address": "Address: 23 Cumberland Street South",
"map": "https://maps.app.goo.gl/6asGD7g5QaHCBcGA9",
"updated": "Updated: 2026-01-31",
"courtesy": "Courtesy: Justin Menu",
"text": "
THE BREW PUB - THUNDER BAY, ONTARIO
<br>Fried Green Pickles - in-house sauce. 9.5
<br>Baked Brie - red pepper jelly. 16
<br>Prime Rib Meatballs - reduced bourbon sauce, w smeared mashed potato. 15
<br>Dip Trio - garlic hummus, roasted red pepper dip, and fresh guacamole, all house made, served w tortilla chips and toasted flatbread. 18
<br>Braised Beef Buffalo Dip - tender braised beef, buffalo sauce, cream cheese, melted marble cheese, served w pita bread and crispy tortilla chips. 18
<br>Pierogies - locally sourced, potato and cheese dumplings, homemade just like баба used to make. Served w sour cream, bacon, and onions. 16
<br>BBQ Braised Beef Poutine - house cut fries topped with prime rib braised in our house-made whiskey BBQ sauce, cheese curds, pickled onions and horseradish aioli. 20
<br>Mac and Cheese - house-made and top-secret beer sauce, w gratin. 16
<br>Wings - choice of sauce - mild, medium, hot, whiskey bbq, dry cajun, dry salt n pepper. 16
<br>Loaded Nachos - house-made chips, braised prime rib, bacon, jalapenos, green onions, roasted red peppers, tomato, green olives w salsa and sour cream. 23
<br>Summer Greens Mix - pecans, strawberry, vinaigrette, goat cheese. 15 Add Chicken 7
<br>The Pub Double - two 4oz patties topped with cheese, bacon, pickles, lettuce, tomato, frizzled onions, and mayo. 20
<br>Braised Sammy - our braised and pulled prime rib topped with coleslaw. 19
<br>Steak Sandwich - 8oz Sirloin, with sweet and sour peppers and goat cheese. 24
<br>Butter Chicken - the real deal w traditional spices, chicken, rice, and naan bread. 18
<br>Coconut Curry - linguine noodles, shrimp, green onion, peanuts, red thai curry sauce. 18
<br>Steak Frites - 5oz NY Strip, creole shrimp and potato wedges. 29
<br>Moose Print - Our very own bun recipe, deep fried, with cinnamon, ice cream, and caramel. 8
<br>Cheesecake - Homemade and delicious - topped w berry, caramel, or chocolate. 11
"
}