{
"name" : "Dawson Diner",
"status" : "",
"link" : "", 
"hours" : "", 
"tel" : "807-768-0943", 
"sms": "", 
"address" : "1889 Dawson Road", 
"map": "https://maps.app.goo.gl/GGHLJmDeWYfXDX7fA", 
"updated" : "2024-10-27", 
"courtesy" : "Justin Menu", 
"text" : "Salads<br/>Chef Salad: $16.50 Salad greens, ham, turkey, cheese, tomatoes, red onion, cucumber, and hard-boiled egg.<br/><br/>Caesar Salad: Small $9.00, Large $15.00 Fresh crisp romaine lettuce, bacon bits, parmesan cheese, seasoned croutons, and creamy dressing.<br/><br/>Greek Salad: Small $9.00, Large $15.00 Salad greens, cucumber, tomatoes, red onion, green peppers, black olives, and feta cheese.<br/><br/>Tossed Salad: Small $8.00, Large $13.00 Salad greens, cucumbers, tomatoes, green onions. Add crispy or grilled chicken: $5.00 Add steak strips: $9.00<br/><br/>Soup of the Day: Small $5.00, Large $7.50<br/><br/>Garlic Bread: 3 pieces $4.95<br/><br/>Dinner Classics<br/>Turkey Dinner: $19.00 Tender slices of white and dark meat topped with gravy, savory stuffing, choice of potato, vegetable of the day, and cranberry sauce. White meat only: Add $2.50<br/><br/>Liver &amp; Onions: $19.50 Two pieces of tender baby beef, topped with caramelized onions. Served with choice of potato and vegetable of the day.<br/><br/>Pork Chop Dinner: $19.50 Two grilled pork chops served with choice of potato, vegetable of the day, and a side of apple sauce.<br/><br/>Salisbury Steak: $19.50 12 oz seasoned beef patty topped with grilled onions and smothered in gravy. Served with choice of potato and vegetable of the day.<br/><br/>Steak Dinner: $19.50 6 oz seared striploin steak served with grilled garlic bread, choice of potato, and vegetable of the day. Add saut&#233;ed mushrooms and onions: $2.50<br/><br/>Beer Battered Haddock: $20.50 8-1/2 oz battered fillet served with fries, coleslaw, and a side of tartar sauce.<br/><br/>Pastas<br/>Chicken Parmesan: $19.50 Breaded chicken breast topped with marinara sauce and melted mozzarella cheese served on a bed of spaghetti with a side of garlic bread.<br/><br/>Lasagna: $18.50 Layers of lasagna noodles, creamy ricotta cheese, savory homemade Italian meat sauce, and topped with grilled mozzarella cheese. Served with a side of garlic bread.<br/><br/>Additional Information<br/>All dinner classics are served with your choice of salad or soup-of-the-day.<br/><br/>Upgrade to Greek or Caesar salad: Add $1.50<br/><br/>Senior&#8217;s Menu<br/><br/>Breakfast<br/>Omelette - $12.00 Two egg cheese omelette with your choice of 2 fillings. Choose from: bacon, ham, sausage, onion, green pepper, tomato, or mushrooms. Served with one slice of toast and home fries.<br/><br/>Fresh Plate - $11.00 Kickstart your day with a nutritious and tasty breakfast plate! Includes a side of seasonal fresh fruit, creamy yogurt, and your choice of a fresh muffin-of-the-day or a toasted English muffin. Goodness in every bite!<br/><br/>Dinner<br/>Salisbury Steak - $15.50 One 6 oz patty topped with fried onions and gravy. Served with choice of potato and vegetable of the day.<br/><br/>Fish &amp; Chips - $15.50 A smaller portion of our battered Haddock. Served with coleslaw, tartar sauce, and fries.<br/><br/>Beverages<br/>Coffee - $2.75<br/><br/>Tea - $2.75<br/><br/>Milk (SM $3.00, LG $4.00)<br/><br/>Chocolate Milk (SM $3.00, LG $4.00)<br/><br/>Juice (apple, orange, cranberry) (SM $3.00, LG $4.00)<br/><br/>Hot Chocolate - $3.00<br/><br/>Bottled Water - $2.25<br/><br/>Bottled Pop - $4.00<br/><br/>Canned Pop - $3.00<br/><br/>Hot Sandwiches<br/>Hot Turkey - $17.50 Juicy mix of homecooked white and dark meat piled high and smothered in turkey gravy. White meat only ADD $2.50.<br/><br/>Hot Roast Beef - $17.50 In-house slow roasted beef sliced thin, piled high, and smothered in beef gravy.<br/><br/>Hot Hamburger - $17.50 6 oz patty cooked to juicy perfection. Served on bread and smothered in gravy.<br/><br/>Hot Hamburger Nip - $17.50 Served on a bun with mustard, relish, and onion and smothered in beef gravy.<br/><br/>Everyday Favourites<br/>Perogies - $16.50 6 locally made classic potato and cheddar cheese filling, saut&#233;ed with onions and bacon, and served with sour cream.<br/><br/>Quesadilla - $16.50 A large flour tortilla, generously filled with beef, chicken, or pulled pork, topped with cheddar cheese and tomatoes. Served with sour cream and salsa.<br/><br/>Chicken Fingers - $16.00 4 tender strips of chicken breast breaded and fried to a golden-brown. Served with dipping sauce.<br/><br/>Chicken Caesar Wrap - $16.00 Crispy chicken breast, bacon, romaine lettuce, parmesan cheese, and Caesar dressing in a flour tortilla.<br/><br/>BBQ Pulled Pork - $16.50 Savory BBQ pulled pork, slow-cooked and piled high on a toasted bun topped with crunchy coleslaw and crispy onions.<br/><br/>Classic Philly Cheesesteak - $16.50 Thin Philly-style steak with saut&#233;ed mushrooms, onions, peppers, and melted cheese on a hoagie bun.<br/><br/>Sides<br/>Fries - $8.00<br/><br/>Gravy - $3.00<br/><br/>Coleslaw - $2.00<br/><br/>Sweet Potato Fries - $9.00<br/><br/>Poutine - $10.50<br/><br/>Onion Rings - $8.50<br/><br/>Garlic Bread - $4.95<br/><br/>ALL-DAY BREAKFAST<br/><br/>Pancakes 11.50 A TASTE OF TRUE NORDIC TRADITION. Three thin and delicate Finnish style pancakes cooked perfectly light and golden &#8212; OR &#8212; 3 fluffy golden-brown pancakes sprinkled with powdered sugar.<br/><br/>Belgian Waffle 13.50 A decadent thick and airy Belgian waffle, crispy and golden-brown on the outside and fluffy on the inside. Served with syrup, butter and a bit of OMG! Add our silky strawberry or blueberry sauce and whipped cream to any of the above for an additional 5.00<br/><br/>French Toast 12.50 Three thickly sliced, lightly grilled, cinnamon-vanilla French toast dusted with powdered sugar.<br/><br/>Stuffed French Toast 17.50 BERRY-CREAM &#8212; Our classic French toast stuffed with sweet cream cheese and strawberry or blueberry sauce. Sprinkled with powdered sugar and topped with whipped cream. &#8212; OR &#8212; S&#8217;MORES&#8230; A campfire classic reimagined. Nutella and marshmallow fluff stuffed into our classic French toast, topped with whipped cream, mini chocolate chips and crumbled graham cookies.<br/><br/>Lappe Lumberjack 18.50 YOU DON&#8217;T HAVE TO WEAR PLAID TO ORDER THIS! 3 eggs, 3 bacon, 3 sausages, 3 ham, home fries and your choice of 3 mini fluffy &#8212; OR &#8212; Finnish pancakes &#8212; OR &#8212; 3 slices of toast.<br/><br/>Classic Breakfast 14.00 ALL YOUR FAVOURITES! 2 eggs with your choice of ham, bacon or sausage, 2 slices of toast and home fries.<br/><br/>Big 2 15.00 FOR THOSE OF US WHO NEED SWEET AND SAVOURY. 2 eggs, 2 bacon, 2 sausage and 2 pancakes (Finnish or fluffy)<br/><br/>Steak &amp; Eggs 18.50 INDULGE IN OUR CLASSIC HEARTY MORNING OPTION! 6 oz tender grilled triploin steak served with 2 eggs, toast and home fries.<br/><br/>Diner Breakfast Club 17.50 A TRIPLE DECKER DELIGHT, PERFECT FOR BREAKFAST LOVERS! Eggs, bacon, tomato, ham and cheese on 3 pieces of warm toast. Served with home fries.<br/><br/>Eggs Benedict 16.50 A CROWD FAVOURITE! Two perfectly poached eggs with your choice of ham or bacon, nestled on top of a griddled English muffin. Generously topped with velvety Hollandaise sauce and sprinkled with paprika. Served with a side of home fries and a lot of MM-MM-MMM. UPGRADE to peameal bacon: ADD 2.50<br/><br/>Fresh Breakfast Plate 13.00 ON THE LIGHTER SIDE! A fresh take on breakfast with a side of seasonal fruit. Creamy Greek yogurt topped with granola and honey and choice of fresh muffin-of-the-day or toasted English muffin.<br/><br/>Omelettes Our 3-egg omelettes are generously portioned and packed with your favourite fillings. Served with golden hash browns and a side of toast. Start with&#8230; CHEDDAR CHEESE 13.50 Add your choice of filling, ADD 1.00 each: Ham, bacon, sausage, mushroom, onion, green pepper, tomato<br/><br/>Around the World in Easy Days<br/><br/>The CANADIAN 16.50 bacon, ham, sausage and cheese<br/><br/>The AMERICAN 17.50 bacon, ham, mushrooms, onions, peppers, tomato and cheese<br/><br/>The GREEK 16.50 black olives, red onions, tomato, green pepper and feta cheese<br/><br/>The MEXICAN 16.00 taco beef, onion, peppers, cheese and salsa<br/><br/>The CALIFORNIAN 17.00 tomato, onion, peppers, mushrooms, spinach and cheese<br/><br/>The SPICY ITALIAN 18.00 hot mortadella, hot capicola, hot sausage, hot peppers and provolone cheese<br/><br/>Scramblers ADD 3.00 Make any of your favourite omelettes into a delicious scrambler, smothered in rich velvety Hollandaise sauce.<br/><br/>Breakfast Sides<br/><br/>Toast &amp; Jam 3.50<br/><br/>Hollandaise Sauce 4.00<br/><br/>1 Egg 2.50<br/><br/>Fruit Cup 2.95<br/><br/>Diner Sandwiches<br/>Sliced Turkey: $9.50<br/><br/>White turkey slices, lettuce, cheese, mayo, and cranberry sauce.<br/><br/>BLT: $9.50<br/><br/>Bacon, lettuce, tomato, and mayo.<br/><br/>Egg Salad or Tuna Salad: $9.00<br/><br/>Grilled Cheese: $9.00<br/><br/>Add ham or bacon for $1.00.<br/><br/>Western: $9.75<br/><br/>Bacon, tomato, onion, and cheddar cheese.<br/><br/>Denver: $9.75<br/><br/>Ham, onion, and cheddar cheese.<br/><br/>Specialty Sandwiches<br/>Monte Cristo: $17.00<br/><br/>Tender white meat turkey slices, ham, Swiss cheese, and mayo, between two pieces of bread dipped in egg and cooked until golden.<br/><br/>Turkey Clubhouse: $17.50<br/><br/>Turkey breast, bacon, tomato, lettuce, and mayo.<br/><br/>Steak Sandwich: $18.50<br/><br/>6 oz striploin steak with saut&#233;ed onions, bell peppers, and melted cheese on a toasted hoagie bun.<br/><br/>Reuben: $17.00<br/><br/>Corned beef, sauerkraut, Swiss cheese, and Thousand Island mayo on grilled marble rye.<br/><br/>Pattie Melt: $17.00<br/><br/>6 oz patty with saut&#233;ed onions, cheddar cheese, and Thousand Island mayo on marble rye.<br/><br/>Diner Burgers<br/>Hamburger: $12.50<br/><br/>Cheeseburger: $13.50<br/><br/>Bacon Cheeseburger: $14.50<br/><br/>Specialty Burgers<br/>Double-D Burger: $19.00<br/><br/>Two 6 oz patties with BBQ sauce, American cheese, bacon, onion rings, and a fried egg on a toasted bun.<br/><br/>Mushroom Swiss Burger: $17.00<br/><br/>Saut&#233;ed mushrooms and onions, Swiss cheese, and garlic aioli.<br/><br/>Mozzo Burger: $17.00<br/><br/>Bacon, mozzarella cheese, lettuce, tomato, and Thousand Island dressing.<br/><br/>Finn Burger: $18.00<br/><br/>Two 6 oz patties with cheese, lettuce, tomato, red onion, and Finn mustard.<br/><br/>Crispy Chicken Burger: $17.00<br/><br/>Breaded and fried chicken breast with lettuce, tomato, and mayo.<br/><br/>Buffalo Chicken Burger: $17.50<br/><br/>Hot Honey Chicken Burger: $17.50<br/><br/>Upgrades<br/>Poutine: Add $6.00<br/><br/>Onion rings: Add $3.00<br/><br/>Sweet potato fries: Add $2.00<br/><br/>Greek or Caesar Salad: Add $1.50<br/><br/>Add fries, side salad, or cup of soup to any sandwich for an additional $5.00.<br/><br/>All sandwiches are served on your choice of white, brown, or rye bread and served with pickle slices. Marble rye: Add $1.50. Gluten-free: Add $1.50"
}