{
"name" : "Cheers the Village Pub",
"status" : "tc",
"link" : "", 
"hours" : "TBA", 
"tel" : "", 
"sms": "", 
"address" : "1500 James Street South", 
"map": "https://maps.app.goo.gl/zpGuWMUMtTsagAFR7", 
"updated" : "2025-07-11", 
"courtesy" : "Justin Menu", 
"text" : "Sandwiches<br/>The Farmer's Choice Steak Sandwich<br/><br/>Description: Served open-faced on garlic toasted focaccia bread, AAA free-range grass-fed 8oz New York strip marinated in a garlic, ginger, and dry mustard marinade cooked how you want it, topped with a garlic saut&#233;ed medley of crimini mushrooms, red and yellow peppers, served with the side of your choice.<br/><br/>Price: $15.00<br/><br/>Cheer's Blackened Chicken Club<br/><br/>Description: A fire-blackened chicken breast topped with a slice of provolone, roasted red peppers, lettuce, tomato, and chipotle mayo on a toasted ciabatta bun.<br/><br/>Price: $12.00<br/><br/>Note: Organic chicken usually (in stock; ask server)<br/><br/>Additional Note: All sandwiches listed: Sides include loaded mashed potatoes, loaded potato skins, sweet potato, onion rings or a side Caesar salad or for an extra $2.50 for a side toasted almond (house salad).<br/><br/>Burgers<br/>Cheer's Beef or Bison Burger<br/><br/>Description: Grilled to perfection topped with smoked gouda or jalapeno gouda cheese (your choice), peppered bacon, garlic saut&#233;ed crimini mushrooms, crispy cajun onions and chipotle mayo with your choice of sides.<br/><br/>Price: $12.00 / $15.00 for Bison<br/><br/>Garlic Roasted Red Pepper Chevre Burger<br/><br/>Description: Grilled to perfection topped with a slice of prosciutto, garlic roasted red peppers and chevre goat cheese.<br/><br/>Price: $12.00 / $15.00 for Bison<br/><br/>Cheer's Cheese Burger or Hamburger<br/><br/>Description: Grilled to perfection with or without cheese, smoked gouda or jalapeno gouda cheese.<br/><br/>Price: Not listed<br/><br/>Appetizers and Snacks<br/>Pita Chip Nachos: $13.00<br/><br/>Crisp pita chips layered with a three cheese mixture, prosciutto, balsamic reduction, diced tomatoes, pesto, red and yellow peppers, finished with balsamic glaze and green onion.<br/><br/>Twice Baked Loaded Potato Skins: $9.00<br/><br/>Potato skins stuffed with a garlic mashed potato mix, bacon, tomato, mixed with a three cheese blend, oven baked to perfection and finished with fresh green onions.<br/><br/>Ultimate Stuffed Mushrooms: $9.00<br/><br/>Garlic saut&#233;ed crimini mushrooms caps stuffed with goat cheese and smoked with a roasted red pepper mix then wrapped in prosciutto and baked to perfection.<br/><br/>Steak Cut Onion Rings: $6.00<br/><br/>Thick cut onion rings deep fried to a golden brown served with chipotle mayo for dipping.<br/><br/>Panko Breaded Pickerel Fingers: $9.00<br/><br/>Fresh panko breaded pickerel fried to a golden brown and tossed in a light cajun spice. Served with a creamy dill dipping sauce and fresh lemon wedges.<br/><br/>Garlic Pizza Bread: $10.95<br/><br/>Two pieces of toasted ciabatta buns topped with roasted fresh mozzarella, pepperoni, caramelized onions, green pepper, and romano cheese baked to perfection.<br/><br/>Cheer's Feta Bruschetta: $9.95<br/><br/>Garlic toasted focaccia bread topped with diced tomato, green pepper, and red onion, mixed with a garlic basil oil baked with fresh feta cheese.<br/><br/>Salads<br/>Garlic Chicken Caesar<br/><br/>Description: Crisp romaine lettuce, bacon bits, poached pears, tossed in a creamy caesar dressing topped with seasoned grilled chicken, shredded pecans and served with a fresh lemon wedge.<br/><br/>Price: $12.50<br/><br/>Chef's Toasted Almond Steak Salad<br/><br/>Description: Spring mixed lettuce, halved cherry tomato, red onion, toasted shaved almonds covered in a garlic maple vinaigrette topped with an 8oz AAA farm fresh grilled, dry marinated and grass marinated New York strip and cherry tomatoes.<br/><br/>Price: $16.00<br/><br/>Chef's Toasted Almond Tossed<br/><br/>Description: Romaine or spring mix lettuce topped with tomato, cucumber, red onion, toasted almonds and goat cheese with your choice of dressing.<br/><br/>Price: $11.00<br/><br/>Pasta and Fish<br/>Linguine Chicken or Veg Alfredo<br/><br/>Description: (A different take on a classic) Broccoli, cauliflower, red and yellow peppers, snow peas, blackened chicken, sweet basil and garlic saut&#233;ed to perfection then added to a real cream alfredo sauce reduction topped with a fresh blend of parmesan and asiago garnished served with garlic toasted focaccia. (Vegetable alfredo usually as much veg.)<br/><br/>Price: $14.50 (Chicken)<br/><br/>Price: $12.50 (Vegetable with more added veg)"
}