{
"name" : "Coconut Shell (Kakabeka Falls), The",
"status" : "",
"link" : "", 
"hours" : "(Monday: 18:00 - 23:30), (Wednesday: 18:00 - 22:00), (Thursday-Friday: 18:00 - 23:30), (Saturday: 10:00 - 14:00, 17:30 - 21:00)", 
"tel" : "807-358-6605", 
"sms": "", 
"address" : "3659 Highway 11 (Kakabeka Falls)", 
"map": "https://maps.app.goo.gl/WU7F9L9jWvB3nup46", 
"updated" : "2025-12-07", 
"courtesy" : "Justin Menu",
"text" : "
<br>THE COCONUT SHELL RESTAURANT MENU
<br>SALADS
<br>MIXED GREENS
<br>Half: $8 / Full: $16
<br>Description: Mixed greens with red onions, tomatoes, carrots, cucumber and peppers. Served with balsamic dressing.
<br>CAESAR SALAD
<br>Half: $8 / Full: $16
<br>Description: Romaine lettuce tossed with bacon bits, Parmesan cheese, croutons and Caesar dressing.
<br>ADD-ONS
<br>Grilled Chicken 4 Oz: $7
<br>Crispy Chicken 4 Oz: $7
<br>Beef: $7
<br>STARTERS
<br>PICKLE SPEARS ($12)
<br>6 pcs of tangy dill pickle spears, breaded and deep fried to a golden crisp, served with spicy mayo.
<br>SPRING ROLLS ($12)
<br>8 pcs of light and crispy spring rolls filled with vegetables. Served with Thai sweet chilli sauce.
<br>HALF NACHOS ($14)
<br>Baked corn chips topped with pub mixed cheese, bacon, banana peppers, green onions and pico de gallo, served with salsa and sour cream.
<br>CHICKEN WINGS
<br>1LB $14 / 2LB $18 / 4LB $35
<br>Crispy chicken wings prepared with your choice of sauce: buffalo, barbecue, honey garlic, Cajun, roasted garlic and dill pickle seasoning. Served with celery sticks, carrot and ranch sauce.
<br>MOZZARELLA STICKS ($12)
<br>Breaded mozzarella sticks served with marinara sauce.
<br>FRIES BASKET ($12)
<br>Add ons: gravy $3, cheese $3
<br>CLASSIC POUTINE ($16)
<br>French fries topped with curd cheese and gravy. Add ons: crispy chicken 4 Oz $7
<br>MAIN COURSE
<br>COCONUT SHELL CHILLI FIG JAM CHEESE BURGER ($18)
<br>4 Oz beef patty, topped with bacon, cheese, onion rings, barbecue sauce, spicy mayo and chilli fig jam. Served with side fries.
<br>PRIME RIB DIP ($22)
<br>Shaved grilled prime rib, onions, peppers, mushrooms finished with melted Swiss cheese, garlic mayo served on a sub bun with side fries.
<br>CHICKEN BURGER ($18)
<br>Breaded chicken patty topped with spicy mayo, shredded lettuce, fried onions and a hint of maple syrup, served on a waffle with side fries.
<br>HAMBURGER ($18)
<br>4 Oz beef patty topped with mayo, mustard, lettuce, tomato, cheese. Served on a bun with side fries.
<br>CHEESE BURGER ($16)
<br>4 Oz beef patty topped with melted cheese, served on a bun with side fries.
<br>SNACKER PLATE ($22)
<br>Assortment of spring rolls, onion rings, wings, mozzarella sticks, and pickle spears.
<br>PIZZA OF THE DAY ($18)
<br>Please ask the server.
<br>QUESIDILLA ($16)
<br>A tortilla shell loaded with grilled chicken/ taco beef, chopped tomatoes, mixed cheese, sauted peppers and green onions with a hint of coconut shell special sauce. Served with fries.
<br>CHICKEN FINGERS ($15)
<br>Tender strips of chicken served with plum sauce and side fries.
<br>SPICY CHICKEN WRAP ($16)
<br>Chicken strips deep fried until golden brown, tossed in Frank's red hot sauce and ranch dressing served with lettuce, tomatoes, banana peppers, green onions and shredded mixed cheese. Served with side fries.
<br>CHICKEN CAESAR WRAP ($16)
<br>Caesar salad with Cajun sauted bell peppers, red onions and grilled chicken breast wrapped in a grilled tortilla. Served with side fries.
<br>KIDS MENU
<br>KIDS CHICKEN FINGERS AND FRIES ($12)
<br>SIDES
<br>SIDE FRIES ($6)
"
}