{
    "status": "",
    "link": "https:\/\/www.superiorbakes.com",
    "hours": "(Sunday: 10:00 - 16:00), (Wednesday - Friday: 11:00 - 19:00), (Saturday: 10:00 - 16:00)",
    "tel": "tel: 807-935-8700",
    "sms": "",
    "address": "Address: 251 Red River Road (Inside Goods &amp; Co. Market)",
    "map": "https:\/\/maps.app.goo.gl\/378P5TrKiXBxMAt99",
    "updated": "Updated: 2024-11-08",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Keto Cakes<br\/>Brownies<br\/>Keto Cups<br\/>Protein Balls<br\/>Protein Muffins<br\/>Keto Cookies<br\/>Granola<br\/>Protein Bars<br\/>Smoothie<br\/>Bowls<br\/>Allergen information and disclaimers<br\/>Gluten friendly, high in fat, low in carbohydrates, and moderate protein. The perfect treat or snack.<br\/>Keto Chocolate Cake with Chocolate Buttercream Frosting<br\/>Olive oil, almond flour, cocoa powder, eggs, stevia, erythritol, vanilla extract, and coconut oil. Frosting with butter, cream cheese, cocoa powder, steiva, erythritol, vanilla extract.<br\/>See Item<br\/>Keto Carrot Cake with Cream Cheese Frosting<br\/>Almond flour, coconut flour, eggs, stevia, butter, almond milk, baking powder, baking soda, cinnamon, vanilla extract, and coconut oil. Frosting with cream cheese, butter, stevia, erythritol.<br\/>A variety of rich chocolatey brownies! All are gluten friendly and can satisfy the biggest of chocolate cravings!<br\/>Rich, delicious keto cups with only one and a half grams of net carbs per serving! You'll get the benefit of a delicious treat without any added carbs.<br\/>Chocolate Peanut Butter Keto Cups<br\/>Peanut butter, coconut oil, butter, cream, cocoa powder, vanilla extract, stevia, and erythritol. (70 Cals)<br\/>High protein, handmade protein balls. Minimal ingredients, all natural, no preservatives or additives. The perfect treat or snack.<br\/>Chocolate Peanut Butter Protein Balls<br\/>Oats, honey, peanut butter, flax, chia, whey, coconut oil, and chocolate chips. (7 Fat, 11 Carb (1 Fiber), 5 Protein - 120 Cals)<br\/>High protein, gluten friendly, and sugar-free muffins.<br\/>High in fat, low in carbohydrates, and moderate protein. The perfect treat or snack.<br\/>Peanut Butter Keto Cookies<br\/>Peanut butter, eggs, stevia, and erythritol. (9 Fat, 6 Carb (1 Fiber, 1 Sugar), 4 Protein - 105 Calories per cookie)<br\/>Keto Clusters<br\/>Shredded coconut, peanut butte, butter, cocoa powder, stevia, erythritol, and vanilla extract. (13 Fat, 5 Carb (1 Fiber, 1 Sugar), 3 Protein - 150 Calories per cookie.)<br\/>Made fresh in house. A delicious blend of oats, nuts, seeds, coconut, fruit and something sweet!<br\/>White Chocolate Cranberry<br\/>Ingredients: Oats, Olive Oil, Honey, Pumpkin Seeds, White Chocolate Chips, Cranberries, Vanilla Extract. One bag.<br\/>$15.00<br\/>Banana Walnut Chocolate Chip<br\/>Ingredients: Oats, Olive Oil, Honey, Walnuts, Chocolate Chips, Banana Chips, Vanilla Extract. One bag.<br\/>Made fresh with simple ingredients and a variety of delicious flavours.<br\/>Chocolate Peanut Butter Protien Bars<br\/>Ingredients: Peanut Butter, Honey, Oats, Whey Protein, Chocolate Chips, Coconut Oil<br\/>A delicious blend of fresh fruits and vegetables. Completely customizable, you choose your milk and protein!<br\/>Peanut Butter Blaster (16 oz)<br\/>Ingredients: Milk of your choice, protein of your choice, bananas, peanut butter.<br\/>$9.00<br\/>Tropical Breezer (16 oz)<br\/>Ingredients: Milk of your choice, Protien of your choice, Mango, Pineapple, Orange Juice<br\/>Berry Blaster (16 oz)<br\/>Ingredients: Milk of your choice, Protien of your choice, Raspberries, Blueberries, Strawberries, Blackberries<br\/>Strawberry Banana (16 oz)<br\/>Ingredients: Milk of your choice, Protien of your choice, Strawberries, Bananas<br\/>Avo-Keto (16 oz.)<br\/>Ingredients: Milk of your choice, Protien of your choice, Spinach, Avocado, Stevia, Erythritol<br\/>Made fresh to go with your choice of toppings.<br\/>Acai Bowl<br\/>Acai, Banana, Strawberries, Blueberries, Blackberries and Raspberries blended together. Topped with granola and a peanut butter drizzle.<br\/>$10.00",
    "image0": "img0.webp",
    "name": "Superior Bakes (Inside Goods & Co.)"
}