{
	"name": "Pocketchange Bar",
    "status": "",
    "link": "https:\/\/www.pocketchangebar.com\/",
    "hours": "(Tuesday - Thursday: 17:00 - 23:00+), (Friday - Saturday: 17:00 - 02:00)",
    "tel": " 807-343-3333",
    "sms": "",
    "address": "234 Red River Road",
    "map": "https:\/\/maps.app.goo.gl\/zCRGj98JSRSWdwqz8",
    "updated": "2026-02-12",
    "courtesy": "Justin Menu",
    "text": "APPY HOUR - 1\/2 APPETIZERS<br\/><br\/>5PM-9PM THURSDAYS &amp; FRIDAYS<br\/><br\/>Join us for Happy Hour every Thursday and Friday from 5 PM to 9 PM! Enjoy 1\/2 off all our appetizers, including our internet-famous nachos and crispy baked wings. Don't miss out!<br\/>GAME DAY DRAFT SPECIAL<br\/><br\/>$20<br\/><br\/>Cheer on your favorite team with our exclusive Penny Lager, crafted by Lakehead Brewing. Just $20 per pitcher during football, hockey, basketball, and even curling games!<br\/>FEATURE SNACK<br\/><br\/>KING BAO<br\/><br\/>$15<br\/>All hail the King Bao &#8212; a rebellious bite that takes no prisoners. We&#8217;re talking crispy, oven-roasted pork belly that&#8217;ll make your taste buds bow down. This bad boy is loaded with punchy pickled daikon and carrots, cool julienned cucumbers, and a reckless crunch of crushed peanuts. Topped off with fresh cilantro and wrapped in a fluffy steamed bao, this is one mouthful that rules with an iron fist. Dare to take the throne?<br\/><br\/>Strawberry Paper Plane: 12 1\/2<br\/><br\/>Bourbon, aperol, amaro nonino, and freshly muddled strawberries, lemon juice with drizzle of olive oil.<br\/>Japanese Old Fashioned: 14 1\/2<br\/><br\/>Japanese whisky, simple syrup, and a burst of flavor from angostura and yuzu bitters.<br\/>Kyoto Negroni: 14 1\/2<br\/><br\/>A rice-washed twist on the classic. Japanese Roku Gin, premium sweet vermouth, Campari, and garnished with nori for a umami finish.<br\/>Mom, It's Not A Phase: 12 1\/2<br\/><br\/>Barbados rum, Amaro Nonino, Angostura bitters, banana liqueur, fresh lime juice, pineapple juice, and a dash of cr&#232;me de cacao for a rich, fruity, and slightly bitter finish.<br\/>Yuzu Soju Sour: 13 1\/2<br\/><br\/>Korean soju, yuzu tea, lemon juice, simple syrup and frothy egg white for a velvety texture.<br\/>Espresso Martini: 13 1\/2<br\/><br\/>Vodka, liquor 43, Kahlua coffee liqueur and chilled espresso, garnished with 3 espresso beans.<br\/>Gin Gin Mule: 13 1\/2<br\/><br\/>Empress gin, lime juice, simple syrup, mint, ginger bitters, ginger beer topped with sugared ginger and mint that got a good spanking.<br\/>Coin Toss: 12 1\/2<br\/><br\/>Raspberry vodka, Cointreau, lime juice, rosemary-infused simple syrup and cranberry juice. Garnish of fresh raspberries and a rosemary sprig.<br\/><br\/>DRAFT &#29983;&#12499;&#12540;&#12523;<br\/><br\/>Penny Lager: 7<br\/>Introducing the exclusive Penny Lager - a German Style Helles Lager. This is a collaborative masterpiece brewed mischievously with Lakehead Brewery - a crisp and refreshing brew mischievously crafted to elevate your beer experience with a unique blend of flavours and easily crushable &quot;drinkability&quot;.<br\/>L.O.T.W Lakeside K&#246;lsch: 9<br\/>L.O.T.W Rotating Tap: 9<br\/>Dawson Trail Rotating Tap: 9<br\/>Bud: 8<br\/>Bud Light: 8<br\/>Stella: 10<br\/>Michelob Ultra: 8<br\/>Want a pint &quot;N-Change&quot;? Go from a 16oz pint to a 20oz for $2.00<br\/><br\/>CANS + BOTTLES<br\/><br\/>Corona: 7<br\/><br\/>Forgotten Lake: 8<br\/><br\/>Channel Marker: 8<br\/><br\/>Sneaky Peach: 8<br\/><br\/>Border Run: 9<br\/><br\/>Sapporo Black: 11<br\/><br\/>Sapporo: 10<br\/><br\/>PBR: 6<br\/><br\/>Reid's G &amp; T: 7<br\/><br\/>White Claw: 7<br\/><br\/>Stock &amp; Row Cider: 8<br\/><br\/>No Boats Peach Cider: 8<br\/><br\/>Northern Lager: 9<br\/><br\/>Power Blaster: 8<br\/><br\/>White Out: 7<br\/><br\/>Quittin Time: 5<br\/><br\/>Lagos: 8<br\/><br\/>Miller High Life: 7<br\/><br\/>Molson Canadian: 7<br\/><br\/>Coors Original: 7<br\/><br\/>Coors: 8<br\/><br\/>Strongbow: 8<br\/><br\/>Corona Sunbrew 0%: 6<br\/><br\/>Heineken 0.0: 6<br\/><br\/>SHOTS &#23556;&#25163;<br\/><br\/>Toonie - Pink Sour Puss &amp; Pink Whitney: $6<br\/>Loonie - Vodka &amp; Kahlua: $6<br\/>Quarter - Amaretto &amp; High Proof Rum: $6<br\/>Dime - Tequila &amp; Lychee Liqueur: $6<br\/>Nickel - Vodka, Pineapple &amp; Melon Liqueur: $6<br\/>&quot;Dirty&quot; Penny - Just Good Old Jameson: $6<br\/>&quot;IN THE POCKET&quot; - 1 REDBULL + 1 CORONA + 2 SHOTS OF MANDRIN VODKA - IT'S WHAT YOU NEED TO START THE NIGHT OFF RIGHT! - $16<br\/>WINE<br\/><br\/>Bubbles<br\/><br\/>Cave Springs 2019 Riesling Brut - Niagara: $13 \/ $60<br\/>Segura Viudas 2021 Cava Brut Reserva - Spain: $13 \/ $60<br\/>Champagne Collet NV Brut: $160<br\/>Red<br\/><br\/>Cave Springs 2020 &quot;Dolomite&quot; Pinot Noir - Niagara: $13 \/ $60<br\/>Chateau Pesquie Ventoux Terrasses Rouge - France: $13 \/ $60<br\/>Bread &amp; Butter 2022 Pinot Noir - California: $13 \/ $60<br\/>Josh Cellars 2021 Cabernet Sauvignon - California: $13 \/ $60<br\/>White<br\/><br\/>Chateau Rouquette 2021 &quot;La Tour Aux Palombes&quot; - France: $13 \/ $60<br\/>Cave Springs 2021 Dolomite Chardonnay - Niagara: $13 \/ $60<br\/>Mosole 2022 Passi di Luce Pinot Grigio - Italy: $13 \/ $60<br\/>Bread &amp; Butter 2022 Chardonnay - California: $13 \/ $60<br\/>Rose<br\/><br\/>Bread &amp; Butter 2022 Rose - California: $13 \/ $60<br\/><br\/>Spicy Virgin Margarita: $11<br\/><br\/>Non-alcoholic tequila, lime juice, pineapple juice, simple syrup, and a touch of saline solution, garnished with jalape&#241;o and tajin.<br\/>Pocket Punch: $10<br\/><br\/>Fusion of pineapple, orange, and mango juices, complemented by a touch of strawberry syrup, lemon and lime juice, and a hint of minced ginger, topped with zesty punch ginger beer.<br\/>Sakura Old Fashioned: $12<br\/><br\/>Non-alcoholic whisky, simple syrup, and a burst of flavor from sakura (cherry blossom) bitters.<br\/>Red Bull: $5<br\/><br\/>Assorted Flavours.<br\/><br\/>Kitchen Hours: 5:00PM-11:00PM<br\/><br\/>HURRICANE POPCORN - 5<br\/><br\/>Fresh popcorn drizzled with a blend of melted butter, a hint of soy sauce, and a generous sprinkling of Nori Furikake (sesame seeds, nori seaweed, sugar, and salt).<br\/>WHIPPED FETA - 16<br\/><br\/>A creamy blend of feta, Creek yogurt, lemon, and olive oil, whipped to perfection and seasoned with salt and pepper. Topped with a drizzle of fine olive oil, hot honey, chili flakes and served with warm toasted pretzel.<br\/>ASIAN ST. NACHOS - 26<br\/><br\/>Garlic-infused ground pork made with a zesty blend of fresh lime juice, low-sodium soy sauce, then garnished with a medley of Monterey Jack cheese, thinly sliced red cabbage, jalape&#241;o, and cilantro, finished with green onion and a drizzle of sriracha mayo.<br\/>BANG! DUMPLINGS - 16<br\/><br\/>S chicken and leek steamed jiaozi with a tantalizing spicy peanut soy sauce made from peanut butter, coconut milk, sugar, soy sauce, chili oil, minced garlic, toasted sesame seeds, and sesame oil.<br\/>KATSU SANDO - 15<br\/><br\/>Japanese-inspired hot dog. A caramelized all-beef hotdog is nestled between two pretzel buns, adorned with house-made katsu sauce, crispy panko bread crumbs, green onion, Kewpie mayo, and a sprinkle of sesame seeds.<br\/>POCKET NOODS - 11<br\/><br\/>Instant ramen noodles with a savory blend of low-sodium soy sauce, vegetarian hoisin sauce, rice vinegar, brown sugar, chili sauce, toasted sesame oil, minced garlic. Garnished with freshly grated ginger, sliced green onions, and a sprinkle of sesame seeds.<br\/>ADD a fried egg with chili oil on top or add three dumplings.<br\/><br\/>All items may contain traces of nuts or sesame.<br\/><br\/>If you have an allergy or intolerance, please let our staff know.<br\/><br\/>Dyno Wings 19<br\/><br\/>Crispy baked wings smothered in our secret tangy sauce, garnished with slivered green onions, sesame seeds, and a kick of Thai chilies. Note: Wings are freshly baked and might take time to prepare.<br\/>Classic Wings 19<br\/><br\/>Lemon Pepper, Shichimi Togarashi, Roasted Red Pepper, Franks Hot, Honey Garlic, Hot Honey. Note: Wings are freshly baked and might take time to prepare. 2 lbs. add $14<br\/>Stinging Bee 19<br\/><br\/>Experience the perfect blend of spice and sweetness with savory pepperoni, jalape&#241;os, and a drizzle of hot honey.<br\/>Cheese, Cheese, Cheese 18<br\/><br\/>A very cheesy pizza... what else is there to say?<br\/>Gochujang Korean Pork 21<br\/><br\/>Introducing our Korean Twist Pizza! Crispy dough topped with smoky gochujang pizza sauce, tender garlic-infused ground pork, red onions, sweet pineapple, mozzarella, and cilantro. A guaranteed winner!<br\/>Truffle Mushroom 19<br\/><br\/>Indulge in our Truffle Mushroom Pizza, featuring a delectable combination of earthy truffle-infused olive oil, savory mushrooms, and gooey mozzarella cheese on a crispy crust. A sophisticated choice for any pizza lover!<br\/>ADD THE DIPPS 2<br\/><br\/>Choose to add on a side of dip:<br\/>Hot Honey<br\/>Ranch<br\/>Buffalo Hot Sauce"
}