{
"name" : "Sal, The",
"status" : "",
"link" : "https://thesalthunderbay.com/", 
"hours" : "(Sunday: 09:00 - 15:00), (Tuesday - Saturday: 09:00 - 21:00)", 
"tel" : "807-577-8635", 
"sms": "", 
"address" : "118 Frederica Street West", 
"map": "https://maps.app.goo.gl/USyQJJqtVmhFeVWaA", 
"updated" : "2026-02-06", 
"courtesy" : "Justin Menu", 
"text" : "
Well hi! Welcome to The Sal, or Salsbury Grill as it was once known. We’re a laid back little eatery that’s been serving Westfort and Thunder Bay now for 56 years. So get comfy and enjoy yourself. Thanks for coming by, and welcome to the cult.
<br>Snack
<br>Sal fave Mozza Sticks $15.5
<br>Bacon Jal Pops $14.5
<br>Bang Bang Chicken $16
<br>Crab Rangoons $17
<br>Share
<br>Gluten free Sweet Potatoes $14
<br>Onion Rings $14
<br>LG Fries n Gravy $11
<br>Waffle Fries$14<br>Poutine
<br>Chicken n Waffle$17
<br>Sal faveBuffalo Chicken$17
<br>Pickle Party$17
<br>Classic$14
<br>Sal fave – Sal fave Kinda hot – It’s kinda hot Gluten Free – Can be made gluten free Available vegetarian – Available Vegetarian
<br>Burgers
<br>Burgers! 4.5oz patties made in house on Roma Bakery kaiser’s
<br>Served with choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75.
<br>Classic burg $15.5/$16.5/$18.5
<br>regular / cheeseburger / bacon cheese – mayo, lettuce, tomato, pickle
<br>Sal faveSalburger $20
<br>grilled ham, cheddar, mozza, grilled onions, mayo, lettuce, tomato, pickle
<br>The Final Boss $21
<br>bold bbq, bacon, swiss, waffle fries, crispy banana peppers, garlic aioli, lettuce, tomato, pickle
<br>tacos
<br>The one and only! Or two, or four?
<br>single $8 / one + side $13 / two + side $19 / four $24
<br>Served with your choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75.
<br>Sal fave Crispy Fish / Grilled Chicken / Chorizolegendary choice! – chipotle aioli, cheese, cabbage, fresh pico de gallo
<br>Bang Bang Shrimpgrilled shrimp, cheese, cabbage, house made sauce, cucumber, carrot, cilantro, chili flake
<br>Korean BBQ Chickenbbq, crispy chicken, cheese, cabbage, pickled onion, cilantro, sesame seeds, soyoli sauce
<br>The Sal Staples
<br>If it ain’t broke then don’t fix it. And we never will.
<br>Served with your choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75
<br>Gluten FreeFish N Chips $20
<br>English style or corn fried – served with fries, slaw, lemon, tartar
<br>Jumbo Shrimp $20
<br>eight large & breaded – with fries, slaw, lemon, cocktail sauce
<br>Hot Sandwich $15 / $17.5
<br>hand sliced turkey or seasoned sliced beef with our famous house made gravy, on your choice of bread
<br>Sal faveThe Burger Nip! $17.5
<br>topped your way; drenched with our house made gravy
<br>Gluten FreeLiver N Onions $20.5
<br>seasoned liver steak – served with bacon and sautéed onions
<br>Chicken Fingers $18.5
<br>five large breaded tenders served with plum sauce
<br>Classic Greens
<br>Eatin’ on the lighter side – add chicken $5
<br>Sal faveGreek – $9.5 / $14
<br>veggies, feta, kalamata olives, oregano, house dressing
<br>Caesar – $9.5 / $14
<br>parmesan, croutons, house dressing
<br>Garden – $9.5 / $14
<br>veggies, shredded cheese, dressing of your choice
<br>Specialty Salads
<br>More imaginative greens
<br>Taco Salad – $21
<br>with chicken or shrimp, fresh pico, cheese, chipotle, sour cream, corn chips
<br>Big Mac Salad – $21
<br>seasoned chicken or chopped burger patty, cheese, pickles, onions, tomatoes, sesame, thousand island dressing, corn chips
<br> 
<br>Sandwiches
<br>Classic diner sandies for your upper-class palate
<br>Served with your choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75
<br>Reuben $18.5
<br>corned beef, Swiss, with sauerkraut – on grilled rye
<br>Monte Cristo $18.5
<br>turkey, ham, Swiss, cheddar, grilled in an egg batter – on white
<br>Sal faveClubhouse $20
<br>toasted, turkey, ham, bacon, cheddar, mozza, tomato, lettuce, mayo – on choice of bread
<br>Loaded Grill Cheese $17
<br>bacon, cheddar, swiss, crushed mozza sticks, garlic aioli – on choice of bread
<br>Kinda hotChorizo Melt $18
<br>grilled chorizo, Monterey jack, cheddar, mozza, pepers, onions – on warm hoagie
<br>Classic BLT $14
<br>bacon, lettuce, tomato, mayo on choice of bread – Add cheese $1.50 – Add chicken $5
<br> 
<br>Chicken
<br>Cut, pounded and breaded the old school way
<br>Served with your choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75
<br>Southwest Sandy $19
<br>seasoned grilled chicken, peppers, onions, cheese, sour cream, corn chips, chipotle – on a warmed hoagie
<br>Kinda hotMaple Chicken Chipotle $19
<br>grilled or crispy, cheddar, Canadian maple syrup, chipotle, lettuce, pickles, crispy banana peppers
<br>The Bad Birdy $19.5
<br>crispy chicken, bacon, swiss, coleslaw, onion rings, bold BBQ sauce, pickles
<br>Wraps
<br>Thick pita style wraps served in foil
<br>Served with your choice of fries, mash, salad, or soup.
<br>Add coleslaw or gravy to any meal for $1.75; No side? $5 Off
<br>Sal faveGyro $18.5
<br>beef/lamb blend, tzatziki, oregano, red onion, tomato, lettuce
<br>Julius Caesar $19
<br>grilled or crispy chicken, parmesan, bacon bits, lettuce, house made Caesar dressing
<br>Spanish Sante Fe $19
<br>grilled chorizo, one egg, waffle fries, mushrooms, crispy banana peppers, cheese, sour cream
<br>SIDE UPGRADES: SWEET POTATOES, ONION RINGS, POUTINE $3.5
<br>Breakfast
<br>Did you know? The Sal; or Salsbury Grill, did not start serving breakfast until then owner Chef Peter started in 2007. Today the Sal has a loyal A.M. following and is a weekend brunch “go to” in town. We buy our bread, eggs, and potatoes locally, and we strive to do as much as we can locally, and in-house.
<br>Classics
<br>Can’t go wrong with the originals.
<br>1/2/3 Egger $12/$14.5/$17
<br>done your way – with choice of meat, toast, with a side
<br>Sal faveBreakfast Poutine $17
<br>home fries topped with cheese, gravy, two eggs, bacon bits, chipotle, and chives
<br>Sal Choice $16.5
<br>two eggs done your way, choice of two meats, toast, with a side
<br>French Toast $14
<br>3 slices, grilled cinnamon raisin loaf drenched in egg batter, with powdered sugar. Add meat for $3.5
<br>Bigger Eaters
<br>Eat like you mean it.
<br>The Hangover $20
<br>3 eggs, 2 meats, 2 french toast or choice of toast, with a side
<br>Corned Beef Hash $18
<br>with 2 eggs, cheese, onions, peppers, home fries, chives, parsley
<br>Sal faveBig Country $20
<br>2 eggs, bacon AND sausage AND ham, toast, with a side
<br>Omelettes
<br>Served French style. Plated with your choice of toast, and side
<br>2 eggs per omelette; Add an extra for $3
<br>Western $17
<br>ham, peppers, onion, tomato, cheese
<br>Sal faveMexican $17.5
<br>bacon, fresh pico, cheese, chipotle
<br>Veggie $15
<br>tomato, onion, peppers, cheese
<br>Sal faveGreek $17.5
<br>beef/lamb, tomato, onion, peppers, feta, tzatziki, oregano
<br>CANADIAN $18
<br>Bacon, ham, mushrooms, maple syrup, cheese, chives bits OR diced ham n cheese
<br>Meat n cheese $15
<br>Bacon bits OR diced ham n’ cheese
<br>MEAT N MUSHROOM $15.5
<br>Bacon bits OR diced ham with sautee mushrooms n’ cheese
<br>Handhelds
<br>Fingers before forks.
<br>Substitute home fries for tomato or apple slices; Gluten Free toast is available $1
<br>Breaky Tacos $12/$17.5
<br>one / two eggs, ham OR bacon, fresh pico, chipotle – with a side
<br>Denver $14
<br>ham, peppers, tomato, onion, egg, on toast – with side
<br>Add Cheese $1, loaded for $2
<br>Sunrise SandY $13.5
<br>egg, meat, cheese, on choice of bread – with a side
<br>Sal faveWestfort Wonder $17.5
<br>egg, bacon, ham, cheddar, Swiss, melted into egg battered white bread. Served with maple syrup – with a side
<br>KIDS $9.5
<br>Comes with a drink and a cookie for later! (or now)
<br>1 egg, toast, home fries
<br>2 pieces french toast
<br>cheese omelette & Toast
<br>Grill Cheese, Home fries
<br>Extras
<br>Toast (White, Wheat, Rye) $3
<br>Meat(Bacon, Ham, Sausage) $4.5
<br>Home Fries, Tomatoe slices $3.5
<br>Single Egg your way $3.5
<br>Kids Meals
<br>All meals are accompanied with a small drink, small dessert and fries or apple slices.
<br>Kids 10 and under. Side substitutions available.
<br>Chicken Fingers (3)
<br>Hamburger
<br>Fish n’ Chips
<br>Grilled Cheese
"
}