{
"name" : "Forks South Sports Lounge",
"status" : "",
"link" : "https://www.5forksrestaurant.com/forks-south/", 
"hours" : "(Sunday: 16:00 - 22:00), (Monday: 16:00 - 23:00), (Tuesday: 11:30 - 23:00), (Wednesday - Friday: 11:30 - 00:00), (Saturday: 12:00 - 00:00)", 
"tel" : "807-346-6000", 
"sms": "", 
"address" : "1072 Oliver Road", 
"map": "https://maps.app.goo.gl/hUM2ovgswSb27NXR8", 
"updated" : "2025-10-31", 
"courtesy" : "Justin Menu", 
"text" : ".📅 Happy Hour Menu (from img3.jpg)HAPPY HOURDAILY FROM 4PM-6PM & 9PM-CLOSEALL DAY SUNDAYBEVERAGESSMALL DRAFT (14OZ) - $5LARGE DRAFT (18OZ) - $6.50BAR RAIL (1OZ) - $5HOUSE WINE (5OZ) - $5.50CAESAR (1OZ) - $5.50APPETISERSCHICKEN QUESADILLA - $12DRY SALTED RIBLETS - $10BANG BANG SHRIMP - $14TACOS - $5 EACH (STEAK-CHICKEN-SHRIMP)1/2 NACHOS - $10CHICKEN WINGS (8) - $12SWEET CHILI CHICKEN BITES - $10CLASSIC BURGER - $12 (ADD FRIES $3)DINE IN ONLY. PLEASE DRINK RESPONSIBLY. SOME RESTRICTIONS APPLY. APPLICABLE TAXES EXTRA.🍽️ Main Menu - Starters and Flatbreads (from img4.jpg)STARTERSCHICKEN WINGS 10PC/15PC/27 PC - $27CELERY STICKS - RANCH OR BLUE CHEESETOSSING SAUCES: HONEY DILL, BUFFALO, HOT, DAKOTA, HOT & HONEY, MEDIUM, DILL PICKLE, SMOKEY BRAZILIAN, ROASTED RED PEPPERSERVED WITH RANCHADD SHOESTRING FRIES + $4SWEET CHILI CHICKEN BITES $19SESAME SEEDS - GREEN ONIONPICKLE CHIPS $12ROASTED GARLIC AIOLITOASTED & LOADED $12SERVED WITH HUMMUS & ARTICHOKE BLEND OF CHEESESMIXED MARINARA DIP & CAESAR DIPADD BACON + $4GULF COAST DIP $18.50CRAB - SHRIMP - CREAM CHEESE - OLD BAY - GREEN ONIONDRY SALTED RIBLETS $18SERVED WITH RANCHSTEAKHOUSE TIPS $21SAUTÉED MUSHROOMS - GARLIC CREAM SAUCE - GRILLED CIABATTADRY SALTED RIBLETS & WINGS $184 SALTED RIBLETS & 5 PC OF WINGSTOSSING SAUCES: BUFFALO, HOT, DAKOTA, HOT & HONEY, GARLIC PARM, MEDIUM, DILL PICKLE, SMOKEY BRAZILIAN, ROASTED RED PEPPER, ONIONADD SHOESTRING FRIES + $4CHICKEN QUESADILLA $20MIXED CHEESE - TOMATOES - GREEN ONION - SALSA - SOUR CREAMBANG BANG SHRIMP $19.50CRISPY SHRIMP - SWEET CHILI SAUCE - GREEN ONION - CRISP SLAWLOADED NACHOS $22PICO DE GALLO - BLEND OF CHEESES - GREEN ONION - SALSA - JALAPEÑOS - SOUR CREAMADD CHICKEN OR BACON - $4ADD GUACAMOLE - $5DOUBLE CHEESE - $5TACOS (X3) $17CARNE SAZONADA (STEAK)MARINATED CABBAGE, PICKLED RED ONION, CHARRED CORNPOLLO FUEGO (CHICKEN)CRISP CABBAGE, SWEET CHILI, PICKLED RED ONION, CHARRED PINEAPPLE SALSACITRUS CAMARON (SHRIMP)CRISP CABBAGE, HONEY LIME, PICKLED RED ONION, CHARRED CORNALL SERVED WITH: CILANTRO - AVOCADO CREMAHOUSEMADE GUACAMOLE & CHIPS $18.50LIME - SEA SALT - PICO DE GALLO - NACHO CHIPSCHEESE CURDS $16MARINARA SAUCEFLATBREADSBUFFALO CHICKEN $18BUFFALO SAUCE - BACON - MIXED CHEESES - RANCH - GREEN ONIONCAPRESE $18MARINARA - BOCCONCINI - TOMATOES - ARUGULA - MOZZARELLAPARMESAN - BALSAMIC GLAZECHOPHOUSE FLATBREAD $18.50MARINARA - PEPPERONI - HONEY HAM - BACON - MUSHROOMSMOZZARELLA & PARMESAN - GREEN ONIONPROSCIUTTO & ARUGULA $18ROASTED GARLIC - MOZZARELLA - PARMESAN - CHILI OILCLASSIC PEPPERONI $17.50MARINARA - MOZZARELLARUSTICO $18.50MARINARA - PROVINCIAL - PROSCIUTTO - ARTICHOKE HEARTSPEPPERONCINI - MORTADELLA - BURRATA - CHERRY TOMATOHANDCRAFTED BURGERS & SANDWICHESServed with Shoestring FriesSUBSTITUTIONS: OnIONS RINGS, HOUSE SALAD, CAESAR SALAD, FEATURED SOUPDOUBLE DOUBLE BURGER $22.50DOUBLE BACON - DOUBLE AMERICAN CHEESE - FORKS SAUCEPICKLES - LETTUCE - TOMATOTACOS (X3) $21CARNE SAZONADA (STEAK)POLLO FUEGO (CHICKEN)CITRUS CAMARON (SHRIMP)ALL SERVED WITH: CILANTRO - AVOCADO CREMA1072 BURGER $22PROVOLONE - BACON - ROASTED RED PEPPERS - ROASTED GARLIC AIOLIBUTCHER'S TOAST $23GARLIC CREAM SAUCE - PROVOLONE - SAUTÉED MUSHROOMSCILANTRO - GARLIC SAUCE - ONION CRISPS - ROASTED GARLIC AIOLIGARLIC & PARM CRUNCH SANDWICH $21PEPPERCORN PARM SAUCE - MOZZARELLA - JACK CHEESE - LETTUCE - TOMATOADD BACON - $2WEST COAST CLUB $22GRILLED CHICKEN - GUACAMOLE - BACON - CHEDDARMAYO - LETTUCE - TOMATOPORCHETTA SANDWICH $21PROVOLONE - MUFFULETTA - ARUGULA - PESTO - MAYOCARVER'S STACK $21ROAST BEEF - HORSERADISH RYE - PROVOLONE - SWISS - SAUERKRAUTMUSTARD - MAYODOUBLE STACK IT + $5HOT HONEY CHICKEN SANDWICH $21CHEDDAR - FORKS SAUCE - LETTUCE - TOMATO🥗 Main Menu - Salads, Mains & Drinks (from img5.jpg)SALADSFIELD & FLAME $23.50GRILLED STEAK - MIXED GREENS - BLUE CHEESE - TOMATOESPROSCIUTTO & ARUGULA PESTO VINAIGRETTE - ONION CRISPSSUMMER GROVE SALAD $21MIXED GREENS - PECANS - RED ONION - GOAT CHEESETOMATOES - CUCUMBER - VINAIGRETTETHAI CHICKEN $22.50MIXED GREENS - RED PEPPER - CURRIED CASHEWS - CARROTSRED ONION - PEANUT DRESSING - CRISPY NOODLEITALIAN MARKET $22MIXED GREENS - PROSCIUTTO - GENOA SALAMI - MORTADELLAPEPERONCINI - SHAVED PARMESAN - CHERRY TOMATOCROUTONS - OIL & VINEGARHOUSEMADE CHICKEN TENDERS $22SHOESTRING FRIES - HONEY DILL DIPPING SAUCEMAINSCHICKEN PARMIGIANA $28HOUSE MADE MARINARA OR PESTO ALFREDO - GARLIC BREADSTEAK FRITES $26SHOESTRING FRIES - HOUSE STEAK SAUCEADD SAUTÉED MUSHROOMS - $5.50SHRIMP PENNE ALLA VODKA $27FRESH GARLIC - ONIONS - BASIL - GARLIC BREADCHICKEN FAJITA BOWL $27RED PEPPER - RED ONION - GRILLED CORN - TOMATOESAVOCADO - CILANTRO LIME RICEFISH & CHIPS $22.50CRUMBLED SALT & VINEGAR COATED - SHOESTRING FRIESLEMON - TARTARADD 2ND PIECE OF FISH - $7OAHU POKE BOWL $23MARINATED TUNA - CUCUMBER - AVOCADO - CARROTS - RICE - SPICY AIOLINORTH OF NASHVILLE HOT CHICKENA Classic Taste from Nashville...What is Comeback Sauce?Spicier Than Ranch, Creamier Than BBQ Sauce, Cooler Than Hot. We Dare You Not To Come Back For Some More.Heat Meter:🔥 Hot🔥🔥 XX-HotNakedHotTHE SANDO - $17TOPPED WITH COMEBACK SAUCE, SLAW & PICKLESWITH SEASONED FRIES $21TENDERS (X5) - $20WITH SEASONED FRIES $24POPCORN CHICKEN - $20WITH SEASONED FRIES $24WINGS!10 PIECES $2015 PIECES $30WITH SEASONED FRIES $24/$34SERVED WITH COMEBACK SAUCE, PICKLES, SLAW & GARLIC TOAST.NASHVILLE NACHOS $22TOPPED WITH HOT CHICKEN, TOMATOES, JALAPEÑOS, GREEN ONION & A BLEND OF MIXED CHEESES.FINISHED WITH A DRIZZLE OF COMEBACK SAUCEBEERGlass16oz MugMugPitcher60ozBottle/CanDomestic8142029Premium/Import8.5014.5020.5031(7)COCKTAILSFrom 7oz (1.5oz)Classic CaesarVodka, Clamato Juice & SpicesStrawberry Basil LemonadeGin, Fresh Basil, Lemonade, Fresh Strawberries, LemonadeStrawberry Lemon MojitoRum, Strawberry, Mint, Fresh Mint, Muddled Lemon & Club SodaSangriaVanilla Vodka, Galliano, Orange Juice, Cream SodaJohn DalyVodka, Lemonade, Iced TeaLIQUORPremium House Brands (1 oz.) - From $5.50NON-ALCOHOLIC BEVERAGESCoffee/Tea $3.50Pop $3.50Juices $3.99Carbonated Water - Sm. $3.99 Lg. $6.99NON-ALCOHOLIC COCKTAILS & BEERHeineken 0.0 $6.50Mountain Dew $5.49Mojito $5.49Caesar $5.49Cucumber Mint $5.49Gin & Tonic $5.49Red Sangria $6.49Spiced Rum & Cola $5.49Please Drink ResponsiblyGluten Friendly Options are Available Upon Request.NOTE: All Items may not be Available. Prices and Menu Ingredients may be Listed. Applicable Tax Extra. Please Drink Responsibly.",
"image0" : "img3.webp", 
"image1" : "img4.webp", 
"image2" : "img5.webp"
}