{
"name" : "Thai Kitchen", 
"link" : "http://www.thaikitchen.ca/menu.html", 
"hours" : "(Monday - Friday: 12:00 - 21:00), (Saturday: 14:00 - 21:00)", 
"tel" : "tel: 807-345-1707", 
"sms": "", 
"address" : "Address: 11 Cumberland Street South", 
"map": "https://maps.app.goo.gl/etGeKN9JsDazirUQA", 
"updated" : "Updated: 2025-09-24", 
"courtesy" : "Courtesy: Justin Menu", 
"text" : "Beer & Wine
<br>We have a nice selection of local craft and domestic beers in bottles and cans available for takeout. We also have bottled wines available for takeout. Ask your servers what is currently available.
<br>
<br>For dine in we have 3 different draught beers on tap as well as bottled and canned local and domestic beers. We have a selection of wines by the glass or bottle, as well as our new Thai Caesar and Pina Colada specialty drinks.
<br>
<br>Appetizers
<br>#1 | Thai Spring Rolls
<br>Crisp freshly pan fried rolls with cabbage, carrot, and bean noodle. Available with or without pork.
<br>$3.50 each | 6 for $19.95 | 12 for $37.95
<br>
<br>#2 | Satay
<br>Grilled pork or chicken skewers marinated in our own famous recipe, served with peanut sauce and spicy cucumber salad.
<br>$5.50 each | 4 for $20.95
<br>
<br>#3 | Curry Puffs
<br>Spicy blend of ground pork, potato, onion and spices wrapped in a homemade pastry of blended local wheat and rice flours. Pan fried to a golden brown.
<br>3 for $7.95 | 8 for $18.50
<br>
<br>Hot / Sour Soups
<br>#4 | Tom Ka Gai
<br>Tangy coconut broth soup with chicken, fresh mushrooms, chilies, lemongrass, lime leaf and galanga. Topped with fresh cilantro.
<br>$14.50 with chicken | +$3.00 with rice
<br>
<br>#5 | Tom yum
<br>Hot and sour clear soup with fresh mushrooms, fresh cilantro, lemongrass, lime leaf and galanga.
<br>$13.50 with chicken | $15.50 with shrimp | +$3.00 with rice
<br>
<br>Salads
<br>#9 | Yum Woon Sen
<br>Bean noodle salad with cilantro, mint, cucumber, zucchini, carrot, cherry tomatoes, lime and fish sauce. Choice of pork, chicken, tofu or shrimp.
<br>$14.50 | $16.50 with shrimp
<br>
<br>#10 | Yum Mamuang
<br>Green mango salad with dried shrimp, red onion, crushed peanuts, lime, fresh cilantro and chillies.
<br>$15.50
<br>
<br>#11 | Yum Nua Yang
<br>Grilled sirloin steak, thin sliced with shredded green mango, toasted rice powder, red onion, peanut, fresh cilantro, lime and mint.
<br>$18.50
<br>
<br>#15 | Yum Sen Gai Yang
<br>Spicy rice noodle salad tossed with freshly grilled chicken breast, lettuce, red onion and cilantro.
<br>$16.50
<br>
<br>Noodle Soups
<br>#7 | Kwit-deo nua
<br>Rice noodle soup with sliced sirloin in a flavourful beef broth. Topped with Yu Choy, cilantro, crushed peanuts.
<br>$14.95 half | $18.50 full
<br>
<br>#8 | Kwit-deo tom yum
<br>Rice noodle soup with minced pork tenderlion and roasted red pork shoulder, in a savory hot sour broth. Topped with Yu Choy, cilantro, crushed peanuts.
<br>$14.95 half | $18.50 full
<br>
<br>Fried Noodles
<br>#6 | Pad Thai
<br>Fresh rice noodle, stir fried with tofu and egg in a tamarind and tomato based sauce. Garnished with crushed peanuts, lime and green onion. Served with a homemade peanut sauce.
<br>$18.95 | $20.95 chicken | $21.95 shrimp
<br>
<br>#29 | Market Pad Thai
<br>Fresh rice noodle stir fried with tamarind juice, fried tofu, egg, crushed peanut and bean sprouts. Garnished with green onion and lime.
<br>$18.95 | $20.95 chicken | $21.95 shrimp
<br>
<br>#31 | Sen Pad Ped
<br>Rice noodles stir fried with red curry paste, fish sauce, lime juice, and your choice beef, pork, chicken, tofu or shrimp. Topped with crushed peanuts, crispy fried onions and fresh cilantro and lime.
<br>$19.95 | $20.95 shrimp
<br>
<br>#35 | Goong Op Woon Sen
<br>Fresh shrimp and transparent bean noodles simmered with ginger, garlic, sesame oil, garnished with fresh cilantro.
<br>$19.95
<br>
<br>#39 | Pad See Ew
<br>Broad rice noodles stir fried with Thai sweet soy sauce, Chinese broccoli, egg and your choice of beef, chicken or pork.
<br>$19.95
<br>
<br>#40 | Pad Kee Mao
<br>Broad rice noodle stir fry with Thai basil, chillies, red and green bell peppers, onions, cherry tomatoes and your choice of beef, chicken, pork or shrimp.
<br>$19.95 | $20.95 shrimp
<br>
<br>Fried Rice
<br>#26 | Khao Pad Krapow
<br>Fried rice with fresh chopped Thai basil, green onions, ginger and fresh cilantro, with your choice of sliced pork, chicken or beef.
<br>$18.50
<br>
<br>#27 | Khao Pad Goong Haeng
<br>Delicately flavoured, fragrant fried rice dish with dried shrimp, omelet strips and green onions.
<br>$18.50
<br>
<br>#28 | Khao Pad Thai
<br>Classic Thai fried rice with eggs, green onions, fresh tomatoes and your choice of pork, chicken or beef.
<br>$18.50
<br>
<br>#41 | Khao Pad Saparot
<br>Tasty fried rice dish with cashews, egg, chopped red and green bell peppers, red onion, fresh pineapple and pork loin.
<br>$18.50
<br>
<br>Curry
<br>#22 | Kaeng Keow Wan
<br>Savory green curry broth with bamboo shoots, green beans, broccoli, red and green peppers, with your choice of chicken, beef or shrimp.
<br>$22.95 | $23.95 shrimp
<br>
<br>#23 | Kaeng Pet Saparot
<br>Our famous sweet and hot red curry with chicken and pineapple.
<br>$20.95
<br>
<br>#24 | Kaeng Daeng Pet
<br>Spicy red curry broth with bamboo shoots, green beans, broccoli, red and green pepper, with your choice of chicken, beef or shrimp.
<br>$22.95 | $23.95 shrimp
<br>
<br>#25 | Kaeng Masaman
<br>Malay style curry broth spiced with cinnamon and cardamon, with potato and your choice of sliced chicken or beef.
<br>$20.95
<br>
<br>#33 | Kaeng Penang
<br>Hot savory stir fry style curry with green beans, and your choice of beef, pork or chicken. Topped with sliced lime leaf.
<br>$21.95
<br>
<br>#34 | Kaeng Leung
<br>Yellow curry broth spiced with turmeric, with bamboo shoots, red and green peppers, green beans and broccoli, with your choice of chicken, beef or shrimp.
<br>$22.95 | $23.95 shrimp
<br>
<br>#37 | Kaeng Pak Tong
<br>Red curry with butternut squash and your choice of chicken, beef or shrimp.
<br>$20.95 | $21.95 shrimp
<br>
<br>#36 | Kaeng Tonlay
<br>Savory red curry with mixed seafood. Topped with fresh cilantro.
<br>$22.95 | $23.95 shrimp
<br>
<br>Stir Fry
<br>#16 | Pad Krapow
<br>Sliced beef, chicken breast or pork with fresh Thai basil, chili pepper, green beans, red and green bell peppers and onion.
<br>$22.95
<br>
<br>#17 | Pad Peek
<br>Chicken breast, sliced beef or pork stir fried with red curry paste, green beans, onion and kaffir lime leaf.
<br>$22.95
<br>
<br>#18 | Pad Het Gai
<br>Chinese mushrooms stir fried with chicken, onion, broccoli, green and red bell pepper and oyster sauce. Very mild flavour.
<br>$22.95
<br>
<br>#19 | Pad King on Gai
<br>Our famous ginger chicken stir fry with fresh ginger, green and red pepper, broccoli, bamboo shoots and onions.
<br>$22.95
<br>
<br>#20 | Pad Pleow Wan
<br>Sweet and sour stir fry. Snow peas with tomato, red bell pepper, pineapple and onion, stir fried with shrimp, chicken, pork or beef.
<br>$22.95 | $21.95 shrimp
<br>
<br>#21 | Pad Mee Mapaan
<br>Chicken stir fry with roasted whole dried chilies, cashews, onions and oyster sauce.
<br>$22.95
<br>
<br>#32 | Pak Boong Fai Daeng
<br>Flash fried Yu Choy with garlic, black bean paste and fresh chilies.
<br>$19.95
<br>
<br>#38 | Pad Krapow Laat Khao
<br>Thai basil stir fry with minced chicken, beef or pork, chilies, onions and green beans. Served with rice and a salty/hot fish sauce with chilies on the side, topped with a fried egg.
<br>$22.95
<br>
<br>Drinks
<br>Coffee - $3
<br>
<br>Tea - $3
<br>earl grey, jasmine, green, lemon zinger
<br>
<br>Pop - $2.50
<br>pepsi, diet pepsi, dr pepper, orange crush, ginger ale, 7 up, brisk
<br>
<br>Fruit juices - $3
<br>apple, orange
<br>
<br>Milk - $3
<br>white or chocolate
<br>
<br>Iced thai tea - $4
<br>sweetened, with or without cream
<br>
<br>Oleung - $4
<br>sweet black iced coffee
<br>
<br>Cafe yen - $4
<br>sweet iced coffee with cream
<br>
<br>Bubble teas
<br>brewed jasmine tea shaken with milk and fruit flavours (coconut, taro, honeydew, mango, lychee, watermelon, blueberry, strawberry, raspberry, banana and thai tea) served over ice with tapioca pearls.
<br>with pearls $6.95
<br>without pearls $5.95
<br>
<br>Additional Information
<br>Add a fried egg to any dish for $2
<br>
<br>Most dishes can be made vegetarian, ask your server
<br>
<br>We use no MSG in our cooking
<br>
<br>Sauces
<br>table sauces and spices available on request:
<br>
<br>Garlic / Hot
<br>Sriracha Chili Sauce.
<br>
<br>Hot
<br>Roasted dried crushed chili peppers.
<br>
<br>Sweet
<br>Plum sauce.
<br>
<br>Salty / Hot
<br>Fish sauce with sliced fresh hot Thai chillies. Add a very small amount of the fish sauce, with as many chilies as you dare, to impart a traditional Thai salty flavour to any dish.
<br>
<br>Hot / Sour
<br>Sliced jalapeno peppers in vinegar sauce. Good in noodle dishes.
<br>
<br>Peanut Sauce
<br>Our popular homemade sauce is a little bit spicy and excellent on grilled meats.",
"image0" : "img4.webp",
"image1" : "img5.webp",
"image2" : "img6.webp",
"image3" : "img7.webp",
"image4" : "img8.webp",
"image5" : "img9.webp",
"image6" : "img10.webp",
"image7" : "img11.webp"
}