{
    "status": "pc",
    "link": "",
    "hours": "",
    "tel": "tel: 807-344-3443",
    "sms": "",
    "address": "Address: 269 Red River Road",
    "map": "https:\/\/maps.app.goo.gl\/Ehh9SbrzzjmTC4qy8",
    "updated": "Updated: 2024-11-05",
    "courtesy": "Courtesy: Justin Menu",
    "text": "ENTRANTES (Starters)<br\/>Chips and Salsa - 13<br\/><br\/>Freshly made tortilla chips served with house-made salsa.<br\/><br\/>Guacamole - 18<br\/><br\/>Creamy avocado dip made with fresh avocados, tomatoes, onions, cilantro, and lime juice.<br\/><br\/>Queso con Chorizo - 20<br\/><br\/>Melted cheese dip mixed with spicy chorizo sausage.<br\/><br\/>Molotes - 24<br\/><br\/>Crispy masa fritters stuffed with potatoes and cheese.<br\/><br\/>Esquites - 16<br\/><br\/>Mexican street corn salad made with roasted corn, mayonnaise, cotija cheese, and chili powder.<br\/><br\/>Poco Loco Taquitos - 19<br\/><br\/>Rolled and fried tortillas filled with chicken, served with guacamole and sour cream.<br\/><br\/>Flautas - 17<br\/><br\/>Crispy rolled tortillas filled with shredded beef or chicken, served with salsa verde and sour cream.<br\/><br\/>Chicharrones - 14<br\/><br\/>Crispy fried pork rinds served with lime and chili powder.<br\/><br\/>Nachos - 22<br\/><br\/>Tortilla chips topped with melted cheese, jalape&#241;os, guacamole, sour cream, and pico de gallo.<br\/><br\/>Mejillones - 20<br\/><br\/>Steamed mussels cooked in a white wine and garlic sauce.<br\/><br\/>MAS GRANDE (Main Courses)<br\/>Quesadillas - 20<br\/><br\/>Flour tortillas filled with melted cheese and your choice of chicken, beef, or vegetables.<br\/><br\/>Birria Burrito - 22<br\/><br\/>A large flour tortilla filled with braised beef, rice, beans, and cheese, served with consom&#233; for dipping.<br\/><br\/>Chimichanga - 22<br\/><br\/>Deep-fried burrito filled with your choice of meat, cheese, and beans, topped with guacamole and sour cream.<br\/><br\/>Enchiladas con Carne - 27<br\/><br\/>Corn tortillas stuffed with beef, topped with red sauce and melted cheese.<br\/><br\/>Enchiladas de Batata - 26<br\/><br\/>Corn tortillas stuffed with sweet potatoes and black beans, topped with green sauce and melted cheese.<br\/><br\/>Tacos - (choice of 3) - 20<br\/><br\/>Carne Asada - Grilled steak with onions and cilantro.<br\/><br\/>Baja Fish - Beer-battered fish with cabbage and chipotle mayo.<br\/><br\/>Barbacoa Beef - Slow-cooked beef with pickled onions.<br\/><br\/>Chicken Chipotle - Spicy chicken with lettuce and tomatoes.<br\/><br\/>Carnitas - Braised pork with pickled red onions.<br\/><br\/>Diablo Shrimp - Spicy shrimp with avocado and pico de gallo.<br\/><br\/>Mushroom Adobo - Marinated mushrooms with garlic and herbs.",
    "image0": "img0.webp",
    "name": "El Tres"
}