{
"name" : "Beefcake's Burger Factory",
"status" : "",
"link" : "https://www.beefcakesburgerfactory.com/", 
"hours" : "(Wednesday - Saturday: 11:00  - 21:00)", 
"tel" : "807-683-6757", 
"sms": "", 
"address" : "481 Hodder Avenue", 
"map": "https://maps.app.goo.gl/9yircsJkUAruS35g8", 
"updated" : "2025-09-21", 
"courtesy" : "Justin Menu", 
"text" : "
<br>Stack It Up
<br>Dressed with American cheese, caramelized onions, lettuce, tomato, pickles, signature sauce, and smokey bacon.
<br>Stacked Single - $10.25
<br>Stacked Double - $12.40
<br>Stacked Triple - $14.50
<br>The Bull (four) - $17.95
<br>Reliable Classics
<br>Dressed with ketchup, mustard, diced onions and pickles.
<br>Classic Burger/Cheeseburger - $5.40/$6.00
<br>Classic Hot Dog - $5.95
<br>Factory Signatures
<br>Dressed with caramelized onions, signature sauce, pickles, and lettuce.
<br>Signature Burger - $6.95
<br>Signature Cheeseburger - $7.50
<br>Daddy's Recipes
<br>The Westfort: BBQ sauce, fried onion ring, double cheddar, lettuce, tomato, bacon, corn relish. Single - $9.65 / Double - $12.75
<br>Bacon & Blue Cheese: Lettuce, tomato, Swiss and blue cheese and pickled onion. $8.95
<br>Triple Grilled Cheese Mac: Two patties, three grilled cheese sammys, lettuce, pickles, onions, special sauce. $15.25
<br>That Canadian: Beef patty, smoked pork tenderloin, maple syrup, lettuce, tomato, smokey pepper mayo, crispy onions. Single - $10.00 / Double - $13.25
<br>Swiss Mushroom: Extra Swiss cheese, caramelized onion & beef gravy. $8.30
<br>Jalapeno Cheddar: Double cheddar, lettuce, tomato, pickled jalapenos, and mayo. $8.50
<br>Cheddar Chippotie Daddy Hot Dog: Cheddar, chipotle sauce, caramelized onions, signature sauce, bacon, crispy onions. $8.05
<br>Jim Jam: Peanut butter, goat cheese, raspberry and sour cherry jam, blueberry heartbeat. $9.95
<br>I Got No Beef Witchu
<br>O.G. Bean & Oat Veggie: Lettuce, tomato, and signature sauce. $8.25
<br>Yam, & Risotto Veggie: Lettuce, tomato, onion, & maple syrup. $9.00
<br>O.G. Big Bird Chicken: Lettuce, tomato, and sig sauce. $9.75
<br>Spicy Buffalo Chicken: Lettuce, tomato, buffalo sauce, and ranch or blue cheese. $9.95
<br>Chicken Caesar Sandwich: Lettuce, tomato, Swiss, asiago, Parmesan, bacon, and rst garlic caesar dressing. $10.35
<br>Try any Beefcake's burger as a full flavour gluten free burger bowl, no bun, extra toppings!
<br>It Ain't Easy Bein' This Cheesy
<br>Buffalo Chicken Grilled Cheese: Buttermilk fried chicken, cheddar, buffalo sauce with ranch or blue cheese. $9.25
<br>Jalapeno Popper Grilled Cheese: Fried jalapenos, bacon, cheddar, & heartbeat jalapeno cream cheese. $8.65
<br>Home Alone Grilled Cheese: Texas toast, American cheddar, smokey bacon, and classic cheddar. $7.50
<br>Kids Stuff - Kids under 15 served with a half order of fries and a drink
<br>Kids Hot Dog - $7.50
<br>Kids Classic Burger/Cheeseburger - $8.05 / $8.50
<br>Kids Grilled Cheese - $8.00
<br>Kids Chicken Strips - $8.75
<br>Makin' Friends With Salads
<br>House Greens: Mixed greens, tomato, cucumber, pickled onions, pepperocini, choice dressing. $7.50 / $14.25
<br>Greek Salad: Romaine, olives, tomatoes, cucumber, feta, herb vinaigrette. $7.95 / $14.95
<br>Caesar Salad: Romaine, croutons, bacon, Parmesan, asiago, roasted garlic dressing. $7.95 / $14.95
<br>Combos - Available with the purchase of any burger or sandwich
<br>Fries + Drink - $5.85
<br>Salad + Drink - $8.75
<br>Poutine + Drink - $9.00
<br>Sides/Addons
<br>Fries - $5.25
<br>Poutine - $8.25 / $14.25
<br>Gravy - $1.90
<br>Braised Beef Poutine - $12.25 / $20.00
<br>Beef N' Cheese Taquitos - $12.00
<br>Deep Fried Pickles - $8.70
<br>Onion Rings - $9.95
<br>House Breaded Mozza Logs - $10.25 (Marinara - +$1.50)"
}