{
"name" : "Curry Up Indian Eatery", 
"link" : "", 
"hours" : "(Sunday - Saturday: 09:00 - 03:00)", 
"tel" : "807-286-0300", 
"sms": "", 
"address" : "701 Memorial Avenue", 
"map": "https://maps.app.goo.gl/7Ee9kCdKuuotPQkVA", 
"updated" : "2025-05-11", 
"courtesy" : "Justin Menu", 
"text" : "SOUTH INDIAN<br/><br/>Chole Bhature Aka Chana Bhature: $11.99 - Chole stands for a spiced tangy chickpea curry and Bhatura is a soft and fluffy fried leavened bread.<br/>Classic Masala Dosa: $11.99 - Crushed golden potatoes, tempered spices served with Sambhar and Chutney.<br/>Paneer Dosa: $11.99 - Filled with spiced Scrambled Paneer served with Sambhar and Chutney.<br/>Uttapam: $11.99 - South Indian pancake made from a fermented rice and lentil batter, topped with vegetables like onions, tomatoes, and chilies, then pan-fried to a crispy golden perfection.<br/>Vada Sambhar: $11.99 - Fried lentil round fritters (called medu vada) are dunked in piping hot lentil and veggie stew made with tamarind (called Sambhar).<br/>Sambhar Rice: $11.99 - Piping hot lentil and veggie stew made with tamarind (called Sambhar), pico kachumber, green chutney and our aromatic basmati rice. &#160; <br/>Lemon Rice &amp; Sambhar: $11.99 - A zesty, flavorful South Indian lemon rice paired with hearty, spiced lentil sambhar.<br/>Crispy Corn Salt &amp; Pepper: $11.99 - Crispy Fried Corn Tossed With Onion And Pepper<br/>NAANWICH OR TOASTIES<br/><br/>Chutney Chicken: $11.99 - Juicy chicken and pico are smothered in a tangy cilantro chutney, then nestled between two hearty pieces of naan, and topped with a layer of sharp cheddar jack cheese.<br/>Chicken Tikka: $11.99 - Creamy chicken, and the zest of the tikka masala are complemented by pico and oozy melted cheese, all held together by crispy, crusty slices of Naan. &#160; <br/>Butter Chicken: $11.99 - Butter chicken, pico, and oozy melted cheese, all held together by crispy, crusty slices of Naan.<br/>Paneer Tikka: $11.99 - Paneer tikka masala, pico, and oozy melted cheese are sandwiched between two panini pressed naans.<br/><br/>CURRIES WITH RICE/NAAN<br/><br/>MEAT (NON-VEG)<br/>Butter Chicken: $13.99<br/>Chicken Tikka: $13.99<br/>Madras Chicken: $13.99<br/>Coconut Chicken: $13.99<br/>Mutton/Lamb: $14.99<br/>Calicut Egg Masala: $12.99<br/>VEGETARIAN<br/>Paneer Tikka Masala: $13.99<br/>Chana Masala: $12.99<br/>Dal Makhani: $12.99<br/>Shahi Paneer: $13.99<br/>Malai Kofta: $13.99<br/>Palak Paneer: $13.99<br/>Paneer Methi Malai: $13.99<br/>Rajma: $12.99<br/>PLATTERS<br/><br/>The Canadian Indian Platter: $19.99 - One serving of chickpeas, your choice of butter chicken or paneer, one rice, one piece of naan, one piece of raita. Serves one person. &#160; <br/>Tikka Masala Platter: $20.99 - One Chicken Tikka Masala, one Paneer Tikka Masala, one Rice, one piece of Naan, and one portion of raita. Serves one person.<br/>Peace, Love, and Vegan Platter: $18.99 - One serving of Chickpeas Curry, Dhal Masala, one Rice and one piece of Naan. Serves one person.<br/>Platter Special For Two (Non-Veg): $49.00 - Feeds two people and includes Chicken Tikka Masala/Butter Chicken, Basmati Rice, two Samosa, two Raita, four Naan, and two Gulab Jamun. &#160; <br/>Lassi Platter Special For Two: $52.00 - Butter Chicken, Chicken Tikka Masala, Shahi Paneer, Basmati Rice, four pieces of Naans, two pieces of Samosas, two pieces of Rasagulla, and two Mango Lassi. &#160; <br/>BIRYANI<br/><br/>Chicken Dum Biryani: $11.99<br/>Mutton/Lamb Biryani: $13.99<br/>Paneer Biryani: $11.99<br/><br/>CHAAT PLEASE<br/><br/>Deconstructed Samosa Aka Samosa Chat (Vegetarian): $10.99 - An inside-out phenomenon loaded with chana masala, pico kachumber, chutney, and samosas.<br/>Naughty Samosa Chaat: $13.99 - Loaded with your choice of butter chicken, chicken tikka masala, or paneer tikka masala, queso, pico kachumber, chutney, and samosas. &#160; <br/>Aloo Tikki Chaat (2 pcs): $10.99 - Two handmade seasoned potato patties topped with chickpea chana masala, pico, and chutney.<br/>Curry Up Now Chaat: $13.99 - Two samosa and one aloo tikki topped with chickpea chana masala, yogurt, pico kachumber, and chutney.<br/>Aloo Papri Chaat: $11.99 - A combo of crunchy, creamy, sweet, spicy, savory all in one bite. Then there's a bowl of papri chaat.<br/>Bhel Puri: $11.00 - Tangy, crunchy, sweet, and spicy-the poster child of Indian Street Food. Puffed rice, onions, tomatoes, assorted chutneys, and more. &#160; <br/>DahiVada Aka DahiBhalla: $11.99 - Fried lentil dumplings topped with creamy cooling yogurt, a dollop of tangy tamarind chutney, and a sprinkle of mixed spices. &#160; <br/>Bun Samosa (Vegan): $9.99 - Vegan. Buttered bun, samosa, ketchup, chutney, and pico kachumber.<br/>Aloo Tikki Burger (Vegetarian): $9.99 - Vegetarian. Buttered bun, aloo tikki (potato patty), green chutney, pico kachumber.<br/>Vegetable Pakoras (Assorted): $12.99 - Assorted vegetables dipped in a spicy batter and deep fried to make fabulous fritters. Served with chutney.<br/>Paneer Pakora: $12.99 - Paneer dipped in a spicy batter and deep fried to make fabulous fritters. Served with chutney.<br/>SAMOSAS<br/><br/>Samosa (2 PCS): $4.00<br/>Samosa (6 PCS): $10.99<br/>Samosa (12 PCS): $20.99<br/>Samosa (24 PCS): $39.99<br/><br/>INDO-CHINESE<br/><br/>MOMOS<br/><br/>Chicken Momos: $11.99<br/>Vegetable Momos: $11.99<br/>Paneer Momos: $11.99<br/>FRIED RICE/NOODLES<br/><br/>Fried Rice/Noodles with Chilli Chicken: $12.99 - It is a sweet, spicy and crispy appetizer, most popular in Indo-Chinese cuisine. Chilli chicken is made with lightly battered crispy chicken chunks lightly tossed in a spicy chilli sauce.<br/>Fried Rice/Noodles with Vegetable Manchurian: $12.99 - Indo-Chinese dish where crisp fried vegetable balls are dunked in slightly sweet, sour and hot manchurian sauce. It can be enjoyed on its own1 or with fried rice or hakka noodles.2 &#160; <br/>1.<br/>www.skipthedishes.com<br/>www.skipthedishes.com<br/>2.<br/>www.skipthedishes.com<br/>www.skipthedishes.com<br/>LASSI / DESERTS<br/><br/>LASSI<br/><br/>Mango Lassi: $4.99<br/>Strawberry Lassi: $5.99<br/>Blackberry Lassi: $5.99<br/>Avocado Lassi: $5.99<br/>Sweet Lassi: $4.99<br/>DESERTS (1LB - $11.00)<br/><br/>Gulab Jamun<br/>Motichoor Laddu<br/>Badam Barfi<br/>REFRESHER'S<br/><br/>Masala Chai: $2.99<br/>Water: $1.99<br/>Canned Pop: $1.99<br/>Shikanji: $3.95<br/>Masala Pepsi: $3.99"
}