{
"name" : "Beaux Daddy's",
"status" : "",
"link" : "http://www.beauxdaddy.ca/", 
"hours" : "(Sunday: 13:00 - 00:00), (Monday: 16:00 - 00:00), (Wednesday - Thursday: 16:00 - 00:00), (Friday - Saturday: 13:00 - 00:00)", 
"tel" : "807-622-1111", 
"sms": "", 
"address" : "1575 Highway 61", 
"map": "https://maps.app.goo.gl/dHzYzbTStHtwtSEF7", 
"updated" : "2026-01-04", 
"courtesy" : "Justin Menu",
"text" : "
SOUP
<br>Cream of Tomato - 10 Creamy and tangy tomato soup enriched with herbs and spices.
<br>Lemon Coriander [Gluten Free] - 10 A refreshing clear veg soup with lemon, coriander, carrots and cabbage.
<br>Sweet Corn Shorba [Gluten Free] - 10 Delicate vegetable and sweet corn soup with subtle spice.
<br>Hot N Sour - 10 Savoury and spicy with vegetables and soy sauce.
<br>Manchao - 10/13 Veg / Chicken n Egg soup.
<br>SALADS
<br>Ceasar Salad (Add Chicken $2) - 10 Old fashion, lettuce, cherry tomato parmesan.
<br>Raw Green Salad [Vegan] [Gluten Free] - 10 Mix of cucumbers, tomatoes, onions, and fresh lettuce, carrots, green chilli with lemon wedges.
<br>Chana Chatpata Salad [Vegan] [Gluten Free] - 10 Chickpea, onion, tomato, lemon, fresh coriander and seasoning.
<br>Peanut Masala [Vegan] [Gluten Free] - 10 Peanuts, tomatoes, onions, lemon juice tossed with spices.
<br>Masala Papad - 10 Poppadum sprinkled with onions, tomatoes, lemon juice and spices.
<br>APPETIZERS (NON-VEG)
<br>Chicken Wings (12 pc.) - 20 Chooce your flavour: Peri Peri / Salt & Pepper / BBQ / Honey Chilli Garlic / Bang Bang
<br>Chilly Shrimp [Hot] - 20 Shrimp tossed with peppers, onion and spicy tangy sauce.
<br>Chilly Chicken [Hot] - 20 Boneless chicken tossed with peppers, onion and spicy tangy sauce.
<br>Chicken 65 [Hot] - 20 Chicken toasted with yogurt, spices, curry leaves and herbs.
<br>Bang Bang Chicken [Hot] [Hot] [Hot] - 20 Crisp-tossed Chicken coated in a spicy, tangy blend.
<br>Butter Chicken Croquettes - 20 Loaded with butter chicken sauce served with pickled mayo.
<br>Chicken Manchurian - 20 Fried chicken tossed in tangy manchurian sauce.
<br>Honey Chilli Crisp Chicken [Hot] - 20 Crispy golden chicken tossed in a sweet and tangy honey glaze, finished with a hint of garlic and sesame.
<br>Fish Pakora [Gluten Free] - 22 Fish coated with chickpeas batter and spices.
<br>Lamb Pepper Masala [Hot] - 25 Tender lamb pieces cooked in a fiery black pepper and aromatic spice blend.
<br>APPETIZERS (VEG)
<br>French Fries [Vegan] - 9
<br>Peri Peri Fries [Vegan] - 10
<br>Samosa (2pcs) [Vegan] - 10 Cone shape Indian snack, stuffed with potato, mild spices. Served with mint and tamarind sauce.
<br>Honey Chilli Potato - 17 Crispy fried potato tossed in honey garlic sauce.
<br>Cauliflower Wings [Gluten Free] - 20 Dusted cauliflower tossed in (mild, medium or hot) honey garlic sauce.
<br>Veg Manchurian [Vegan] - 20 Crispy fried vegetables ball tossed in tangy manchurian sauce.
<br>Cheese Corn Lollipop (6pcs) - 20 Crispy fried cheese and corn dumplings served with herb sauce.
<br>Chilly Paneer [Hot] - 20 Cottage cheese with peppers, onion and spicy tangy sauce.
<br>Paneer 65 [Hot] - 20 Cottage cheese tossed with spices and curry leaves.
<br>Bang Bang Paneer [Hot] [Hot] [Hot] - 20 Crisp-tossed cottage cheese coated in a spicy and tangy sauce.
<br>Soya Chilly [Hot] - 20 Soya chaap tossed with peppers, onion and spicy tangy sauce.
<br>CHAAT CORNER
<br>Samosa Chaat - 10 Savory chickpeas with crispy samosa topped with yogurt and chutney.
<br>Dahi Ke Golgappe - 10 Crisp golgappe filled with spices, creamy sweetened yogurt, finished with chutneys.
<br>Papri Chat - 10 Bite size crispy fried cracker loaded with potatoes, yogurt and tamarind sauce.
<br>Aloo Tikki Chaat - 13 Crispy fried potato patties toped with yogurt, chutneys and chaat masala.
<br>Dahi Bhalla [Gluten Free] - 15 Deep fried lentil fritters dunked in creamy yogurt topped with sweet spicy chutneys.
<br>MAIN COURSE
<br>CHICKEN CURRIES
<br>Chettinad Chicken [Gluten Free] [Hot] - 20 South Indian style spiced with whole spices, fresh onions and curry leaves in a thick gravy.
<br>Chicken Tikka Masala [Gluten Free] [Hot] - 20 Chicken cooked in a rich, creamy gravy with aromatic spices, roasted nuts, and a hint of smoky flavor.
<br>Kadai Chicken [Gluten Free] [Hot] - 20 Spiced chicken cooked with peppers, onions, and classic kadai masala.
<br>Chicken Curry (Bone-in) [Gluten Free] [Hot] - 20 Slow-cooked bone-in chicken in a rich, homestyle curry with deep, layered flavours.
<br>Chicken Vindaloo [Gluten Free] [Hot] [Hot] - 20 Tender chicken simmered in a bold, spicy, and tangy curry with vinegar, garlic, and aromatic spices.
<br>Chicken Kolhapuri [Gluten Free] [Hot] [Hot] [Hot] - 20 Chicken slow-cooked in an authentic, robust Kolhapuri masala.
<br>Khaas-e-Aam Chicken Curry [Gluten Free] - 20 Chicken simmered in a rich mango purée with aromatic spices and a hint of sweetness.
<br>Butter Chicken [Gluten Free] - 20 Char Grilled chicken in fresh tomato and cashew gravy enriched with butter, cream and fenugreek.
<br>Chicken Methi Malai [Gluten Free] - 20 Chicken cooked in a cashew creamy gravy with fenugreek leaves and spices.
<br>BEEF CURRIES
<br>Beef Vindaloo [Gluten Free] [Hot] - 25 Flavourful beef cooked with garam masala, cumin, paprika, turmeric, mustard, ground ginger in onion gravy.
<br>LAMB/GOAT CURRIES
<br>Jaipuri Laal Maas [Gluten Free] [Hot] - 25 Slow cooked lamb curry simmered with onions, bay leaf, cinnamon and red chilies.
<br>Mutton Roganjosh [Gluten Free] - 25 Roganjosh stands for aromatic curried meat, traditionally lamb cook and coloured with unique spices.
<br>Saag Gosht [Gluten Free] - 25 Lamb stewed in spice-infused fresh spinach curry.
<br>Goat Curry (Bone-in) [Gluten Free] - 25 Goat stewed in spice-infused fresh onion and tomato curry.
<br>PANEER CURRIES
<br>Paneer Lababdar [Gluten Free] - 20 Mildly spiced cottage cheese tossed with capsicum in tomato and cashew gravy.
<br>Kolhapuri Paneer [Gluten Free] [Hot] - 20 Tender cottage cheese cubes in a rich, fiery Kolhapuri sauce made with aromatic spices, coconut, and Kashmiri chillies.
<br>Palak Paneer [Gluten Free] - 20 Cottage cheese cooked in spice infused fresh spinach gravy.
<br>Adraki Dhaniya Paneer [Gluten Free] - 20 Cottage cheese cubes cooked in a fragrant ginger-coriander gravy, infused with spices.
<br>Cheese Butter Masala [Gluten Free] - 20 Amul cheese cubes simmered in a rich, buttery tomato gravy with a touch of cream and aromatic spices.
<br>Paneer Butter Masala [Gluten Free] - 20 Creamy and rich gravy with cottage cheese cubes, cooked in a buttery tomato-based sauce, with aromatic spices.
<br>Paneer Mutter Methi Malai [Gluten Free] - 20 Cottage cheese and green peas cooked in a creamy gravy with fenugreek leaves & spices.
<br>Paneer Tikka Masala [Gluten Free] - 20 Creamy and rich gravy with cottage cheese marinated with spices, cooked in a buttery tomato-based sauce and aromatic spices.
<br>VEGGIE CURRIES
<br>Veg Makhani [Gluten Free] [Vegan] - 20 Fresh vegetable sauteed with chunky garlic, herbs and tossed in buttery gravy.
<br>Mushroom Matar Masala [Gluten Free] - 20 Mushrooms tossed in a spiced, tangy masala, coated with aromatic herbs.
<br>Palak Chana [Gluten Free] - 20 A wholesome blend of tender chickpeas simmered in a creamy spinach gravy, seasoned with aromatic spices.
<br>Pindi Chhole(Chickpea) [Vegan] [Gluten Free] - 20 White chickpea curry infused with fragrant ginger-garlic, spices and tangy dry mango powder.
<br>Baingan Bharta [Gluten Free] [Vegan] - 20 Smoked eggplant blended with slow cooked tomatoes, caramelized onions, and spices for a rich, rustic mash.
<br>Mix Veg Sangam [Gluten Free] - 20 A medley of fresh vegetables slow-cooked in a silky, aromatic curry for a perfect harmony of flavours.
<br>SIGNATURE DALS
<br>Dal Makhni [Gluten Free] - 19 Black lentils cooked overnight with tomatoes and butter.
<br>Yellow Dal Tadka [Vegan] [Gluten Free] - 19 Yellow lentils cooked with spices tempered with ginger and garlic.
<br>Dal Fry [Gluten Free] - 19 Slow-cooked black lentils enriched with a fragrant ghee tadka of roasted spices.
<br>PAIR ANY MAINS WITH A GARLIC NAAN AND AROMATIC BASMATI RICE FOR $9
<br>SEAFOOD CURRIES
<br>Mapusa Fish Curry [Gluten Free] - 25 Fish curry made with tomato gravy, coconut cream and spices.
<br>Jheenga Jalandhariya [Gluten Free] - 25 Juicy prawns cooked in Punjabi-style gravy, bursting with spices, tomatoes cream.
<br>BURGER/SANDWICH
<br>Uncle's Burger - 20 Ground Beef patty with fresh toppings in house sauce, and melted cheddar cheese.
<br>The Sleeping Giant - 20 Signature beef patty, ham slice, lettuce, tomatoes, caramelised onion and cheddar cheese.
<br>The Superior Burger - 20 Seasoned and pan fried chicken patty with lettuce, tomato, cheddar cheese and pickle mayo.
<br>Veggie Delight Burger - 18 Veggie patty made with potatoes, peas, fresh herbs, and aromatic spices with fresh toppings in house sauce and melted cheddar cheese.
<br>Tandoori Chicken Sandwich - 20 Grilled fresh sliced bread filled with shredded tandoori chicken, spring greens, tomatoes and cheese slice.
<br>All burgers and all sandwiches comes with fries and a side of salads.
<br>SPECIAL SELECTIONS
<br>Pork Ribs - 25 Slow-cooked pork ribs finished with a tangy orange glaze sauce.
<br>Cheese Arancini balls - 20 Crispy charcol coated rice balls filled with melted cheese, served with a side of zesty marinara.
<br>Chole Bhature (Only Sat & Sunday 1pm-5pm) - 18 Fluffy golden fried naan paired with rich, spiced chole(Chickpea). Served with mint sauce, spiced yogurt and raw onions.
<br>TANDOORI TEMPTATION (Traditional clay oven that gives meats and breads a smoky, charred flavor)
<br>Tandoori Chicken [Gluten Free] [Hot] - 25 Roasted chicken in pot clay oven with spicy marination and greens. (3 drumsticks, 1 whole leg)
<br>Paneer Tikka (TANDOORI / AFGANI) [Gluten Free] - 22 Cottage cheese, red onions, peppers roasted with spicy flavour or malai (creamy) flavour.
<br>Afgani Soya Chaap/ Tandoori - 20 Soya marinated in a creamy/spicy blend of aromatic spices, grilled to smoky perfection.
<br>Lahori Chicken Tikka (TANDOORI / AFGANI) [Gluten Free] - 20 Boneless Chicken, red onions, peppers roasted with spicy flavour or malai (creamy) flavour.
<br>Tandoori Fish Tikka [Gluten Free] - 23 Clay oven baked fish with spicy marination and served with mint sauce.
<br>IN HOUSE BIRYANI'S
<br>Tawa Lamb [Gluten Free] - 25 Rice cooked with lamb meat and spices served with raita and papad.
<br>Goat (Bone-in) [Gluten Free] - 25 Rice cooked with goat meat and spices and served with raita and papad.
<br>Chicken Dum (Bone-in) [Gluten Free] [Hot] - 21 A fragrant rice dish made with chicken, aromatic spices and saffron all slow-cooked to perfection.
<br>Veg [Gluten Free] - 20 A fragrant rice dish made with mixed vegetables, aromatic spices and saffron all slow-cooked to perfection.
<br>RICE
<br>Plain - 8 Fluffy, fragrant long-grain rice steamed to perfection.
<br>Jeera (Cumin) - 9 Aromatic basmati rice tempered with roasted cumin seeds and finished with fresh coriander.
<br>BREADS
<br>Roti(Plain/Butter) - 4 Whole wheat roti brushed with melted butter.
<br>Butter/Plain Naan - 5 Fluffy tandoor-baked naan finished with a generous coating of butter.
<br>Bullet Naan [Hot] - 6 Soft tandoori naan topped with fresh coriander and finely chopped raw green chillies.
<br>Chilli Olive Naan - 6 Freshly baked naan layered with green chillies and black olives for a savoury, spicy bite.
<br>Garlic Naan - 6 Soft tandoori naan topped with fresh garlic.
<br>Cheese Naan - 10 Tandoori naan stuffed with melted cheese.
<br>RAITA
<br>Plain - 4 Refreshing chilled yogurt lightly seasoned with cumin and herbs.
<br>Mix Veg - 6 Refreshing chilled yogurt blended with coriander, onions, tomatoes, and mild spices.
<br>DESSERTS
<br>Rabri Mousse - 10 Slow-cooked milk, sweetened and flavoured with cardamom, saffron, and nuts.
<br>Mango Mousse - 10 Light, airy mousse bursting with the sweetness of ripe mangoes.
<br>Gulab Jamun with Ice Cream - 10 Warm, soft milk dumplings soaked in fragrant syrup, served alongside creamy vanilla ice cream. (4pcs) & (1 scoop).
<br>Baked Gulab Jamun - 10 Caramelised baked gulab jamun topped with creamy rabri for a smokey finish.
<br>Gajar Ka Halwa - 10 Slow-cooked grated carrots simmered in milk, ghee, and sugar, flavoured with cardamom and garnished with nuts.
<br>Belgium Chocolate Brownie - 10 Rich, fudgy brownie made with premium Belgian chocolate topped with vanilla ice cream.
"
}