{
"name" : "Creative Cooking (Inside Goods & Co.)",
"status" : "",
"link" : "", 
"hours" : "(Wednesday - Thursday: 11:00 - 18:00), (Friday: 11:00 - 23:00), (Saturday: 10:00 - 23:00), (Sunday: 10:00 - 16:30)", 
"tel" : "807-356-2366", 
"sms": "", 
"address" : "251 Red River Road (Inside Goods & Co.)", 
"map": "https://maps.app.goo.gl/T7svURBggs8BmVRW7", 
"updated" : "2025-10-31", 
"courtesy" : "Justin Menu", 
"text" : "
<br>LOCAL. HANDMADE. CREATIVE Creative Cooking Local. Handmade. Creative
<br>
<br>VEGGIE SAMOSA CHAAT $13.00 GOLDEN, CRISPY PASTRY FILLED WITH POTATO AND SPICES COMES WITH 3 UNIQUE SAUCES
<br>
<br>PANEER SAMOSA CHAAT $15.00 PASTRY ROLLED IN CHILLY FLAKES, FILLED WITH SOFT CRUMBLE PANEER AND SPINACH IN OUR SPICES COMES WITH 3 UNIQUE SAUCES
<br>
<br>BEEF SAMOSA CHAAT $17.00 PERFECTLY FRIED PASTRY ROLLED IN CARROM SEEDS, FILLED WITH UMAMI FLAVOURED GROUND BEEF, MUSHROOMS AND 3 UNIQUE SAUCES
<br>
<br>BUTTER CHICKEN MAC AND CHEESE $15.00 RICH AND CREAMY BUTTER CHICKEN MEETS THE TRADITIONAL MAC AND CHEESE, GREAT MOZZARELLA ROTINI PASTA, TOPPED WITH CRISPY FRIED SHALLOTS AND ONIONS
<br>
<br>MAC AND CHEESE $12.00 TRADITIONAL THREE-CHEESE BLEND WITH TOUCH OF OUR OWN SPICE BLEND, MOZZARELLA, BAKED TO PERFECTION TOPPED WITH GREEN ONIONS
<br>
<br>DIPS
<br>
<br>BUTTER CHICKEN SPINACH DIP $17.00 AUTHENTIC BUTTER CHICKEN MEETS THE CREAMY, CHEESY, DELICIOUS SPINACH DIP THAT GETS SERVED WITH FLOUR TOASTADAS
<br>
<br>REG. SPINACH DIP $15.00 CREAMY, CHEESY, DELICIOUS SPINACH DIP THAT GETS SERVED WITH FLOUR TOASTADAS
<br>
<br>ROASTED RED PEPPER HUMMUS $16.00 RICH, CREAMY AND GARLICKY HUMMUS WITH SESAME OIL, TOPPED WITH CARAMELISED BEANS AND CREAM OF RED PEPPER WITH TOASTED SESAME SEEDS. SERVED WITH TOASTADAS
<br>
<br>SPECIALS
<br>
<br>SOUP DU JOUR / NOODLE BOWL SOUP OF THE DAY, NOODLE BOWLS ARE ONLY AVAILABLE DURING FRIDAY
<br>
<br>PARTY PACK OF SAMOSAS INQUIRE US ABOUT VARIETY OF SIZES
<br>
<br>PARTY SIZE BUTTER CHICKEN MAC AND CHEESE INQUIRE US ABOUT THE SIZE OF PARTY MAC AND CHEESE AND FROZEN OPTIONS"
}