{
    "link": "https:\/\/www.jennifersglutenfreekitchen.com\/",
    "hours": "",
    "tel": "tel: 807-620-7059",
    "sms": "",
    "address": "Address: 215 Red River Road, Unit 107",
    "map": "https:\/\/maps.app.goo.gl\/8PWpJz4PCK1U6eBd7",
    "updated": "Updated: 2024-11-15",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Egg Bites $30 per dozen<br\/>Bacon and White Cheddar<br\/>Spinach and Feta<br\/>Egg Muffins $48 per dozen<br\/>Ham and Swiss<br\/>Broccoli, Bacon, Cheddar<br\/>Veggie - Broccoli, carrot, zucchini DF<br\/>Overnight Oats $7 each<br\/>oatmeal, chia seeds, flax seeds, maple syrup, milk or (almond milk) *DF<br\/>Assorted Berries $2<br\/>In-house made granola $2<br\/>Apples and Cinnamon $2<br\/>Orange and Cardamom $2<br\/>Chia Pudding $6<br\/>Chia seeds, milk (or almond milk), maple syrup, vanilla<br\/>In-House made granola $2<br\/>Apple Cinnamon $2<br\/>Orange Cardamon $2<br\/>Yogurt Parfait $10 each<br\/>Greek Yogurt, in-house made granola DF, Fresh berries<br\/>Energy Balls $30 per dozen<br\/>Chocolate Mint - Chocolate mint, raw cashews, cocoa powder, mejool dates, peppermint oil, ground flax seed, real maple syrup, sea salt<br\/>Banana Bread - Rolled oats, banana, almonds, pecans, real maple syrup, cinnamon, vanilla, sea salt<br\/>Oatmeal Chocolate Chip - Rolled oats, real maple syrup, shredded coconut, almond butter, ground flaxseed, chocolate chips, vanilla, sea salt<br\/>Power Bowls (Minimum 2 of the same)<br\/>Served cold $18 each<br\/><br\/>Peanut Chicken<br\/>Brown or basmati rice, frilled chicken breast, red cabbage, shredded carrots, sliced bell peppers, chopped cucumbers, peanut sauce *DF<br\/>Greek Chicken<br\/>Brown or basmati rice, frilled chicken, tomatoes, cucumber, feta, Kalamata olives, red onion, in-house made Greek vinaigrette *DF<br\/>Taco Beef<br\/>Ground seasoned beef (or beef substitute), shredded cheddar, black beans, corn, chopped lettuce, diced peppers, salsa, sour cream, pickled jalapeno, lime<br\/>Veggie<br\/>Quinoa or rice, shredded carrots, edamame, roasted beets, roasted cauliflower, roasted zucchini, in-house made hummus<br\/>Meals (Minimum 2 of the same)<br\/>$25 each<br\/>Chicken souvlaki, lemon potatoes\/basmati rice, roasted tomatoes, zucchini, red onions, feta, kalmata olives<br\/>Chicken Parmesan<br\/>Crispy breaded chicken breast, spicy penne, roasted seasonal veggies<br\/>Teriyaki Chicken<br\/>Marinated and grilled chicken breast, bell peppers zucchini, red onion, on bed of rice or noodles. *DF<br\/>Sticky Sesame Chicken<br\/>Ground chicken, sticky in-house made Asian sauce, steamed broccoli, bed of rice *DF<br\/>Butter Chicken<br\/>Slow cooked tender chicken breast, in a rich and creamy tomato based butter sauce (mild to medium heat), served on bed of rice with spinach<br\/>Best Ever Beef Lasagna<br\/>Braised ground beef and chorizo sausage, cheesy ricotta filling, loads of mozzarella and parmesan (serves 2)<br\/>Shepherd's Pie<br\/>Ground Beef, carrots, peas, tomato-based sauce, fresh herbs and mashed potato crust *DF<br\/>Orange Sesame Beef<br\/>Slow braised steak in sticky hoisin sauce, fresh oranges, sesame seeds, served on rice with steamed season veggies *DF<br\/>Pork Greek Ribs<br\/>Dry rubbed pork side ribs, with lemon roasted potatoes and Greek Salad *DF<br\/>Maple Mustard Pulled Pork<br\/>Juicy shred of pork seasoned with grainy mustard and real maple syrup. Served on a bed of mashed sweet potatoes, with seasonal steamed veggies.<br\/>Mashed sweet Add $2<br\/>BBQ Pork Ribs<br\/>Juicy, fall off the bone ribs, with Smokey BBQ sauce, corn on the cob (when in season), and herb roasted potatoes *DF<br\/>Greek Pork Souvlaki<br\/>Marinated, skewered and grilled, served with lemon potatoes or rice and seasonal frilled vegetables<br\/>Coconut Chickpea Curry<br\/>Indian inspired flavour, with coconut milk, chickpeas, spinach, cilantro and served on coconut rice. *DF<br\/>Veggies Lasagna<br\/>Extra cheesy with assortment of seasonal vegetables and afresh tomato sauce<br\/>Mushroom Risotto<br\/>Creamy mushroom risotto with parmesan and truffle oil, and a side of asparagus<br\/>Dijon Salmon<br\/>Baked salmon with creamy spread of garlic, parsley and Dijon. Served with white and wild rice and steamed seasonal vegetables. *DF<br\/>Maple Salmon<br\/>Baked salmon with real maple syrup glaze. Served with rice and seasonal steamed vegetables. *DF<br\/>Tuna Casserole<br\/>Old fashioned favourite. Tuna in a creamy cheese sauce with elbow macaroni, peas, celery and crunchy bread on top.<br\/>Soups<br\/>1 Litre $22<br\/>Carrot Ginger Soup<br\/>Carrots, fresh ginger, in-house made vegetable broth, garlic, onions, cinnamon<br\/>Broccoli Cheddar<br\/>Creamy soup with loads of broccoli, carrot sticks, celery and cheddar cheese<br\/>Chicken Noodle Soup<br\/>Roasted chicken, mirepoix, fresh ginger, Heartbeat Hot Sauce, chicken broth, rice noodles<br\/>Best Ever Lentil Soup<br\/>Dried lentils, roasted peppers, mirepoix, kale or spinach, tomatoes, fresh herbs, in-house made vegetable broth *DF<br\/>Salads<br\/>$30 each. Serves 4<br\/>Greek Salad<br\/>Romaine lettuce, cucumbers, tomatoes, red onion, feta, Kalamata olives, in-house made Greek dressing<br\/>Caesar Salad<br\/>Romaine Lettuce, crispy bacon, fresh grated parmesan, in-house made creamy garlic dressing<br\/>Italian Garden Salad<br\/>Mixed Greens, Roma tomatoes, in-house made croutons, pepperoncini, red onions, black olives, fresh grated parmesan, in-house made Italian vinaigrette<br\/>Buns and Breads<br\/>Pricing per dozen unless specified<br\/>Muffins $36 per dozen<br\/>Blueberry with Lemon Glaze, Banana chocolate Chip, Cream Chesses Stuffed Pumpkin, Raspberry and White Chocolate, Apple Cinnamon with Crumb Topping<br\/>Roasted Garlic &amp; Rosemary Focaccia DF $30<br\/>With Balsamic Vinegar and Olive Oil Dip $6<br\/>Vegan Focaccia DF $32 per dozen<br\/>With balsamic Vinegar and Olive oil dip<br\/>Garlic Cheddar Biscuits $32<br\/>Copycat version of Red Lobster Biscuits<br\/>Brazilian Cheese Buns $26 per dozen<br\/>Pizza Crusts (package of 3) $24 *DF<br\/>Naan with Garlic Butter and Parsley $24<br\/>6 per package",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "name": "Jennifer's Gluten-Free Kitchen"
}