{
"name" : "Dawson General Store",
"status" : "",
"link" : "", 
"hours" : "(Sunday - Saturday: 07:00 - 20:00)", 
"tel" : "807-633-0587", 
"sms": "807-633-0587", 
"address" : "3130 Dawson Road", 
"map": "https://maps.app.goo.gl/DzjNsZu7F1kfwEpe9", 
"updated" : "2025-11-04", 
"courtesy" : "CS!", 
"text" : "SCAN TO ORDER ONLINE 3130 Dawson Rd - corner of - Dawson & Mapleward
<br>MENU
<br>PREMIUM 18'' HAND STRETCHED PIZZAS
<br>VEGETARIAN sauce, mozzarella, fresh vegetables ($29)
<br>PEP & CHEESE sauce, mozzarella, pepperoni ($27)
<br>HAWAIIAN sauce, mozzarella, ham, pineapple ($29)
<br>FROMAGE A TROIS sauce, mozzarella, cheddar, Grana Padano ($28)
<br>SHREDDER sauce, mozzarella, shredded pepperoni ($29)
<br>HALF & HALF 1/2 Hawaiian, 1/2 Pep & Cheese ($29)
<br>PICKLE PIE basil pesto (nut free), mozzarella, dill pickles, house-smoked bacon, aged cheddar ($35)
<br>MEET MEAT sauce, mozzarella, chicken, ham, house-smoked bacon, pepperoni, ground beef ($40)
<br>DELUXE sauce, mozzarella, ham, house-smoked bacon bell peppers, onions mushrooms ($37)
<br>BBQ CHICKEN CAESAR house caesar dressing, mozzarella, chicken breast, house-smoked bacon, bbq sauce drizzle ($37)
<br>PEPOCALYPSE sauce, mozzarella, dry aged pep, shredded pep, cup & char pep ($35)
<br>BIG BAD WOLF sauce, mozzarella, ham, pepperoni, house-smoked bacon, hot honey drizzle ($40)
<br>GARLIC FINGEES 14'' pizza dough, garlic butter & parmesan cheese. With roasted garlic mayo & pizza sauce for dipping ($21)
<br>DIPS roasted garlic mayo - pizza sauce - ranch - caesar ($3)
<br>THE DAWSON GENERAL sauce, mozzarella, beef, house bacon, onions, pickles, aged cheddar, burger sauce ($40)
<br>BUILD YOUR OWN PIZZA
<br>18 inch pizza with mozzarella cheese and choice of sauce ($24) choose from...pizza sauce, caesar, basil pesto (nut-free), bbq sauce.
<br>pineapple - red peppers - fresh mushrooms - onions - tomato - pickles - jalapenos - black or green olives - banana peppers...$4
<br>ground beef - extra mozzarella - aged cheddar - pepperoni - ham...$5
<br>house-smoked bacon - smoked pulled pork - house italian sausage seasoned chicken breast - shredded pepperoni...$6
<br>BURGS AND STUFF
<br>CLASSIC SMASH BURGER 2 all-beef patties, double cheese, sliced dill pickles, thin sliced onion, our famous burger sauce, grilled house milk bun ($11.50)
<br>BABY SMASH 1 all-beef patty, cheese, grilled milk bun ($6.50)
<br>SMASH TACOS (2) 6'' flour tortillas, 2 smashed beef patties, melted cheese, burger sauce, pickles, onions, tomato, lettuce ($10.75)
<br>VEGGIE BURGER house black bean veggie patty, melted cheese, pickles, thin sliced onions, our famous burger sauce, tomato, lettuce, grilled house milk bun ($10.75)
<br>SMASHED SALAD 2 all beef patties, double cheese, dill pickles, sliced onions, tomatoes, burger sauce, on a bed of lettuce ($12.50)
<br>BURGER ADD ONS
<br>shredded lettuce - tomato - jalapeno mayo - cheese slice - mayo - caesar dressing - pizza sauce - bbq sauce - caesar dressing $1.25 each Swiss cheese - cheddar cheese - fried egg - ham - sauteed mushroom $2.75 each house bacon - house pulled pork - extra patty $3.75 each
<br>We proudly serve fresh ground beef by Maltese Grocery Pizza dough fermented for 72 hours. Pizza sauce made with San Marzano tomatoes. Buns baked fresh every morning. Bacon smoked onsite. All sauces made from scratch.
<br>807-633-0587 807-633-0587"
}