{
	"name": "Thai Bay Kanyaw",
    "link": "",
    "hours": "",
    "tel": "tel: 807-356-5797",
    "sms": "",
    "address": "Address: 65 Court Street South",
    "map": "https:\/\/maps.app.goo.gl\/44vhf27LAYtDfhuD6",
    "updated": "Updated: 2024-11-07",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Appetizers<br\/>All salad rolls are made with rice paper, carrots, cilantro, noodle, lettuce, and cucumber. Served with carrot and peanut sauce.<br\/><br\/>1. Salad Roll (2 pcs)<br\/>1. Salad Roll (2 pcs)<br\/>Salad roll served with peanut sauce. One order comes with two pieces.<br\/><br\/>$9.99<br\/>2. Spring Roll (2 pcs)<br\/>2. Spring Roll (2 pcs)<br\/>Pork Spring roll served with sweet and sour fish sauce or sweet and sour soy sauce. One order comes with two pieces.<br\/><br\/>$9.99<br\/>4. Crispy Wonton (12 pcs)<br\/>4. Crispy Wonton (12 pcs)<br\/>Pork wonton. One order comes with twelve pieces.<br\/><br\/>$8.99<br\/>5. Sweet and Sour Pork<br\/>5. Sweet and Sour Pork<br\/>$8.99<br\/>Soups<br\/>8. Special Wonton Soup<br\/>8. Special Wonton Soup<br\/>Wonton soup is made with pork wonton, soft noodles, bbq pork, shrimp, and veggies.<br\/><br\/>$18.99<br\/>6. Pho (Vietnamese Beef Noodle Soup)<br\/>6. Pho (Vietnamese Beef Noodle Soup)<br\/>Lean beef, cook beef, beef ball, cilantro, green onion, white onion, pepper, sprout, and hoisin sauce.<br\/><br\/>$19.75<br\/>7. Kwetio (Thai Beef Noodle Soup)<br\/>7. Kwetio (Thai Beef Noodle Soup)<br\/>Lean beef, cook beef, beef ball, BBQ pork, sprout, cilantro, fried onion, garlic, and peanut.<br\/><br\/>$19.99<br\/>9. Tom Yum Noodle Soup (Spicy and Sour Thai Noodle Soup)<br\/>Chicken, shrimp, mushroom, tomato, cilantro, green onion, and coconut milk.<br\/><br\/>$18.99<br\/>10. Thai Coconut Curry<br\/>Your choice of meat, broccoli, carrot, green bean, red pepper and basil. Served with rice.<br\/><br\/>$17.99<br\/>Stir Fry<br\/>11. Krapao (Thai Basil Stir Fry)<br\/>11. Krapao (Thai Basil Stir Fry)<br\/>Your choice of meat, red peppers, green bean, and basil. Served with rice and fried eggs.<br\/><br\/>$18.75<br\/>12. Chop Suey (Chinese Stir Fry)<br\/>12. Chop Suey (Chinese Stir Fry)<br\/>Your choice of meat, cabbage, carrot, and bean sprout. Served with rice.<br\/><br\/>$18.99<br\/>13. Mixed Greens<br\/>Your choice of meat, cabbage, broccoli, carrot, and onion. Served with rice.<br\/><br\/>$18.99<br\/>14. Low Mein (Chinese Stir Fry Small Soft Noodle)<br\/>14. Low Mein (Chinese Stir Fry Small Soft Noodle)<br\/>Your choice of meat, broccoli, cabbage, carrot, and onion.<br\/><br\/>$18.99<br\/>15. Pad Thai (Thai Stir Fry Flat Noodle)<br\/>15. Pad Thai (Thai Stir Fry Flat Noodle)<br\/>Your choice of meat, tofu, egg, carrot, onion, peanut, and bean sprout.<br\/><br\/>$17.99<br\/>16. Pad Woosan (Thai Stir Fry Glass Noodle)<br\/>Your choice of meat, cabbage, onion, carrot, egg, and bean sprout.<br\/><br\/>$18.99<br\/>Chow Mein<br\/>Stir fry crispy noodles. Your choice of meat, carrot, napa bean sprouts.<br\/><br\/>$18.99<br\/>Asian Favourites<br\/>17. Vietnamese Noodle Bowl<br\/>17. Vietnamese Noodle Bowl<br\/>Your choice of meat, pork spring roll, lettuce, carrot, peanuts, and cucumber. Served with sweet and sour fish sauce or sweet and sour soy sauce.<br\/><br\/>$17.99<br\/>19. Thai Noodle Salad<br\/>19. Thai Noodle Salad<br\/>Thai noodle salad made with rice noodle, bbq pork, cilantro, peanut, fried onion, fried garlic, cucumber, carrot, and lettuce.<br\/><br\/>$17.99<br\/>Special Fried Rice<br\/>21. Thai Special Fried Rice<br\/>21. Thai Special Fried Rice<br\/>Thai special fried rice is made with beef, chicken, carrot, green beans, pepper, basil garlic, and egg.<br\/><br\/>$17.99<br\/>23. Chinese Special Fried Rice<br\/>23. Chinese Special Fried Rice<br\/>Chinese special fried rice is made with chicken, BBQ pork, shrimp, onion, carrot, and bean sprouts.<br\/><br\/>$17.99<br\/>Plant Based Meals<br\/>No egg and no dairy.<br\/><br\/>E. Tofu Chops Suey<br\/>E. Tofu Chops Suey<br\/>Chinese stir fry made with tofu, onion, carrots, napa, and sprouts. Served with rice.<br\/><br\/>$19.75<br\/>A.Tofu Pad Thai<br\/>Thai sweet and sour stir fry flat rice noodles with carrot, tofu, peanut, sprouts, and onions.<br\/><br\/>$18.75<br\/>B.Tofu Pad Woonsan<br\/>Thai stir-fry glass noodles with tofu, carrot, broccoli, sprouts, and napa cabbage.<br\/><br\/>$19.99<br\/>C. Tofu Krapao<br\/>Thai basil stir-fried with tofu, green beans, red pepper, garlic, and basil.Served with rice.<br\/><br\/>$18.99<br\/>D. Tofu Mixed Green<br\/>D. Tofu Mixed Green<br\/>Stir fry tofu, onion, carrots, broccoli, and napa. Served with rice.<br\/><br\/>$19.99<br\/>F. Tofu Lowmin<br\/>Chinese stir-fried small yellow noodles with tofu, carrot, onion, broccoli, sprouts, and napa.<br\/><br\/>$19.99<br\/>G. Tofu Curry<br\/>Thai coconut soup made with tofu, broccoli, red pepper, green beans, carrots, and basil. Served with rice.<br\/><br\/>$18.99<br\/>H. Tofu Tomyum Noodle Soup<br\/>Thai spicy and sour soup made with tofu, mushrooms, tomatoes, lime, lime leaves, galanga, lemon grass, cilantro, fried onions , sprouts, and pepper.<br\/><br\/>$17.99<br\/>I. Tofu Otamin<br\/>Burmese coconut rice served with curry tofu and vegetables.<br\/><br\/>$18.99<br\/>J. Tofu Thai Noodles Salad<br\/>J. Tofu Thai Noodles Salad<br\/>Rice noodles, tofu, cilantro, peanut, cucumber, carrots, lettuce, and fried onions.<br\/><br\/>$17.99<br\/>K. Tofu Basil Fried Rice<br\/>Thai basil fried rice made with tofu, pepper, green beans and garlic.<br\/><br\/>$17.99<br\/>M. Tofu Chinese Fried Rice<br\/>Chinese-style fried rice made with tofu, carrots, sprouts, and onions.<br\/><br\/>$17.99<br\/>Asian Desserts<br\/>Kids Menu<br\/>BBQ Pork Wonton Soup<br\/>$10.99<br\/>Chicken Tomyum Soup<br\/>$10.99<br\/>Burmese Chicken Soup<br\/>$10.99<br\/>Consomme Soup<br\/>$9.99<br\/>Egg Fried Rice<br\/>$9.99<br\/>Plain Rice and Fried Eggs<br\/>$9.99<br\/>Drinks<br\/>Pepsi<br\/>$1.99"
}