{
"name" : "Wayland Bar & Grill, The",
"status" : "",
"link" : "",
"hours" : "(Sunday: 12:00 - 21:00), (Monday - Thursday: 11:00 - 00:00), (Friday - Saturday: 11:00 - 2:00)", 
"tel" : "807-577-5863", 
"sms": "", 
"address" : "1019 Gore Street", 
"map": "https://maps.app.goo.gl/9zafEx5R8hiX9Kh77", 
"updated" : "2026-01-28", 
"courtesy" : "The Wayland Bar & Grill", 
"text" : "
The Wayland Bar and Grill Call us (807) 577-5863 Take-Out/Reservations 1019 Gore St W, Thunder Bay, ON P7E 3T2
<br>Appetizers
<br>Appetizer Platter - $39.95 Smoked Onion dip and choice of two of our appetizers
<br>St. Louis Taster - $16.95 4 individually cut rib bones, served with Wayland BBQ sauce
<br>Smoked Belly - $12.95 Smoked pork belly cubes, Wayland BBQ sauce, cucumber salad
<br>Pulled Pork Poutine - $12.95 Fries, Thunder Oak cheese curds, gravy, smoked pulled pork, Wayland BBQ sauce
<br>Brisket Poutine - $12.95 Fries, Thunder Oak cheese curds, gravy, smoked brisket ends, Wayland BBQ sauce
<br>Mozza Sticks - $13.95 Breaded mozzarella, deep fried, served with house tomato sauce
<br>Burnt Ends - $14.95 Smoked brisket ends, cucumber salad, Wayland BBQ sauce
<br>Smoked Onion Dip - $14.95 Smoked onions, cream cheese, Thunder Oak gouda, and spices. Served with tortilla chips
<br>BBQ Baked Beans - $11.95 Wayland baked beans, with choice of burnt ends or pulled pork added inside. Served with crostini
<br>Wings - $16.95 9 Chicken Wings with sauce or seasoning
<br>Sauces/Seasonings: Salt & Pepper Cajun Lemon Pepper Roasted Pepper+ Garlic Wayland BBQ Carolina Pineapple BBQ Honey Garlic Buffalo Sauce Franks Hot Baton Rouge Thai Sauce Smokey Habanero (Smokey Sweet) Scorpion Habanero (In Your Face)
<br>Classic Wayland Favourites
<br>Fries - $4.95 Poutine - $7.95 Chicken Strips: 4pc - $11.95, 6pc - $17.95 Mushroom Caps - $9.95 Jalapeño Poppers - $11.95 Onion Rings - $6.95 Fried Pickles - $9.95
<br>Finger Platter Chicken fingers with choice of sauce and 1 side 4 Strips - $13.95 6 Strips - $19.95
<br>Nachos - $14.95 Nacho chips, shredded cheese, tomatoes, jalapeños, peppers, olives, bacon. Served with salsa & sour cream Extra Cheese - $2.99 Extra Bacon - $1.99 Add Brisket - $4.95 Add Pulled Pork - $4.95 Add Chicken - $4.95 Add Ground Beef - $2.95
<br>Salads
<br>Chicken Caesar Salad - $16.95 Romaine, croutons, bacon, parmesan, lemon wedge, chicken breast, house caesar.
<br>House Salad - $8.95 Romaine, tomatoes, cucumber, red onions, carrots. With dressing of choice. Dressings: Ranch, Italian, French, Blue-Cheese, Caesar, Balsamic Vinaigrette.
<br>Coleslaw - $4.95 Cabbage and carrots with creamy house-made dressing
<br>Cucumber Salad - $4.95 Cucumber, with house made tangy vinaigrette.
<br>Pizzas & Panzerottis Panzo’s $2.00 less!
<br>Pep N’ Cheese - $18.95 Pepperoni, pizza sauce, mozzarella Just cheese? - $14.95
<br>Hawaii 5-O - $18.95 Ham, pineapple, pizza sauce, mozzarella
<br>Oh Canada - $20.95 Bacon, pepperoni, mushroom, onions, pizza sauce, mozzarella
<br>The Deluxe - $21.95 Pepperoni, ham, onions, green peppers, olives, pizza sauce, mozzarella
<br>The Meatza - $22.95 Pepperoni, ham, sausage, bacon, pizza sauce, mozzarella
<br>Wayland Supreme - $23.95 Pepperoni, sausage, bacon, green peppers, mushrooms, onions, olives, pizza sauce, mozzarella
<br>Bruschetta - $20.95 Tomato, red onions, mozzarella, parmesan, garlic oil, balsamic glaze.
<br>Herbivore - $20.95 Mushrooms, onion, roasted red peppers, tomato, pizza sauce, mozzarella
<br>Cheeseburger - $21.95 Burger, onion, pickles, bacon, Wayland burger sauce, pizza sauce, mozzarella
<br>BBQ Chicken - $22.95 Chicken, red onions, roasted red peppers, mixed cheese, BBQ drizzle, pizza sauce, mozzarella
<br>The Smokehouse - $22.95 Your choice of smoked pulled pork/smoked brisket burnt ends. Red onions, roasted red peppers, mixed cheese, BBQ drizzle, pizza sauce, mozzarella
<br>3 Topping Pizza/Panzerotti Choice of 3 toppings: Mushroom, diced onion, pineapple, green peppers, green olives, black olives, roasted red peppers, pickles, tomato, hot peppers, jalapeño, pulled pork, brisket ends, pepperoni, sausage, ham, bacon, ground beef.
<br>Smoked Plates
<br>Rib Plate: 5 Bones - $21.95, 10 Bones - $34.95 Smoked St. Louis Ribs, fries, coleslaw, and 1 side
<br>Rib N’ Wing - $29.95 Smoked St. Louis Ribs, 5 wings with choice of sauce or seasoning, coleslaw, fries, and 1 side
<br>Rib N’ Ends - $29.95 St. Louis Ribs, smoked brisket ends, fries, coleslaw, and 1 side
<br>BYO BBQ Platter - $44.95 Choice of 3: 4 Rib bones, burnt ends, smoked pork belly, pulled pork. With fries, cucumber salad, coleslaw, beans, and 2 kaisers. Get all four meats: + $9.95
<br>Sides Add a side - $4.95 Fries, Coleslaw, House Salad, Cucumber Salad, Baked Beans
<br>Premium Sides Fries + Gravy + $1.00 Onion Rings + $2.00 Poutine + $3.00 Caesar Salad + $3.00 Pork Poutine + $8.00 Brisket Poutine + $8.00
<br>Handhelds Handhelds include 1 side of choice.
<br>Burnt End Burger - $17.00 3oz Patty, cheddar, brisket ends, crispy onions, cucumber salad, roasted garlic aioli and Wayland BBQ sauce, Roma Bakery kaiser
<br>Pulled Pork - $14.95 Smoked pulled pork, coleslaw, pickles, Carolina pineapple BBQ sauce, Roma Bakery kaiser
<br>Brisket Sandwich - $14.95 Brisket ends, pickles, crispy onions, roasted garlic aioli, Wayland BBQ sauce, Roma Bakery kaiser
<br>Chicken Club - $15.95 Chicken, lettuce, tomato, bacon, Alabama white BBQ sauce, roasted garlic aioli, Roma Bakery kaiser
<br>Buffalo Wrap - $15.95 Chicken, mixed cheese, buffalo, lettuce, tomato, ranch, tortilla
<br>Wayland Cheesesteak - $14.95 Brisket ends, cheddar, sautéed peppers and onions, roasted garlic aioli, Roma Bakery panini
<br>Classic Burger - $10.95 Two 3oz patties, ketchup, mustard, relish, lettuce, tomato, Roma Bakery kaiser
<br>Wayland Smashburger - $11.95 Two 3oz patties, cheddar, lettuce, tomato, pickles, onions, Wayland burger sauce, Roma Bakery kaiser
<br>Mozza Burger - $13.95 Two 3oz patties, mozzarella, lettuce, tomato, bacon, sautéed mushrooms, roasted garlic aioli, Roma Bakery kaiser
<br>Caesar Wrap - $15.95 Chicken, bacon, parmesan, lettuce, caesar dressing, tortilla
"
}