{
    "link": "",
    "hours": "",
    "tel": "tel: 807-767-0000",
    "sms": "",
    "address": "Address: 801 Red River Road",
    "map": "https:\/\/maps.app.goo.gl\/mKAH67EQ8sJWKBGV8",
    "updated": "Updated: 2024-11-15",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Specials<br\/>XL Pep and Cheese<br\/>Extra large pepperoni and cheese pizza.<br\/><br\/>$22.24<br\/><br\/>Fried Ravioli<br\/>Five fried mozzarella ravioli with marinara and Parmesan.<br\/><br\/>$10.99<br\/><br\/>Mac N' Cheese Bites<br\/>6 cheesy bites with your choice of ranch or jalape&#241;o ranch<br\/><br\/>$9.99<br\/><br\/>4 Beer Deal<br\/>$20.00<br\/><br\/>M Walk-In Special<br\/>This medium pizza comes with sauce, cheese, and your choice of one free regular topping! For pickup only.<br\/><br\/>$10.99<br\/><br\/>L Walk-In-Special<br\/>This large pizza comes with sauce, cheese, and your choice of one free regular topping! For pickup only.<br\/><br\/>$12.99<br\/><br\/>XL Walk-In-Special<br\/>This extra large pizza comes with sauce, cheese, and your choice of one free regular topping! For pickup only.<br\/><br\/>$15.99<br\/><br\/>Sides and Dips<br\/>Dips<br\/>$0.00<br\/><br\/>Wings<br\/>$17.99<br\/><br\/>Garlic Sticks with Cheese<br\/>$10.99<br\/><br\/>Jalape&#241;o Poppers<br\/>Traditional Breaded Jalape&#241;o Poppers with cream cheese. Comes with a side of ranch for dipping.<br\/><br\/>$9.99<br\/><br\/>Fiesta Poppers<br\/>Fiesta Breaded Jalape&#241;o poppers with tangy chili cream cheese. Comes with a side of ranch for dipping.<br\/><br\/>$10.98<br\/><br\/>Ceasar Salad<br\/>$10.99<br\/><br\/>Greek Salad<br\/>$10.99<br\/><br\/>Potato Wedges<br\/>$8.99<br\/><br\/>Small Pizzas<br\/>Small Build-Your-Own<br\/>$10.99<br\/><br\/>S BBQ Chicken<br\/>BBQ Sauce Base, mozzarella, bacon, chicken, green pepper, red onion, three cheese, drizzle of bbq sauce.<br\/><br\/>$15.75<br\/><br\/>S Big Papa Burger<br\/>Thousand island base, mozzarella, ground beef, pickles, red onion, three cheese.<br\/><br\/>$15.75<br\/><br\/>S Bruschetta<br\/>Garlic spread base, mozzarella, bruschetta mix (tomatoes, onion, garlic, basil), feta cheese and a drizzle of balsamic.<br\/><br\/>$15.75<br\/><br\/>S Chicken Alfredo<br\/>Alfredo sauce, mozzarella, grilled chicken breast, red onion, roasted red pepper and broccoli.<br\/><br\/>$15.75<br\/><br\/>S Deluxe<br\/>Mozzarella, bacon, green peppers, mushrooms, pepperoni, red onion, tomatoes.<br\/><br\/>$15.75<br\/><br\/>S Greek<br\/>Mozzarella, black olives, feta, garlic, red onion, tomatoes, green olives.<br\/><br\/>$15.75<br\/><br\/>S Italian Classic<br\/>Mozzarella, roasted red peppers, mushroom, pepperoni, sausage.<br\/><br\/>$15.75<br\/><br\/>S Meat Lovers<br\/>Mozzarella, bacon, ground beef, ham, pepperoni, sausage.<br\/><br\/>$15.75<br\/><br\/>S Parmesan Veggie<br\/>Mozzarella, roasted red peppers, mushrooms, parmesan, red onion, spicy eggplant.<br\/><br\/>$15.75<br\/><br\/>S Provalone Hawaiian<br\/>Mozzarella, bacon, ham, pineapple, provolone.<br\/><br\/>$15.75<br\/><br\/>S Rad Chad<br\/>Mozzarella, banana peppers, feta, pepperoni, pineapple, green olives.<br\/><br\/>$15.75<br\/><br\/>S True Canadian<br\/>Mozzarella, bacon, ham, mushrooms, pepperoni, three cheese.<br\/><br\/>$15.75<br\/><br\/>S Veggie<br\/>Mozzarella, black olives, green pepper, mushrooms, red onions, tomatoes.<br\/><br\/>$15.75<br\/><br\/>Medium Pizzas \/ Panzo<br\/>Medium Build-Your-Own<br\/>$11.99<br\/><br\/>Build Your Own Panzerotti<br\/>Build your perfect panzerotti, comes with cheese and sauce inside it as well as a pizza sauce dip and our house made chipotle mayo.<br\/><br\/>$15.99<br\/><br\/>M BBQ Chicken<br\/>BBQ Sauce Base, mozzarella, bacon, chicken, green pepper, red onion, three cheese, drizzle of bbq sauce.<br\/><br\/>$17.99<br\/><br\/>M Big Papa Burger<br\/>Thousand island base, mozzarella, ground beef, pickles, red onion, three cheese.<br\/><br\/>$17.99<br\/><br\/>M Bruschetta<br\/>Garlic spread base, mozzarella, bruschetta mix (tomatoes, onion, garlic, basil), feta cheese and a drizzle of balsamic.<br\/><br\/>$17.99<br\/><br\/>M Chicken Alfredo<br\/>Alfredo sauce, mozzarella, grilled chicken breast, red onion, roasted red pepper and broccoli.<br\/><br\/>$17.99<br\/><br\/>M Deluxe<br\/>Mozzarella, bacon, green peppers, mushrooms, pepperoni, red onion, tomatoes.<br\/><br\/>$17.99<br\/><br\/>M Greek<br\/>Mozzarella, black olives, feta, garlic, red onion, tomatoes, green olives.<br\/><br\/>$17.99<br\/><br\/>M Italian Classic<br\/>Mozzarella, roasted red peppers, mushroom, pepperoni, sausage.<br\/><br\/>$17.99<br\/><br\/>M Meat Lovers<br\/>Mozzarella, bacon, ground beef, ham, pepperoni, sausage.<br\/><br\/>$17.99<br\/><br\/>M Parmesan Veggie<br\/>Mozzarella, roasted red peppers, mushrooms, parmesan, red onion, spicy eggplant.<br\/><br\/>$17.99<br\/><br\/>M Provalone Hawaiian<br\/>Mozzarella, bacon, ham, pineapple, provolone.<br\/><br\/>$17.99<br\/><br\/>M Rad Chad<br\/>Mozzarella, banana peppers, feta, pepperoni, pineapple, green olives.<br\/><br\/>$17.99<br\/><br\/>M True Canadian<br\/>Mozzarella, bacon, ham, mushrooms, pepperoni, three cheese.<br\/><br\/>$17.99<br\/><br\/>M Veggie<br\/>Mozzarella, black olives, green pepper, mushrooms, red onions, tomatoes.<br\/><br\/>$17.99<br\/><br\/>Large Pizzas<br\/>Large Build-Your-Own<br\/>$14.99<br\/><br\/>L BBQ Chicken<br\/>BBQ Sauce Base, mozzarella, bacon, chicken, green pepper, red onion, three cheese, drizzle of bbq sauce.<br\/><br\/>$22.99<br\/><br\/>L Deluxe<br\/>Mozzarella, bacon, green peppers, mushrooms, pepperoni, red onion, tomatoes.<br\/><br\/>$22.99<br\/><br\/>L Meat Lovers<br\/>Mozzarella, bacon, ground beef, ham, pepperoni, sausage.<br\/><br\/>$22.99<br\/><br\/>L Bruschetta<br\/>Garlic spread base, mozzarella, bruschetta mix (tomatoes, onion, garlic, basil), feta cheese and a drizzle of balsamic.<br\/><br\/>$22.99<br\/><br\/>L Big Papa Burger<br\/>Thousand island base, mozzarella, ground beef, pickles, red onion, three cheese.<br\/><br\/>$22.99<br\/><br\/>L Chicken Alfredo<br\/>Alfredo sauce, mozzarella, grilled chicken breast, red onion, roasted red pepper and broccoli.<br\/><br\/>$22.99<br\/><br\/>L Greek<br\/>Mozzarella, black olives, feta, garlic, red onion, tomatoes, green olives.<br\/><br\/>$22.99<br\/><br\/>L Italian Classic<br\/>Mozzarella, roasted red peppers, mushroom, pepperoni, sausage.<br\/><br\/>$22.99<br\/><br\/>L Provalone Hawaiian<br\/>Mozzarella, bacon, ham, pineapple, provolone.<br\/><br\/>$22.99<br\/><br\/>L Parmesan Veggie<br\/>Mozzarella, roasted red peppers, mushrooms, parmesan, red onion, spicy eggplant.<br\/><br\/>$22.99<br\/><br\/>L Rad Chad<br\/>Mozzarella, banana peppers, feta, pepperoni, pineapple, green olives.<br\/><br\/>$22.99<br\/><br\/>L True Canadian<br\/>Mozzarella, bacon, ham, mushrooms, pepperoni, three cheese.<br\/><br\/>$22.99<br\/><br\/>L Veggie<br\/>Mozzarella, black olives, green pepper, mushrooms, red onions, tomatoes.<br\/><br\/>$22.99<br\/><br\/>Extra Large Pizzas<br\/>XL Build-Your-Own<br\/>Comes with mozzarella, add your own toppings to customize your perfect pizza!<br\/><br\/>$19.99<br\/><br\/>XL BBQ Chicken<br\/>BBQ Sauce Base, mozzarella, bacon, chicken, green pepper, red onion, three cheese, drizzle of bbq sauce.<br\/><br\/>$26.99<br\/><br\/>XL Deluxe<br\/>Mozzarella, bacon, green peppers, mushrooms, pepperoni, red onion, tomatoes.<br\/><br\/>$26.99<br\/><br\/>XL Meat Lovers<br\/>Mozzarella, bacon, ground beef, ham, pepperoni, sausage.<br\/><br\/>$26.99<br\/><br\/>XL Big Papa Burger<br\/>Thousand island base, mozzarella, ground beef, pickles, red onion, three cheese.<br\/><br\/>$26.99<br\/><br\/>XL Veggie<br\/>Mozzarella, black olives, green pepper, mushrooms, red onions, tomatoes.<br\/><br\/>$26.99<br\/><br\/>XL Bruchetta<br\/>Garlic spread base, mozzarella, bruschetta mix (tomatoes, onion, garlic, basil), feta cheese and a drizzle of balsamic.<br\/><br\/>$26.99<br\/><br\/>XL Chicken Alfredo<br\/>Alfredo sauce, mozzarella, grilled chicken breast, red onion, roasted red pepper and broccoli.<br\/><br\/>$26.99<br\/><br\/>XL Greek<br\/>Mozzarella, black olives, feta, garlic, red onion, tomatoes, green olives.<br\/><br\/>$26.99<br\/><br\/>XL Italian Classic<br\/>Mozzarella, roasted red peppers, mushroom, pepperoni, sausage.<br\/><br\/>$26.99<br\/><br\/>XL True Canadian<br\/>Mozzarella, bacon, ham, mushrooms, pepperoni, three cheese.<br\/><br\/>$26.99<br\/><br\/>XL Provalone Hawaiian<br\/>Mozzarella, bacon, ham, pineapple, provolone.<br\/><br\/>$26.99<br\/><br\/>XL Parmesan Veggie<br\/>Mozzarella, roasted red peppers, mushrooms, parmesan, red onion, spicy eggplant.<br\/><br\/>$26.99<br\/><br\/>XL Rad Chad<br\/>Mozzarella, banana peppers, feta, pepperoni, pineapple, green olives.<br\/><br\/>$26.99<br\/><br\/>XL Veggie<br\/>Mozzarella, black olives, green pepper, mushrooms, red onions, tomatoes.<br\/><br\/>$26.99<br\/><br\/>Eat Local Classics<br\/>Chicken Caesar<br\/>Locally made roasted garlic caesar dressing as a base, spinach, mozzarella, chicken, local bacon, and local extra old gouda. Comes with a lemon wedge.<br\/><br\/>$29.99<br\/><br\/>George's Market Sausage Pizza<br\/>Rosemary cream base, with mozzarella, a double helping of George's Market Pizza Sausage (contains tomato and dairy), thick cut mushrooms, roasted red peppers and a balsamic glaze drizzle.<br\/><br\/>$29.99<br\/><br\/>Market Meat<br\/>Our cream based market sauce, mozzarella, pepperoni, local ground beef, local sausage, local bacon, local kielbasa, local garlic cheese curds.<br\/><br\/>$29.99<br\/><br\/>Perogie<br\/>Our cream based market sauce, mozzarella, local perogies, local bacon, local extra old gouda, in store made caramelized onions. Comes with two sour cream dipping sauces.<br\/><br\/>$29.99<br\/><br\/>Philly Cheese<br\/>Our cream based market sauce, mozzarella, philly beef, caramelized onion, red onion, mushroom, green peppers, provolone cheese.<br\/><br\/>$29.99<br\/><br\/>Desserts<br\/>2 Persians<br\/>$4.00<br\/><br\/>4 Persians<br\/>$6.00<br\/><br\/>S'more Panzerotti<br\/>$13.99<br\/><br\/>Apple Pie Panzerotti<br\/>$13.99<br\/><br\/>Cherry Cheesecake Panzerotti<br\/>$13.99<br\/><br\/>Blueberry Cheesecake Panzerotti<br\/>$13.99<br\/><br\/>Frozen Pizzas<br\/>Frozen Pizza Box<br\/>$60.00<br\/><br\/>Frozen Brisket Pizza<br\/>$17.99<br\/><br\/>Frozen Perogie<br\/>$17.99<br\/><br\/>Frozen Perogie No Bacon<br\/>$17.99<br\/><br\/>Frozen Pep<br\/>$10.99<br\/><br\/>Frozen Market Meat<br\/>$17.99<br\/><br\/>Frozen George's<br\/>$17.99<br\/><br\/>Frozen Westfort Beef<br\/>$17.99<br\/><br\/>Frozen Bruschetta<br\/>$17.99<br\/><br\/>Frozen Philly Cheese<br\/>$17.99<br\/><br\/>Frozen Chicken Caesar<br\/>$17.99<br\/><br\/>Frozen Provolone Hawaiian<br\/>$17.99<br\/><br\/>Limited Edition Frozen<br\/>$17.99<br\/><br\/>Local Goods<br\/>Brule Creek Canola Oil<br\/>500ml of locally made Canola Oil<br\/><br\/>$8.00<br\/><br\/>Heartbeat Hot Sauce<br\/>$0.00<br\/><br\/>Shumka Dust<br\/>$6.00<br\/><br\/>Shumka Steak Spice<br\/>$6.50<br\/><br\/>Shumka Awakening<br\/>$6.50<br\/><br\/>Hoito Pancake Mix<br\/>$9.00<br\/><br\/>Big Lake Pasta<br\/>$0.00<br\/><br\/>Beverages<br\/>Juice<br\/>$0.00<br\/><br\/>G2<br\/>$0.00<br\/><br\/>Canned Pop<br\/>$0.00<br\/><br\/>Water Bottle<br\/>$1.25<br\/><br\/>Chocolate Milk<br\/>$2.00<br\/><br\/>Alcoholic Beverages<br\/>Sleeping Giant Brewery ($5.99)<br\/>$0.00<br\/><br\/>Dawson Trail Brewery ($5.99)<br\/>$0.00<br\/><br\/>Seltzers &amp; Ciders ($5.99)<br\/>$0.00<br\/><br\/>Forgotten Lake (473ml) (7.1% ABV)<br\/>$6.99<br\/><br\/>Budwiser (473ml) (5.0% ABV)<br\/>$5.99<br\/><br\/>Coor's Lite (473ml) (4.0% ABV)<br\/>$5.99<br\/><br\/>Molson Canadian (473ml) (5.0% ABV)<br\/>$5.99",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "image4": "img4.webp",
    "image5": "img5.webp",
    "image6": "img6.webp",
    "image7": "img7.webp",
    "name": "Eat Local Pizza"
}