{
    "link": "",
    "hours": "",
    "tel": "tel: 807-577-8880",
    "sms": "",
    "address": "Address: 555 West Arthur Street (Inside The Superior Inn)",
    "map": "https:\/\/maps.app.goo.gl\/cwMkdgBuYLft4j5PA",
    "updated": "Updated: 2024-10-27",
    "courtesy": "Courtesy: Justin Menu",
    "text": "MOOSEHEAD LAGER Pale Lager &#8226; 5% &#8226; Saint John, New Brunswick<br\/><br\/>60oz $23.99<br\/>16oz $7.49 A pale lager that pours a nice beautiful golden yellow color and offers a good balance between malt sweetness and hop bitterness. &#160; <br\/>SLEEPING GIANT BIG JOE'S AMBER LAGER Lager &#8226; 5.2% &#8226; Thunder Bay, ON Canada<br\/><br\/>60oz $23.99<br\/>16oz $7.49 Big Joe's Amber Lager is our house-made beer made by Sleeping Giant Brewery. Full-bodied, malt-forward Amber Lager.<br\/>SLEEPING GIANT NORTHERN LOGGER Kolsch &#8226; 4.9% &#8226; Thunder Bay, ON Canada<br\/><br\/>60oz $23.99<br\/>16oz $7.49 Northern Logger is a Kolsch-style beer, which is light on the palate and very easy drinking. Lightly hopped with Bravo hop to give a little extra bitterness to counteract the sweetness.<br\/>CANS<br\/><br\/>MOOSEHEAD RADLER Shandy &#8226; 4% &#8226; Saint John, New Brunswick 473ml Can $8<br\/>SLEEPING GIANT MR. CANOEHEAD Red Ale &#8226; 5.1% &#8226; Thunder Bay, ON Canada 473ml Can $7.75 While Mr. Canoehead is labeled as a red ale, it deviates from the style with an added dry-hop to give it added aroma and flavour. The malt and Citra hops of this aromatic hoppy Red Ale will strike you like a lightning bolt... without fusing your canoe to your head. &#160; <br\/>SLEEPING GIANT SEASONAL Lager &#8226; Thunder Bay, ON Canada 473ml Can $7.75 Ask about our seasonal selection<br\/>SLEEPING GIANT SKULL ROCK Oatmeal Stout &#8226; 5.1% &#8226; Thunder Bay, ON Canada 473ml Can $7.75 Skull Rock Stout is an Oatmeal Stout with six different malts, toasted oak silkiness, and a single aromatic English hop deliver a balanced complexity. A slightly sweet stout with a rich grain and chocolate flavour. &#160; <br\/>SLEEPING GIANT WHITE OUT NE\/Hazy IPA &#8226; 6.1% &#8226; Thunder Bay, ON Canada 473ml Can $7.75 Vermont Style yeast, along with the addition of oats and the precision-timed addition of dry hopping has made this beautiful beer as hazy as can be! Kettle hopped with Columbus, Citra and Mosaic with additional dry hopping &#160; <br\/>BOTTLES<br\/><br\/>ALEXANDER KEITH'S NOVA SCOTIA STYLE PALE ALE American Pale Ale &#8226; 5.4% Bottle $5.99 Alexander Keith's Nova Scotia Style Pale Ale is brewed with traditional two-row malt for a full, malty flavor with a burst of fruity, spicy and citrusy hop nose. The beer features a deep golden color with a balanced bitterness. &#160; <br\/>ANGRY ORCHARD HARD APPLE CIDER Cider &#8226; 5% &#8226; Cincinnati, OH Bottle $6.75 This crisp and refreshing cider mixes the fresh apple aroma and slightly sweet, ripe apple flavor make this cider hard to resist.<br\/><br\/> &#160; <br\/>BUD LIGHT Lager &#8226; 4.2% &#8226; St. Louis, MO Bottle $5.75<br\/>Bud Light is a premium light lager with a superior drinkability that has made it the best-selling and most popular beer in the United States.<br\/><br\/>BUDWEISER Lager &#8226; 5% &#8226; St. Louis, MO Bottle $5.75<br\/>Brewed using a blend of imported and classic American aroma hops, and a blend of barley malts and rice resulting in unparalleled balance and character. &#160; <br\/><br\/>COORS LIGHT Pale Lager &#8226; 4.2% &#8226; Golden, CO Bottle $5.75<br\/>First, aged (lagered) below freezing to give our beer its crisp taste. Then it's filtered cold so that it gets that brilliant, bright appearance. &#160; <br\/><br\/>COORS MOLSON CANADIAN Pale Lager &#8226; 5% &#8226; Golden, CO Bottle $5.75<br\/>Using crystal clear water, the finest hops and Canadian-grown malted barley, Molson slowly ferments each brew to produce a smooth, refreshing beer with genuine Canadian taste. &#160; <br\/><br\/>CORONA Mexican Lager &#8226; 4.6% &#8226; An&#225;huac, M&#233;xico Bottle $7.25<br\/>Made with the finest quality blend of filtered water, malted barley, hops, corn, and yeast.<br\/><br\/>HEINEKEN Lager Pilsner &#8226; 5.4% &#8226; Netherlands Bottle $7.25<br\/>Crisp &amp; smooth Euro Lager.<br\/><br\/>LABATT BLUE Pilsner &#8226; 4.7% &#8226; Toronto, Canada Bottle $5.75<br\/>Hallertau hops, 2-row malted barley &amp; Canadian barley, clean refreshing taste with distinct hop aroma, delicate fruit flavor and a slightly sweet aftertaste &#160; <br\/><br\/>MICHELOB ULTRA Pale Lager &#8226; 4.2% &#8226; St. Louis, MO Bottle $6.50<br\/>Low-carb light beer with taste smooth enough to carry the Michelob name.<br\/><br\/>SMIRNOFF ICE Vodka &#8226; 4.5% &#8226; Norwalk, CT Bottle $6.75<br\/>Vodka Beverage<br\/><br\/>STELLA ARTOIS Pale Lager &#8226; 5% &#8226; Leuven, Belgium Bottle $7.25<br\/>Premium European lager of noble traditions that is still brewed using natural ingredients in the same processes of mixing and fermentation used in the old days. &#160; <br\/><br\/>TWISTED TEA ORIGINAL Malt Beverage &#8226; 5% &#8226; Cincinnati, OH Bottle $6.75<br\/>Twisted Tea Original is refreshingly smooth hard iced tea made with real brewed black tea and a twist of natural lemon flavor. Non-carbonated, naturally sweetened, and 5% ABV&#8212;it's your favorite iced tea with a classic twist! Keep it Twisted. &#160; <br\/><br\/>APPETIZERS<br\/><br\/>THREE CHEESE NACHOS 18.99 Crisp corn chips topped with melted Jack, Cheddar and Mozzarella cheese, diced tomatoes, bell peppers, olives, jalapenos and green onions with mild salsa and sour cream.<br\/>Add Grilled chicken 2.99<br\/>Add spicy beef 2.99<br\/>MINI-BITE SIZED PAN FRIED PEROGIES 10.99 Pan fried in butter, bacon and onions served with a side of sour cream.<br\/>POTATO POPPERS 10.99 Potato, green onion, cheese and bacon whipped together, coated with seasoned breading and lightly fried, served with southwest sauce. &#160; <br\/>BAKED SPINACH DIP WITH NACHO CHIPS 13.99 Nacho chips with our housemade creamy spinach and onion dip.<br\/>MOZZA STICKS 10.99 Breaded Mozzarella sticks served with marinara sauce.<br\/>CJ'S CHICKEN WINGS<br\/>One lb 14.99<br\/>Two lbs 27.99 A full pound of our jumbo roasted chicken wings dusted with seasoned flour and fried crisp. Finished with your choice of sauce: BBQ, Lemon Pepper, Hot, Cajun, Mild, Salt &amp; Pepper, Louisiana, Thai, Roast Garlic &amp; Pepper, Dakota, Honey Garlic, Mango Chipotle, Ghost, Dill Pickle, Jerk (Dry), Baton Rouge, Thai Domi, Hot Pickle, Big Joe's BBQ and Hot Thai. &#160; <br\/>SOUPS, SALADS AND MORE<br\/><br\/>FRENCH ONION SOUP 7.99 Made fresh with Spanish onions and topped with garlic crostini and melted Swiss cheese. Served with warm cheese and garlic bread. &#160; <br\/>SOUP &amp; SANDWICH 9.99 Ask your server about today's selections.<br\/>CHICKEN CAESAR SALAD 14.99 Fresh romaine lettuce mixed with Caesar dressing, topped with croutons, shredded Parmesan cheese, and grilled chicken.<br\/>CALIFORNIA SALAD 14.99 Romaine lettuce, strawberries, kiwi and mandarin orange tossed with our honey dill dressing and topped with toasted almond slices. &#160; <br\/>GRILLED TOP SIRLOIN SALAD 18.99 A sliced 6oz Certified Angus Beef Brand sirloin, fresh greens tossed with roasted sweet peppers, tomatoes, red onion, and crumbled goat cheese. Dressed with balsamic vinaigrette and seasoned croutons. &#160; <br\/>TEX-MEX CHICKEN FAJITA SALAD 15.99 Grilled chicken breast strips saut&#233;ed with sweet peppers and onions, and topped with a shredded cheese blend. Served over a green salad with diced tomato, all in a crispy tortilla bowl. &#160; <br\/>CHICKEN GARDEN SALAD 12.99 Mixed greens with tomato, cucumber, carrot with grilled chicken, your choice of dressing.<br\/>CLASSICS<br\/><br\/>BIG JOE'S GRILLED CHICKEN &amp; BACON CLUBHOUSE 17.99 A charbroiled chicken breast, smoked bacon strips, full ripe tomatoes and crisp lettuce on white, brown or rye bread with mayonnaise. &#160; <br\/>CRISPY GRILLED CHICKEN QUESADILLA 14.49 A fresh flour tortilla filled with diced chicken shredded cheese, green onion and tomato. &#160; <br\/>MUSTARD BEER BATTERED CHICKEN STRIPS 15.49 Chicken strips dipped in our signature mustard beer batter, fried crisp and served with our famous honey dill dip. Includes your choice of golden fries or tossed salad. &#160; <br\/>PHILLY CHEESE STEAK SANDWICH 17.99 Thinly sliced saut&#233;ed beef with onions, bell peppers, and cajun philly cream cheese on grilled on our house loaf topped with melted swiss cheese. Served with au jus for dipping.<br\/>BURGERS<br\/><br\/>THE ANGUS B.B.C BURGER 18.99 Canadian back bacon, smoked strip bacon and aged cheddar cheese on a charbroiled patty. Served with lettuce, tomato and mayo. &#160; <br\/>SMOKEHOUSE BURGER 18.99 Smoked bacon, melted cheddar cheese, thick cut garlic dill pickles, crispy onion strings, fresh leaf lettuce, tomato, and mayo drizzled with bold BBQ sauce. &#160; <br\/>FLATBREADS 15.99<br\/><br\/>PEPPERONI AND CHEESE Marinara sauce, Pepperoni, Mozzarella cheese.<br\/>SICILIAN Chorizo sausage, Capicolla, Calabrese, spicy salami, Mozzarella and Parmesan cheese with green oil.<br\/>PASTA AND STIR FRIES Served after 4 pm<br\/><br\/>SPICY CHORIZO JAMBALAYA 23.99 Penne noodles saut&#233;ed with fajita mixed vegetables, chorizo sausage, shrimp and chicken strips in our cajun spiced tomato sauce. This has some heat, if you would like it extra spicy, please let your server know.<br\/>SPAGHETTI AND A MEATBALL 20.99 Capone's famous slow braised meat balls atop spaghetti noodles with mozzarella cheese, fresh herb oil and herbs. Add a second meat ball for 8.00. &#160; <br\/>ASIAN CHICKEN STIR-FRY 21.99 Sliced chicken strips saut&#233;ed with crisp Asian vegetables and noodles in a tangy Hoisin sauce. Mild, Medium or Hot.<br\/>CHICKEN TETRAZZINI 23.99 Grilled chicken breast, roasted garlic, hickory smoked bacon, saut&#233;ed mushrooms and Alfredo sauce tossed with Gemelli and topped with fresh tomato. &#160; <br\/>ENTREES Served after 4 pm<br\/><br\/>Dinner entr&#233;es are served with choice of baked potato, french fries or mashed potatoes, and chef's fresh vegetable of the day.<br\/><br\/>BEER BATTERED RIBEYE 36.99 12 oz cut, both flavorful and tender the Ribeye is well marbled and has a great beef flavour.<br\/>FISH &amp; CHIPS (3 PC) 23.99 Atlantic cod dipped in a classic mustard beer batter, fried crisp, served with our tartar sauce and golden fries.<br\/>NORTHERN PICKEREL 26.99 A tender filet of freshwater pickerel tossed in seasoned flour and fried until golden.<br\/>MEATLOAF 21.99 A great comfort food - slow roasted Certified Angus Beef Brand meatloaf, bacon wrapped and glazed with Blueberry BBQ sauce, served on a bed of mashed potatoes, with a rich back ribs.<br\/>FULL RACK BABY BACK RIBS 27.99 We start by selecting top choice, meaty, baby back ribs. These are rubbed with our chef's secret blend of spices and then marinated overnight to get a deep penetrating flavour. Our ribs are then braise in either our hickory barbeque sauce or blueberry barbeque sauce until they are tender and juicy. &#160; <br\/>FRIED CHICKEN DINNER 20.99 Three piece chicken dinner, served with french fries and coleslaw. barbeque sauce or blueberry barbeque sauce until they are tender and juicy.<br\/><br\/>breakfast MENU<br\/><br\/>BREAKFAST SANDWICHES<br\/>Served with golden fried breakfast potatoes.<br\/><br\/>DENVER SANDWICH 9.99 Eggs with ham and green onion on Texas toast.<br\/>TRADITIONAL EGGS BENEDICT 11.99 Two poached eggs with hollandaise sauce, served with choice of back bacon or ham served on an English muffin.<br\/>LITE BITES<br\/>One of the following is included: coffee, tea, milk or juice.<br\/><br\/>COLD CEREALS 5.99 Try one of our many brands from Kellogg's.<br\/>FRESH FRUIT CUP 4.99 An assortment of fresh seasonal fruit.<br\/>OATMEAL 7.49 Steaming oatmeal made to order with brown sugar, milk and Texas toast.<br\/>BERRY GRANOLA PARFAIT 8.00 Vanilla Yogurt with a granola blend and mixed berry compote. Served with toast.<br\/>BREAKFAST CLASSICS<br\/><br\/>CJ'S CLASSIC BREAKFAST 13.50<br\/>Two eggs served with your choice of bacon, ham, sausage or fried bologna, fried breakfast potatoes and Texas toast.<br\/><br\/>VEGETARIAN SCRAMBLER SKILLET 11.99<br\/>Fresh garden vegetables saut&#233;ed and lightly seasoned, then mixed with scrambled eggs and golden fried breakfast potatoes topped with cheese. Served with toast.<br\/><br\/>CJ'S SPICY CHORIZO SKILLET 13.99<br\/>Country ham, smoked bacon and spicy chorizo sausage scrambled together with eggs, served over our golden fried breakfast potatoes in a cast iron skillet. Topped with melted cheddar cheese and served with toast.<br\/><br\/>FRENCH TOAST 10.99<br\/>Dipped in our cinnamon french royal batter and grilled golden brown.<br\/><br\/>LUMBERJACK STACK PANCAKES 9.99<br\/>Four light buttermilk pancakes, served with whipped butter and maple flavoured syrup.<br\/><br\/>Add 2 pancakes to any classic breakfast. 2.99<br\/>Add house made caramel bananas foster. 2.49<br\/>BUILD YOUR OWN OMELETTE<br\/>All omelettes are made with three eggs and served with golden fried breakfast potatoes and toast. 13.99<br\/><br\/>Choose any two of the following:<br\/><br\/>Cheddar Cheese | Green Onion | Mushrooms | Bacon | Green Peppers | Ham | Tomatoes | Sausage<br\/><br\/><br\/>Add extra toppings1 0.99 each &#160; <br\/>",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "image4": "img4.webp",
    "name": "Lake and Spruce (Inside The Superior Inn), The"
}