{
    "status": "",
    "link": "",
    "hours": "",
    "tel": "tel: 807-766-7900",
    "sms": "",
    "address": "Address: 50 Cumberland Street South (Inside The Casino)",
    "map": "https:\/\/maps.app.goo.gl\/xHBQLCK3rVY5Jqe88",
    "updated": "Updated: 2024-11-05",
    "courtesy": "Courtesy: Justin Menu",
    "text": "CANADIAN BREAKFAST $12<br\/>Two eggs, hashbrowns and choice of bacon, <br\/>sausage or ham. Served with toast.<br\/>Breakfast ALL DAY<br\/>Salads &amp; Starters<br\/>MAXBET $17<br\/>Three eggs, three strips of bacon, three <br\/>sausages, two slices of ham and triangle <br\/>hashbrowns. Served with toast.<br\/>BELGIAN WAFFLES $10<br\/>Three deliciously stacked Belgian waffles. <br\/>Served with butter and maple syrup.<br\/>TACO SALAD $15<br\/>Iceberg lettuce topped with taco meat, diced <br\/>tomatoes, green onions, black olives &amp; shredded <br\/>cheese. Served with sour cream &amp; salsa.<br\/>MEDITERRANEAN GREEK SALAD $16<br\/>Romaine lettuce topped with red peppers,<br\/>red onions, cucumbers, tomatoes, black olives <br\/>and feta cheese.<br\/>GARDEN SALAD LG $13 SM $8<br\/>CAESAR SALAD LG $14 SM $8<br\/>MINI FISH TACOS $13<br\/>Two Fish Tacos - fried battered Cod dressed <br\/>with tartar and coleslaw.<br\/>CRISPY CAULIFLOWER BITES $14<br\/>Crispy breaded cauliflower tossed in your <br\/>choice of sauce. <br\/>FLATBREAD PIZZA $17<br\/>Choose from Canadian, Pepperoni or Veggie.<br\/>BONELESS BITES $16<br\/>Crispy breaded chicken bites tossed in your <br\/>favourite sauce.<br\/>CHICKEN WINGS $16<br\/>A pound of crispy breaded wings served with <br\/>your favourite sauce, either on the side or tossed.<br\/>PORK RIBLETS $15<br\/>Lightly dusted bone-in pork bites. Served with <br\/>garlic dill aioli and a lemon wedge.<br\/>COCONUT SHRIMP $14<br\/>Coconut battered shrimp served with sweet and <br\/>spicy Thai sauce.<br\/>HAM &amp; CHEESE OMELET $14<br\/>Three egg omelette stuffed with cheddar <br\/>cheese and ham. Served with hashbrowns<br\/>and your choice of toast.<br\/>STEAK'N EGGS $21<br\/>6oz striploin, two eggs, hashbrowns and toast.<br\/>*Steak served medium or well*<br\/>GARLIC BREAD $6 JALAPENO POPPERS $13<br\/>CLASSIC BUFFALO CHICKEN DIP<br\/>&amp; PITA BITES<br\/>$14<br\/>SOUP OF THE DAY $8<br\/>Ask your server about today's soup.<br\/>QUESADILLA $14.50<br\/>Flour tortilla stuffed with red peppers, <br\/>mushrooms, onions and cheese.<br\/>Add grilled chicken $5.50<br\/>SUBJECT TO APPLICABLE TAXES. AVAILABLE WHILE QUANTITIES LAST. <br\/>SOME ITEMS MAY CONTAIN NUTS OR ALLERGENS.<br\/>FRENCH TOAST $12<br\/>Served with your choice of bacon, sausage<br\/>or ham.<br\/>Served daily only until 4pm!<br\/>Entr&#233;es <br\/>Desserts Sides &amp; Extras<br\/>FEATURE CHEESECAKE $12<br\/>LEMON TORTE $10<br\/>VANILLA ICE CREAM $6<br\/>APPLE PIE $8<br\/>SAUSAGE &amp; PEPPER PENNE $21<br\/>Chorizo sausage with saut&#233;ed red <br\/>pepper, onions and mushrooms on a <br\/>bed of penne tossed in marinara sauce.<br\/>LIVER &amp; ONIONS $18.50<br\/>One piece of saut&#233;ed beef liver topped with <br\/>fried onions. Best served with mashed potatoes. <br\/>Add an additional piece for $5.50<br\/>FISH &amp; CHIPS $18<br\/>Two pieces of deep fried battered cod. Served <br\/>with French fries and coleslaw.<br\/>HALF CHICKEN DINNER $23<br\/>Baked chicken brushed with your favourite <br\/>sauce. Served best with rice and vegetables.<br\/>White meat only extra $2 <br\/>QUARTER CHICKEN DINNER $18.50<br\/>*Available Thursday to Sunday after 4pm*<br\/>CHICKEN PARMIGIANA $21<br\/>Breaded chicken breast covered in marinara <br\/>sauce and cheese on top of your choice of <br\/>fettuccine or penne.<br\/>SALMON DINNER $30<br\/>6oz Lemon Pepper Salmon Fillet served with <br\/>rice and vegetables.<br\/>SEAFOOD FETTUCCINE $24<br\/>Lobster sensation, Pollock and shrimp tossed in <br\/>Alfredo sauce. Served with garlic bread.<br\/>MEATLOAF DINNER $18.50<br\/>Homemade meatloaf served along side <br\/>mashed potatoes and vegetables.<br\/>BAKED POTATO \/ MASHED POTATO\/ RICE PILAF $5<br\/>FRENCH FRIES \/ VEGETABLES $7<br\/>ONION RINGS $8<br\/>POUTINE $12<br\/>CHIPPERS WITH GARLIC AIOLI $10<br\/>GRAVY $2.50<br\/>SUBJECT TO APPLICABLE TAXES. AVAILABLE WHILE QUANTITIES LAST. <br\/>SOME ITEMS MAY CONTAIN NUTS OR ALLERGENS.<br\/>Baked Potato\/Mashed\/French Fries\/Rice\/Sub for Onion Rings, <br\/>Soup or Garden\/Caesar Salad for $3.50<br\/>10oz STRIPLOIN STEAK $34<br\/>Tender Striploin grilled to perfection. Try it with <br\/>a baked potato and vegetables.<br\/>Add saut&#233;ed mushrooms or onions for $3.50 <br\/>Add grilled shrimp for $7<br\/>FULL RACK BBQ RIBS $29<br\/>Slow roasted pork back ribs smothered in <br\/>choice of Honey garlic or BBQ sauce, served <br\/>with your choice of potato and corn.<br\/>Half Rack $20<br\/>**Available after 4PM**<br\/>PASTA &amp; MEATBALLS $16<br\/>Penne or fettuccine noodles, marinara sauce <br\/>and meatballs.<br\/>CHICKEN FETTUCCINE $18<br\/>Grilled chicken breast on a bed of fettuccine <br\/>noodles and Alfredo sauce.<br\/>Sandwiches &amp; Burgers<br\/>PHILLY CHEESE STEAK $18<br\/>Tender roast beef, Swiss cheese, saut&#233;ed <br\/>onions and red peppers served on a<br\/>pretzel hoagie.<br\/>CLASSIC FULLHOUSE CLUB $18.50<br\/>Chicken breast, cheddar cheese, mayonnaise, <br\/>bacon, tomato and lettuce on toasted white or <br\/>whole wheat bread.<br\/>SOUTHWEST CHICKEN $18.50<br\/>Crispy chicken cruncher, Monterey Jack, bacon, <br\/>jalapenos with a creamy southwest sauce.<br\/>CHICKEN CORDON BLEU $18.50<br\/>Breaded chicken, Swiss cheese, ham and mayo.<br\/>CBC WRAP $17<br\/>Chicken, bacon, cheddar cheese, lettuce, <br\/>tomato and mayo.<br\/>CHICKEN PARM SANDWICH $18.50<br\/>Breaded chicken smothered in tomato sauce <br\/>and cheese.<br\/>MEATLOAF SANDWICH $17<br\/>4oz of housemade meatloaf, fried onions and <br\/>beef gravy. Served between a grilled Kaiser.<br\/>CHICKEN FINGERS &amp; FRIES $16<br\/>Four strips of crispy breaded chicken breast. <br\/>Served with fries and plum sauce.<br\/>TACO WRAP $17<br\/>Taco meat, tomato, lettuce, black olives, <br\/>cheese and green onion served in a flour <br\/>tortilla. Served with a side of salsa and <br\/>sour cream.<br\/>VEGGIE WRAP $17<br\/>This wrap is jam-packed with lettuce, <br\/>tomato, red onion, mushrooms, black <br\/>olives, peppers, and Feta cheese. Served <br\/>with an Italian dressing.<br\/>CHICKEN CAESAR WRAP $17<br\/>Chicken, bacon, Caesar salad neatly wrapped. <br\/>SUBJECT TO APPLICABLE TAXES. AVAILABLE WHILE QUANTITIES LAST. <br\/>SOME ITEMS MAY CONTAIN NUTS OR ALLERGENS.<br\/>Sandwiches &amp; Burgers are served with a choice of one side:<br\/>French Fries\/Home Fries\/ Sub for Onion Rings, Soup or Garden\/Caesar salad $3.50<br\/>REUBEN SANDWICH $18.50<br\/>Grilled rye bread stuffed with corned beef, <br\/>Swiss cheese, sauerkraut and thousand <br\/>island dressing.<br\/>CRISPY CHICKEN BURGER $18.50<br\/>Crispy chicken breast tossed in your <br\/>choice of mild, medium, buffalo or <br\/>honey garlic sauce.<br\/>MUSHROOM SWISS $18.50<br\/>6oz Burger loaded with saut&#233;ed mushrooms <br\/>and Swiss cheese. <br\/>TEXAS HOLD'EM $18.50<br\/>Juicy 6oz beef patty, Cheddar cheese, bacon <br\/>and BBQ sauce. <br\/>BLACKJACK $18.50<br\/>Grilled all beef burger patty, Monterey Jack, <br\/>saut&#233;ed mushrooms and garlic aioli.<br\/>DILL-ICIOUS BURGER $18.50<br\/>Delicious all beef patty, Swiss cheese, bacon, <br\/>pickles and a garlic dill sauce.<br\/>All Burgers are topped with lettuce, <br\/>tomato and onion.<br\/>Vegetarian option available.<br\/>CHANGE UP YOUR SIDE FOR AN<br\/>EXTRA $5<br\/>Poutine<br\/>Chippers &amp; Garlic Aioli<br\/>STEAK SANDWICH $23<br\/>Grilled striploin, saut&#233;ed onions and <br\/>mushrooms on a panini. YUMMY!<br\/>*Steak served medium or well*",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "name": "Getaway Restaurant (Inside The Casino)"
}