{
"name" : "Cliffhanger Restaurant & Bar (Inside The Norwester Hotel)", 
"link" : "https://www.bwplusnorwester.com/restaurant-and-bar", 
"hours" : "(Sunday - Saturday: 07:00 - 21:00)", 
"tel" : "807-473-2452", 
"sms" : "", 
"address" : "2080 Highway 61 (Inside The Norwester Hotel)", 
"map" : "https://maps.app.goo.gl/XN9pvxAuLrac1gMY7", 
"updated" : "2025-10-16", 
"courtesy" : "Justin Menu",
"text" : "Here is the transcription of the Cliffhanger Restaurant & Bar menu, adhering to your preference for British/standardised spelling and avoiding simplified conventions.
<br>
<br>BREAKFAST
<br>Available until 12pm
<br>
<br>Gluten Free Substitutions: Gluten Free Roasted Baby Potatoes $2.00 | Gluten Free Bread $2.00 Vegetarian Options (V)
<br>
<br>CHEESE OMELETTE | $14 (V) Mixed cheeses. Served with home fries and your choice of toast
<br>
<br>DENVER OMELETTE | $15 Ham, peppers, green onions, and mixed cheese. Served with home fries and your choice of toast
<br>
<br>CLIFFHANGER SCRAMBLER | $18 Scrambled eggs, chopped ham and sausage, peppers, and green onions on home fries with cheese and Hollandaise sauce. Served with your choice of toast
<br>
<br>GREEK OMELETTE | $15 (V) Peppers, onions, black olives, tomato, mixed cheeses, topped with feta cheese. Served with home fries and your choice of toast
<br>
<br>COUNTRY BREAKFAST | $16 Two eggs any style, served with bacon or sausage. Served with home fries and your choice of toast
<br>
<br>BUTTER MILK PANCAKES | $14 3 large pancakes with bacon or sausages
<br>
<br>RAISIN CINNAMON FRENCH TOAST | $15 3 slices of Raisin Cinnamon French toast, with your choice of bacon or sausage
<br>
<br>BREAKFAST BURRITO | $16 Eggs, peppers, ham, green onions, Pico de Gallo, and mixed cheese wrapped in a tortilla shell. Served with salsa and home fries
<br>
<br>EGGS BENEDICT | $17 Two poached eggs, Canadian back bacon, on a toasted English muffin, smothered in creamy Hollandaise sauce, served with home fries
<br>
<br>TOMATO EGGS BENEDICT | $15 (V) Two poached eggs, tomato, on a toasted English muffin, smothered in creamy Hollandaise sauce, served with home fries
<br>
<br>CLIFFHANGER BREAKFAST SANDWICH | $14 One egg with bacon or sausage, melted cheddar cheese on a toasted English muffin, with a fruit cup or home fries
<br>
<br>LIGHT BREAKFAST | $9 One egg any style, served with bacon or sausage, home fries, and toast
<br>
<br>SIDE ORDERS Toasted English muffin $3 / Fruit cup $6 / Choice of toast (2) $4 / Bacon (4) $5 / Sausage (4) $5
<br>
<br>LIGHT OPTIONS | $6 (V) Cold cereal with 2% milk (4 oz) or Hot Oatmeal with 2% milk (4 oz)
<br>
<br>APPETISERS
<br>Pickerel Sticks - $15 Pickerel sticks crusted with a panko and dill breading and fried to golden-brown. Served with tartar sauce
<br>
<br>Chicken Wings - 1lb $16 | 2lb $28 Cliffhanger crispy chicken wings prepared with your choice of sauce: mild, medium, Frank's Red Hot, salt and pepper, dry Cajun, honey garlic, served with carrot, celery sticks, and ranch dressing
<br>
<br>Onion Rings - $10 A basket of deep-fried onion rings served with ranch dressing
<br>
<br>Just Fries - $9 Sweet potato fries served with Cajun lime dip or French fries served with ranch dressing
<br>
<br>Snacker Platter - $25 Assortment of dry Cajun ribs, spring rolls, wings, onion rings, and mozzarella sticks
<br>
<br>Nachos - $20 Baked corn chips topped with pub mixed cheese, bacon, banana peppers, green onions, and pico de gallo. Served with salsa and sour cream. Add: Grilled Chicken - $4 | Taco Beef - $4 | Guacamole - $4
<br>
<br>Fish or Grilled Chicken Tacos - $15 Soft tacos with your choice of panko breaded pickerel or grilled chicken breast. Served with coleslaw, pico de gallo, and roasted garlic mayo
<br>
<br>Dry Ribs - $16 Pound of Cajun dusted dry ribs fried served with Cajun mayo
<br>
<br>Cliffhanger Poutine - $16 French fries, mozzarella cheese curds, apple-wood smoked bacon, green onions and smothered in house-made gravy
<br>
<br>Chicken Strips - $15 Four tender strips of chicken served with plum sauce or ranch dressing. Add: French Fries $2
<br>
<br>Breaded Shrimp (6pc) - $16 Golden Fried Jumbo Shrimp with cocktail sauce and Lemon
<br>
<br>SOUPS
<br>Cliffhanger Feature Soup - Cup $4 | Bowl $6 Made fresh daily
<br>
<br>French Onion Soup - $9 Caramelised onions with a rich beef broth, baked with croutons and Swiss cheese.
<br>
<br>SALADS
<br>Available Dressings: House, Ranch, Balsamic, Italian, French, Thousand Island, Blue Cheese, or Raspberry Vinaigrette
<br>
<br>Caesar Salad - Half $9 | Full $16 Romaine lettuce tossed with bacon bits, parmesan cheese, croutons and tossed in our zesty Caesar dressing
<br>
<br>Cobb Salad - $18 Garden greens, topped with chicken strips, boiled egg, guacamole, carrots, bacon bits, grape tomato, cheddar cheese and served with blue cheese dressing
<br>
<br>Steak & Goat Cheese - $20 Mixed greens, peppers, cucumber, grape tomatoes, and red onions, topped with a grilled 4oz AAA steak, goat cheese, and served with balsamic dressing
<br>
<br>Taco Salad - $20 Mixed greens with pico de gallo, taco beef, shredded cheddar cheese, sautéed chicken breast and peppers, sour cream, guacamole, salsa, and served with tortilla chips
<br>
<br>Mixed Greens - Half $8 | Full $14 Mixed greens with red onions, tomatoes, cucumber, peppers, and carrots
<br>
<br>Hot Chicken Caesar - $20 Our own caesar salad with Cajun sautéed bell peppers, red onion, and grilled chicken breast
<br>
<br>Greek Salad - Half $12 | Full $18 Romaine lettuce with cucumbers, red onions, tomatoes, peppers, feta cheese, kalamata olives
<br>
<br>SANDWICHES & MORE
<br>Choice of: French fries, Soup, Mixed garden salad, or Caesar salad
<br>
<br>Philly Prime Rib Dip - $20 Grilled shaved prime rib, onions, peppers, and mushrooms, finished with melted Swiss cheese. Served with au jus on brioche bun
<br>
<br>Grilled Reuben - $18 Shaved corned beef with sauerkraut, Swiss cheese and thousand island dressing on rye bread and grilled
<br>
<br>Grilled Quesadilla - $18 A tortilla shell loaded with grilled roasted chicken, or taco beef, pico de gallo, mixed cheese, sautéed peppers and green onions
<br>
<br>Beer Battered Haddock Fillets - 2pcs $18 | 3pcs $22 Two pieces of haddock drenched in a Sleeping Giant Northern Logger beer batter, and deep fried, served with coleslaw, lemon and tartar sauce
<br>
<br>Cliffhanger Burger - $20 6 oz Char broiled AAA patty, served with apple-wood smoked bacon, cheddar cheese, lettuce and tomato, topped with onion rings
<br>
<br>Cliffhanger Club - $18 Club sandwich with apple-wood smoked bacon, lettuce, tomato, cheddar cheese, roasted turkey, cranberry mayo
<br>
<br>Hot Turkey - $18 Open-faced sandwich with oven roasted turkey, and house made gravy on your choice of bread
<br>
<br>Spicy Chicken Wrap - $16 Chicken strips deep fried until golden brown, tossed in Frank's Red hot sauce and Ranch dressing served with lettuce, tomatoes, banana peppers, green onions and shredded mixed cheese
<br>
<br>Guacamole Veggie Wrap - $16 Spring mix, tomatoes, shredded carrots, peppers, sliced black olives, shredded mixed cheese & guacamole
<br>
<br>Bison Burger - $23 Grilled 6oz Bison patty, topped with cheddar cheese, sautéed onions and mushrooms and BBQ sauce
<br>
<br>AFTER 5PM
<br>Butter Chicken - $26 Grilled marinated chicken breast topped with a creamy Butter chicken sauce served with mixed wild rice and vegetables
<br>
<br>BBQ Back Ribs - $30 Slow roasted, tender pork back ribs, grilled with your choice of BBQ or honey garlic sauce. Served with fries & coleslaw
<br>
<br>Chicken or Shrimp Alfredo - $26 Choice of fresh fettuccini or rigatoni pasta in a creamy garlic-parmesan sauce grilled chicken breast strips or sautéed shrimp, topped with Parmesan cheese. Served with garlic bread
<br>
<br>Ribeye Steak - $54 12oz AAA Ribeye steak done to your liking served with creamy peppercorn brandy sauce, fries, and vegetables
<br>
<br>Grilled Beef Liver and Onions - $24 Grilled dusted beef liver topped with onion mushroom gravy served fries and vegetables
<br>
<br>Pickerel - $30 Pickerel fillet tossed in herbed flour and pan-seared. Served with mixed wild rice and vegetables.
<br>
<br>Braised Beef Short Ribs - $48 10 oz braised short ribs in rich red wine sauce served with fries and vegetables
<br>
<br>Pasta and Meatballs - $20 Choice of fettuccini or rigatoni pasta, five meatballs tossed with a rich tomato sauce, and topped with grated parmesan cheese. Served with garlic bread
<br>
<br>Chicken Parmesan - $28 Choice of fettuccini or rigatoni pasta breaded baked chicken with a light tomato sauce topped with Swiss cheese and baked to perfection. Served with garlic bread
<br>
<br>8 oz New York Steak - $34 8 oz of AAA New York steak grilled to your liking, with a blend of spices & seared over high heat to lock in the natural flavours. Served with creamy, peppercorn brandy sauce, fries, and vegetables
<br>
<br>Add On's Jumbo Breaded Shrimp (4pcs) - $10 Garlic Bread (2pcs) - $4
<br>
<br>PIZZAS
<br>Pepperoni & Cheese Pizza - $19 Topped with marinara sauce, sliced smoked pepperoni and a mixed cheese
<br>
<br>Mediterranean Pizza - $22 Marinara sauce, sliced peppers, onions, sliced mushrooms, artichoke, olives, mixed cheese, topped with feta cheese
<br>
<br>Steak & Goat Cheese Pizza - $24 pizza topped with marinara sauce, mixed cheese, sautéed peppers, mushrooms, onions, and grilled steak slices, finished with goat cheese and balsamic glaze
<br>
<br>Deluxe Pizza - $22 Banana Peppers, mushrooms, onions, olives, bacon bits and sliced pepperoni, topped with mixed cheese
<br>
<br>BEVERAGES
<br>Cup of Coffee/ Orange Pekoe Tea - $3.00 Fresh ground regular or decaf coffee
<br>
<br>Herbal Tea - $3.50 Selected flavours from our tea chest
<br>
<br>Skim, 2%, or Chocolate Milk - Small $2.50 | Large $3.50
<br>
<br>Fruit Juices, Iced Tea or Lemonade - Small $2.50 | Large $3.50 Orange, Cranberry, Apple, Clamato, Tomato, and Grapefruit
<br>
<br>Soft Drinks - $3.00 Pepsi, Diet Pepsi, 7-UP, or Ginger Ale
<br>
<br>Hot Chocolate - $3.50 Served with whipped cream
"
}