{
    "link": "",
    "hours": "",
    "tel": "tel: 807-346-4440",
    "sms": "",
    "address": "Address: 28 Cumberland Street South",
    "map": "https:\/\/maps.app.goo.gl\/qmuY3wX7MawdwSHH9",
    "updated": "Updated: 2024-11-03",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Detroit Style Pizza<br\/>EZZO: SM $16 \/ LG $23<br\/><br\/>Mozzarella, Ezzo Pepperoni, Sauce.<br\/><br\/>Extra Pep! +$3 | + Jalapeno &amp; Hot Honey: $2.50<br\/><br\/>Add Basil Pesto: $1.50<br\/><br\/>CHEESEBURGER: SM $18 \/ LG $26<br\/><br\/>Mozzarella\/Cheddar, Beef, Shredded Lettuce, Pickles, Sesame Seeds, Special Sauce.<br\/><br\/>CARNITAS: SM $18 \/ LG $26<br\/><br\/>Mozzarella, Shredded Pork, Cilantro Pesto, Chipotle Mayo, Pickled Onions, Feta.<br\/><br\/>PEROGIE: SM $18 \/ LG $26<br\/><br\/>Caramelized Onion\/Cheese Sauce, Mozza\/Cheddar, Potato\/Onion, Bacon, Sour Cream, Chives.<br\/><br\/>MARGHERITA: SM $15 \/ LG $22<br\/><br\/>Mozzarella, Sauce, Basil Pesto.<br\/><br\/>SAUSAGE &amp; RAPINI 2.0: SM $18 \/ LG $26<br\/><br\/>Garlic Butter, Mozzarella, Italian Sausage, Rapini, Butter Parmesan Sauce, Grated Parm.<br\/><br\/>MUSHROOM: SM $18 \/ LG $26<br\/><br\/>Caramelized Onion, Mushroom Bechamel, Mozzarella, Goat Cheese, Roasted Mushroom\/Onion, Pickled Onions, Chives.<br\/><br\/>HAWAIIAN: SM $18 \/ LG $26<br\/><br\/>Mozzarella\/Cheddar, Diced Ham, Compressed Pineapple, Sauce, Ranch.<br\/><br\/>Jalapeno &amp; Hot Honey: $2.50<br\/><br\/>SUPREME: SM $17 \/ LG $25<br\/><br\/>Mozzarella, House Sausage, Pepperoni, Roasted Mushrooms &amp; Onion, Green Pepper, Sauce.<br\/><br\/>SUBBY MEAT LOVERS: SM $18 \/ LG $26<br\/><br\/>Mozzarella, Ground Beef, Sausage, Pepperoni, Spicy Calabrese, Sauce.<br\/><br\/>BUFFALO FRIED CHICKEN: SM $18 \/ LG $26<br\/><br\/>Mozzarella\/Cheddar, Fried Chicken, Bacon, Buffalo Sauce, Blue Cheese Dressing, Green Onion.<br\/><br\/>CHICKEN SHAWARMA: SM $18 \/ LG $26<br\/><br\/>Moza, Grilled Chicken Thighs, Blistered Tomatoes, Sriracha, Red Onion w\/Sumac &amp; Lemon, Pickles, Garlic Sauce.<br\/><br\/>DILL PICKLE: SM $18 \/ LG $26<br\/><br\/>Mozzarella\/Cheddar, Bacon, Dill Pickle Relish, Heartbeat Dill Pickle Aioli, Crispy Onions, Herbs.<br\/><br\/>VEGGIE: SM $17 \/ LG $25<br\/><br\/>Mozzarella\/Fontina, Spicy Pickled Eggplant, Kalamata Olives, Artichoke Hearts, Roasted Mushrooms, Roasted Red Peppers, Fried Basil, Chili Oil.<br\/><br\/>Subs (Until 10 PM)<br\/>ROASTED CHICKEN BLT: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Roasted Chicken, Bacon, Cajun BBQ Sauce, Chipotle Mayo, Pickled Onion, Tomato, Iceberg Lettuce.<br\/><br\/>BEEF &amp; RINGS: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Shaved Beef, Mushrooms, Steak Spice Mayo, Onion Rings, Balsamic Tomatoes, Arugula.<br\/><br\/>CHICKEN CAESAR: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Grilled Chicken Thighs, Mozzarella, Bacon, Caesar Dressing, Iceberg Lettuce.<br\/><br\/>PIZZA: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Pepperoni, Mozzarella, Garlic Aioli, Pizza Sauce, Arugula.<br\/><br\/>LOAD IT FOR 25: Peppers, Onions, Olives, Banana Peppers.<br\/><br\/>ITALIAN: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Mortadella, Ham, Genoa, Provolone, Mozzarella, Tomato, Iceberg Lettuce, Pickled Onion, Mayo, Mustard, Sub Sauce.<br\/><br\/>KOREAN BBQ PORK: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Pork Belly, Onion, Pickled Onions, Cucumber, Sriracha Mayo, Sesame Seeds.<br\/><br\/>KOREAN BBQ TOFU: 6&quot; $11 \/ 12&quot; $16<br\/><br\/>Tofu, Onion, Pickled Onions, Cucumber, Sriracha Mayo, Sesame Seeds.<br\/><br\/>Snacks<br\/>Chicken Wings Breaded or Unbreaded, Your Choice of Dip<br\/><br\/>5 pcs: $9 | 10 pcs: $15 | 20 pcs: $27 | 30 pcs: $39<br\/><br\/>Flavors: Buffalo, Dry Cajun, Cajun BBQ, Salt &amp; Pepper, Nashville Dry Rub, Spicy Dill Pickle, Honey Garlic, Lemon Pepper Wet, Jerk, Hot, House Hot<br\/><br\/>Cauliflower &quot;Wings&quot;: $12 Fried cauliflower, tossed in your choice of wing sauce. Served with your choice of dip<br\/><br\/>Chicken Tenders: $13 Buttermilk fried chicken tenders. Served with your choice dipping sauce<br\/><br\/>Deep Fried Pickles: $11 Deep fried pickle chips. Served with ranch<br\/><br\/>Falafel: $13 Chickpea falafel, dill and tahini yogurt, marinated cucumber, pickled beets, feta<br\/><br\/>Potato Wedges: $11 Duck fat house rub, jalapeno queso<br\/><br\/>Fried Chicken: $13 Boneless buttermilk fried chicken with honey or hot honey. Served with chipotle mayo<br\/><br\/>Mozza Sticks: $11 Housemade mozza sticks. Served with pizza sauce<br\/><br\/>Coconut Fried Rice: $13 Coconut rice balls, curry sauce, coconut cream, pineapple salsa, toasted coconut<br\/><br\/>Onion Rings: $13 Panko\/sesame seed breaded onion rings. Served with malt vinegar mayo<br\/><br\/>Pork &amp; Beans: $13 Pork belly, baked beans, charred scallion cream, tomato salsa, crispy onions<br\/><br\/>Cheesy Garlic Bread: $13 Small pan | Garlic butter, mozzarella, cheddar served with pizza sauce<br\/><br\/>Popper Bread 2.0: $14 Small pan | Cream cheese base, mozzarella, cheddar, jalapeno, cheddar curds, ranch, chives<br\/><br\/>Housemade Dips: $1.50 each Garlic parmesan, ranch, blue cheese, chipotle mayo, cajun BBQ, buffalo, malt vinegar mayo aioli, honey mustard<br\/><br\/>Salads (Until 10 PM)<br\/>Caesar: $12 Romaine, bacon, croutons, lemon wedge, parmesan, Caesar dressing<br\/><br\/>Greek: $11 Mixed greens, cucumber, red onion, tomato, kalamata olives, feta, Greek dressing<br\/><br\/>Beet: $13 Arugula, beets, candied walnuts, pickled onions, goat cheese, honey mustard vinaigrette<br\/><br\/>Calabria: $11 Mixed greens, tomatoes, cucumber, pickled red onions, croutons, feta, pepperoncini, Calabria dressing<br\/><br\/>Chipotle Chicken: $15 Mixed greens, shredded chicken, cheddar, bacon, cucumber, cherry tomatoes, red onion, croutons, chipotle dressing<br\/><br\/>Desserts<br\/>Pumpkin Cheesecake: $7<br\/><br\/>Orange Fritters: $7<br\/><br\/>Espresso Cookie: $3",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "name": "Tomlin Subdivision"
}