{
"name" : "Eddy Lee's Chinese Restaurant",
"status" : "",
"link" : "https://www.eddylees.com/", 
"hours" : "(Sunday: 15:00 - 21:30), (Monday - Friday: 11:30 - 21:30), (Saturday: 15:00 - 21:30)", 
"tel" : "807-767-2181", 
"sms": "", 
"address" : "863 Red River Road", 
"map": "https://maps.app.goo.gl/DeuEBHvAkr2oAGo5A", 
"updated" : "2025-10-06", 
"courtesy" : "Justin Menu", 
"text" : "Dinner Menu
<br>Available from 11:30am - 9:30pm- Tuesday to Friday
<br>Available from 3:00 Pm - 9:30 Pm - Saturday and Sunday
<br>Family Dinners
<br>Dinner For Two
<br>2 Egg Rolls, Chicken Fried Rice, S&S Chicken Balls(8), and Beef Chop Suey.
<br>$49.50
<br>Dinner For Three
<br>3 Egg Rolls, Chicken Fried Rice, S&S Chicken Balls(12), S&S Spareribs(13), and Beef Chop Suey with a bag of fried noodles ( Called beef chow mein)
<br>$68.10
<br>Dinner For Four
<br>4 Egg Rolls, Chicken Fried Rice, S&S Chicken Balls(14), BonBon Spareribs(14), and Beef & Mixed Greens.
<br>$92.34
<br>Dinner For Five
<br>5 Egg Rolls, BBQ Pork Fried Rice, S&S Chicken Balls(15), S&S Shrimp(15), Beef & Mixed Greens, Garlic Spareribs, .
<br>$110.7
<br>Dinner For Six
<br>6 Egg rolls, S&S Chicken Balls(16), S&S Shrimps(16), Bon Bon Spareribs(14), Beef & Mixed Greens, Honey Garlic Spareribs, & Special Fried Rice.
<br>$135.54
<br>Daily Specials
<br>(1 Egg roll, chicken fried rice and 1 of the following)
<br>Daily BonBon (5 Pieces)
<br>Indulge in our signature BonBon(5), accompanied by a crispy egg roll filled with savory ingredients and a side of flavorful chicken fried rice, this dish offers a delightful combination of textures and flavors that will satisfy your cravings.
<br>$17.70
<br>Daily S&S Wontons (8 Pieces)
<br>Dive into our savory and tangy Sweet and Sour Wontons(8), featuring crispy wonton wrappers filled with a flavorful meat mixture. Served with a delicious sweet and sour sauce, and paired with a crispy egg roll and a side of aromatic chicken fried rice, this dish offers a satisfying meal that is sure to please your palate.
<br>$17.70
<br>Daily S&S Chicken Balls
<br>Enjoy the classic combination of succulent chicken balls enveloped in a tangy sweet and sour sauce. Paired with a crispy egg roll and a side of flavorful chicken fried rice, this dish offers a perfect balance of flavors and textures that will leave you craving for more.
<br>$17.70
<br>Daily S&S Spareribs (6 Pieces)
<br>Indulge in our succulent Sweet and Sour Spareribs, crispy egg roll (1) and a flavourful chicken fried rice making it a favorite choice for appetizers or as part of a satisfying meal.
<br>$17.70
<br>Combination Dinners
<br>1. Chicken Fried Rice, Sweet-and-Sour Chicken Balls (4 Pieces), and Chicken Chop Suey
<br>Savor the perfect trifecta of Chinese flavors with our combination dinner featuring Chicken Fried Rice, S&S Chicken Balls (4 pieces), and Chicken Chop Suey. Enjoy the comforting familiarity of fluffy rice stir-fried with tender chicken, complemented by the irresistible crunch of our sweet and sour chicken balls. Complete your meal with the classic Chicken Chop Suey, a symphony of tender chicken and vibrant vegetables in a savory sauce. Experience the essence of Chinese cuisine in every delectable bite.
<br>$23.10
<br>2. Chicken Fried Rice, Bon Bon Spareribs (5 pieces) with 1 piece of lemon , and Chicken Chop Suey.
<br>Treat yourself to an exquisite combination dinner featuring Chicken Fried Rice, Bon Bon Spareribs (5 pieces) served with a slice of zesty lemon, and Chicken Chop Suey. Dive into the comforting flavors of fluffy rice stir-fried with tender chicken, accompanied by succulent spare ribs coated in a crispy batter and a tangy sauce. Pair it with the classic Chicken Chop Suey, a delightful medley of tender chicken and crisp vegetables in a savory sauce. Experience the perfect harmony of textures and tastes in every mouthful.
<br>$23.94
<br>3. Chicken Fried Rice, Sweet-and-Sour Spareribs (6 pieces), and Beef and Beef Mixed Greens
<br>Indulge in a tantalizing combination dinner featuring Chicken Fried Rice, Sweet-and-Sour Spareribs (6 pieces), and Beef Mixed Greens. Dive into the delightful flavors of fluffy rice stir-fried with succulent chicken, paired perfectly with the tangy sweetness of our tender spareribs. Complete your meal with the savory goodness of beef slices cooked with an assortment of fresh greens, creating a mouthwatering fusion of textures and tastes. Experience the essence of authentic Chinese cuisine in every satisfying bite.
<br>$23.10
<br>4. Chicken Fried Rice, Bon Bon Spareribs (5 pieces) with 1 piece of lemon and Sweet-and-Sour Chicken Balls (4 pieces)
<br>Delight your taste buds with our tantalizing combination dinner featuring Chicken Fried Rice, Bon Bon Spareribs (5 pieces) served with a refreshing slice of lemon, and Sweet-and-Sour Chicken Balls (4 pieces). Enjoy the comforting blend of fluffy rice stir-fried with tender chicken, perfectly complemented by the crispy sweetness of our spareribs enhanced with a zesty lemon twist. Indulge in the succulent chicken meatballs enveloped in a delectable sweet-and-sour sauce, creating a harmonious balance of flavors that will leave you craving for more. Experience the essence of authentic Chinese cuisine with this unforgettable dining experience.
<br>$23.94
<br>5. Chicken Fried Rice, Sweet-and-Sour Chicken Balls (4 pieces) and Beef Mixed Greens
<br>Treat yourself to a delightful combination dinner featuring Chicken Fried Rice, Sweet-and-Sour Chicken Balls (4 pieces), and Beef Mixed Greens. Dive into the savory flavors of fluffy rice stir-fried with tender chicken, perfectly paired with the irresistible sweetness of our succulent chicken meatballs in a tangy sauce. Complete your meal with the savory goodness of tender beef slices cooked with an assortment of fresh greens, offering a satisfying blend of textures and tastes. Experience the essence of authentic Chinese cuisine in every mouthwatering bite.
<br>$23.10
<br>6. Chicken Fried Rice, Bon Bon Spareribs (5 pieces) with 1 piece of lemon, and Beef Mixed Greens
<br>Indulge in a savory combination dinner featuring Chicken Fried Rice, Bon Bon Spareribs (5 pieces) accompanied by a zesty slice of lemon, and Beef Mixed Greens. Dive into the comforting flavors of fluffy rice stir-fried with tender chicken, perfectly complemented by the succulent Bon Bon Spareribs enhanced with a hint of citrus. Complete your meal with the savory goodness of tender beef slices cooked with a medley of fresh greens, offering a delightful harmony of textures and tastes. Experience the authentic essence of Chinese cuisine in every satisfying bite.
<br>$23.94
<br>7. Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Chicken Chop Suey.
<br>Savor the delightful flavors of our combination dinner featuring Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Chicken Chop Suey. Enjoy the comforting embrace of fluffy rice stir-fried with tender chicken, perfectly complemented by the succulent sweetness of our shrimp in a tangy sauce. Complete your meal with the classic Chicken Chop Suey, a medley of tender chicken and crisp vegetables stir-fried to perfection. Experience the irresistible blend of textures and tastes in every mouthwatering bite, capturing the essence of authentic Chinese cuisine.
<br>$23.94
<br>8. Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Sweet-and-Sour Chicken Balls (4 pieces).
<br>Indulge in a delightful combination dinner featuring Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Sweet-and-Sour Chicken Balls (4 pieces). Dive into the savory goodness of fluffy rice stir-fried with tender chicken, perfectly complemented by the succulent sweetness of our shrimp and chicken meatballs in a tangy sauce. Experience the perfect harmony of flavors and textures in every mouthwatering bite, capturing the essence of authentic Chinese cuisine.
<br>$23.94
<br>9. Chicken Fried Rice, Sweet-and-Sour Shrimp(4 pieces), and Bon Bon Spareribs (5 pieces) with 1 piece of lemon.
<br>Experience a tantalizing combination dinner with our Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Bon Bon Spareribs (5 pieces) accompanied by a refreshing slice of lemon. Delight in the savory blend of fluffy rice stir-fried with tender chicken, complemented by the succulent sweetness of our shrimp and the crispy perfection of our spareribs coated in a tangy sauce. Each bite is a symphony of flavors, offering a delectable journey through authentic Chinese cuisine.
<br>$23.94
<br>10. Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces) and Beef Mixed Greens
<br>Indulge in a delightful combination dinner featuring Chicken Fried Rice, Sweet-and-Sour Shrimp (4 pieces), and Beef Mixed Greens. Dive into the savory flavors of fluffy rice stir-fried with tender chicken, perfectly complemented by the succulent sweetness of our shrimp. Complete your meal with the savory goodness of tender beef slices cooked with a medley of fresh greens, offering a delightful harmony of textures and tastes. Experience the authentic essence of Chinese cuisine in every satisfying bite.
<br>$23.94
<br>11. Chicken Fried Rice, Garlic Spareribs, and Chicken Chop Suey
<br>Experience a savory combination dinner with our Chicken Fried Rice, Garlic Spareribs, and Chicken Chop Suey. Dive into the comforting flavors of fluffy rice stir-fried with tender chicken, perfectly paired with the aromatic garlic-infused spare ribs. Complete your meal with the classic Chicken Chop Suey, a medley of tender chicken and crunchy vegetables stir-fried to perfection. Each bite is a delightful blend of textures and flavors, capturing the essence of authentic Chinese cuisine.
<br>$22.74
<br>12. Chicken Fried Rice, Garlic Spareribs, and Sweet-and-Sour Chicken Balls (4 pieces).
<br>Savor the delectable flavors of our combination dinner featuring Chicken Fried Rice, Garlic Spareribs, and Sweet-and-Sour Chicken Balls (4 pieces). Enjoy the comforting blend of fluffy rice stir-fried with tender chicken, perfectly complemented by the savory aroma of garlic-infused spare ribs. Indulge in the succulent sweetness of our chicken meatballs enveloped in a tangy sauce, offering a delightful balance of flavors and textures. Experience the irresistible harmony of authentic Chinese cuisine in every satisfying bite.
<br>$23.10
<br>13. Chicken Fried Rice, Garlic Spareribs, and Beef Mixed Greens
<br>Experience a savory symphony of flavors with our combination dinner featuring Chicken Fried Rice, Garlic Spareribs, and Beef Mixed Greens. Dive into the comforting embrace of fluffy rice stir-fried with tender chicken, perfectly paired with the aromatic essence of garlic-infused spare ribs. Complete your meal with the savory goodness of tender beef slices cooked with a medley of fresh greens, offering a delightful harmony of textures and tastes. Each bite is a culinary delight, capturing the essence of authentic Chinese cuisine in every mouthwatering bite.
<br>$22.74
<br>14. Chicken Fried Rice, Garlic Spareribs, and Bon Bon Spareribs (5 pieces) with 1 piece of lemon.
<br>Indulge in a flavorful combination dinner featuring Chicken Fried Rice, Garlic Spareribs, and Bon Bon Spareribs (5 pieces) served with a refreshing slice of lemon. Delight in the comforting blend of fluffy rice stir-fried with tender chicken, perfectly complemented by the savory aroma of garlic-infused spare ribs. Enhance your dining experience with the crispy perfection of our Bon Bon Spareribs, coated in a delectable sauce, and accompanied by a zesty citrus twist. Experience the irresistible harmony of flavors and textures, capturing the essence of authentic Chinese cuisine in every satisfying bite.
<br>$23.94
<br>15. Chicken Fried Rice, Garlic Spareribs, and Sweet & Sour Shrimp (4 pieces).
<br>Delight in a tantalizing combination dinner featuring Chicken Fried Rice, Garlic Spareribs, and Sweet & Sour Shrimp (4 pieces). Dive into the savory flavors of fluffy rice stir-fried with tender chicken, perfectly complemented by the aromatic essence of garlic-infused spare ribs. Indulge your taste buds with succulent shrimp coated in a sweet and tangy sauce, offering a delightful balance of flavors and textures. Experience the irresistible harmony of authentic Chinese cuisine in every mouthwatering bite.
<br>$23.94
<br>16. Chicken Fried Rice, Beef Mixed Greens, and Honey Garlic Spareribs
<br>Experience a delicious combination dinner featuring Chicken Fried Rice, Beef Mixed Greens, and Honey Garlic Spareribs. Dive into the savory flavors of fluffy rice stir-fried with tender chicken, perfectly complemented by the savory goodness of beef slices cooked with a medley of fresh greens. Complete your meal with the irresistible sweetness of our honey garlic spare ribs, offering a delightful blend of flavors and textures. Indulge in the essence of authentic Chinese cuisine with every satisfying bite.
<br>$22.74
<br>17. Chicken Fried Rice, Chicken Chop Suey, and Honey Garlic Spareribs with sesame seed on top.
<br>Savor the exquisite flavors of our combination dinner featuring Chicken Fried Rice, Chicken Chop Suey, and Honey Garlic Spareribs topped with sesame seeds. Delight in the comforting blend of fluffy rice stir-fried with tender chicken, perfectly complemented by the classic Chicken Chop Suey, a medley of crunchy vegetables and succulent chicken in a savory sauce. Enhance your dining experience with the irresistible sweetness of our honey garlic spare ribs, adorned with sesame seeds for an added crunch. Experience the essence of authentic Chinese cuisine with every flavorful bite.
<br>$22.74
<br>Side Orders
<br>Egg Roll
<br>Indulge in the savory flavors of a classic Egg Roll filled with a tantalizing mixture of seasoned pork, aromatic curry, crunchy napa cabbage, crisp bean sprouts, aromatic celery, jumbo onions, and shredded cabbage. Wrapped in a crispy egg roll wrapper and deep-fried to perfection, this appetizer offers a perfect blend of textures and flavors.
<br>$4.74
<br>Spring Roll (2 Pieces)
<br>Enjoy the freshness of a Spring Roll filled with a delightful combination of seasoned pork, shredded carrots, crisp cabbage, delicate vermicelli noodles, and jumbo onions. Encased in a thin and crispy wrapper, these spring rolls are perfect for dipping into your favorite sauce for a burst of flavor. Comes with a choice of plum sauce, fish sauce or hot sauce.
<br>$9.30
<br>Steamed Rice
<br>Steam Rice, a staple in Asian cuisine, offers a fluffy and aromatic accompaniment to your meal. Served hot and fresh, it provides a neutral base that complements the flavors of your main dishes and sauces.
<br>$5.70
<br>Fried Noodles
<br>Enjoy the crispy and satisfying crunch of Fried Noodles, made from thin egg noodles stir-fried to perfection. These noodles offer a delightful texture and flavor that pairs well with any main dish.
<br>$3.00
<br>Soft Noodles
<br>Soft Noodles, also known as lo mein noodles, are thick and chewy noodles that provide a hearty base for your favorite stir-fries or noodle dishes. Cooked to perfection and tossed with savory sauces and fresh vegetables, they offer a satisfying and comforting meal option.
<br>$3.90
<br>French Fries
<br>Savor the crispy and golden-brown goodness of French Fries, made from fresh potatoes cut into thin strips and deep-fried to perfection. Seasoned to perfection and served hot, they offer a satisfying crunch and delicious flavor that pairs well with any meal.
<br>$8.10
<br>Sliced BBQ Pork
<br>Treat yourself to tender slices of BBQ Pork, also known as Char Siu, marinated in a flavorful blend of soy sauce and Chinese spices before being roasted to perfection. Served sliced and often garnished with fresh green onions, they offer a delicious savory taste sensation.
<br>$9.90
<br>Broth
<br>Savor the rich and aromatic flavors of Broth, made by simmering vegetables, meat, or bones in water along with aromatic herbs and spices. Served hot, it offers a comforting and nourishing base for soups and other dishes.
<br>$5.10
<br>Whole Lemon (6 pieces)
<br>Add a burst of citrusy freshness to your dishes with Whole Lemons, perfect for garnishing seafood dishes, salads, or beverages. Fresh and tangy, they offer a vibrant flavor that enhances the taste of your favorite dishes.
<br>$5.70
<br>Sweet-and-Sour Sauce
<br>Enjoy ample servings of Sweet & Sour Sauce with a medium-sized portion, perfect for dipping or drizzling over your favorite dishes. Its bold and flavorful profile adds a delicious touch to appetizers, main courses, and more.
<br>Small
<br>$4.50
<br>Medium
<br>$5.10
<br>Large
<br>$6.90
<br>Fried Rice
<br>Chicken Fried Rice
<br>A flavorful dish featuring tender pieces of chicken stir-fried with fluffy rice, savory eggs, and crisp celery, seasoned to perfection. This Chicken Fried Rice offers a satisfying blend of protein and vegetables, ideal for a quick and delicious meal.
<br>Small
<br>$12.30
<br>Large
<br>$15.30
<br>Beef Fried Rice
<br>Succulent beef slices stir-fried with fluffy rice, savory eggs, and crisp celery, creating a delicious and satisfying dish. This Beef Fried Rice offers a savory blend of protein and vegetables, perfect for those craving a hearty meal.
<br>Small
<br>$13.14
<br>Large
<br>$15.54
<br>BBQ Pork Fried Rice
<br>Juicy BBQ pork pieces stir-fried with fluffy rice, savory eggs, and crisp celery, creating a delightful fusion of flavors. This BBQ Pork Fried Rice offers a sweet and savory taste sensation, perfect for those seeking a delicious and satisfying meal option.
<br>Small
<br>$12.30
<br>Large
<br>$15.30
<br>Mushroom Fried Rice
<br>A flavorful dish featuring earthy mushrooms stir-fried with fluffy rice, savory eggs, and crisp celery, creating a delightful vegetarian option. This Mushroom Fried Rice offers a rich and savory taste experience, perfect for mushroom enthusiasts or those seeking a meat-free meal.
<br>$15.54
<br>Plain Fried Rice
<br>A simple yet satisfying dish featuring fluffy rice stir-fried with savory eggs, soya sauce, sesame oil, seasoning and crunchy celery. This Plain Fried Rice offers a versatile base that can be enjoyed on its own or paired with other dishes, perfect for those craving a classic and comforting meal.
<br>$14.34
<br>Fresh Shrimp Fried Rice
<br>Plump and succulent shrimp stir-fried with fluffy rice, savory eggs, and crisp celery, creating a delicious seafood delight. This Shrimp Fried Rice features eight pieces of tender shrimp, offering a satisfying and flavorful meal option for seafood lovers.
<br>$16.75
<br>Special Fried Rice
<br>A special blend of flavors featuring tender BBQ pork, 4 succulent shrimp, earthy mushrooms, savory beef, and juicy chicken stir-fried with fluffy rice, savory eggs, , bean sprouts and crisp celery. This Special Fried Rice offers a mouthwatering combination of meats and vegetables, creating a truly satisfying and indulgent dish.
<br>$22.74
<br>Chop Suey
<br>(Stir-fried w/ cabbage, bean sprouts, mushroom, celery & napa)
<br>Chicken Chop Suey
<br>Tender pieces of chicken breast stir-fried with an array of crisp vegetables including , jumbo onion ,napa, cabbage, bean sprouts,celery and mushrooms in a light yet flavorful sauce, all tossed in a savory soy-based sauce. Perfect for an individual meal or as part of a larger spread.
<br>Small
<br>$17.94
<br>Large
<br>$20.34
<br>Beef Chop Suey
<br>Succulent slices of beef cooked to perfection and combined with vibrant vegetables such as jumbo onion ,napa, cabbage, bean sprouts,celery and mushrooms in a light yet flavorful sauce in a flavorful sauce. This Beef Chop Suey is ideal for those craving the rich taste of beef in a satisfying Chop Suey dish.
<br>Small
<br>$18.30
<br>Large
<br>$20.70
<br>BBQ Pork Chop Suey
<br>Juicy, thinly sliced BBQ pork mingled with a colorful medley of vegetables like A delightful blend of fresh seasonal vegetables cooked to perfection, including , jumbo onion ,napa, cabbage, bean sprouts,celery and mushrooms in a light yet flavorful sauce all enveloped in a delightful sweet and savory sauce. A BBQ Pork Chop Suey ensures a delightful taste of BBQ pork in every bite.
<br>Small
<br>$17.94
<br>Large
<br>$20.34
<br>Vegetable Chop Suey
<br>A delightful blend of fresh seasonal vegetables cooked to perfection, including , jumbo onion ,napa, cabbage, bean sprouts,celery and mushrooms in a light yet flavorful sauce. This vegetarian option is perfect for those seeking a healthy and flavorful meal.
<br>$19.14
<br>Fresh Shrimp Chop Suey
<br>Plump, juicy shrimp combined with an assortment of crunchy vegetables such as , jumbo onion ,napa, cabbage, bean sprouts,celery and mushrooms in a light yet flavorful sauce, all infused with a delicate yet tangy sauce. This dish offers a small portion of seafood delight for shrimp lovers.
<br>Lunch Menu
<br>Available from 11:30am - 2:00pm - Tuesday To Friday
<br>Lunch Specials
<br>A. Chicken Fried Rice, S&S Wontons(6), and Egg Roll.
<br>The order comes with 1 egg roll and 6 deep fried wontons, chicken fried rice, and sweet & sour sauce
<br>$16.50
<br>B. Chicken Fried Rice, Chicken Chow Mein, and Egg Roll.
<br>The order comes with Chicken fried rice, 1 egg roll, and chicken chowmein ( fried noodles, napa, cabbage, mushrooms, bean sprouts and celery)
<br>$16.50
<br>C. Chicken Fried Rice, S&S Chicken Balls(4), and Egg Roll.
<br>The order comes with 4 chicken balls, chicken fried rice,1 egg roll, and sweet & sour sauce
<br>$16.50
<br>D. Chicken Fried Rice, Beef Mixed Greens, and Egg Roll.
<br>The order comes with Chicken fried rice, 1 egg roll, and beef and mixed green (beef, napa, carrot, mushroom, celery, baby corn, and broccoli )
<br>$13.39
<br>E. Chicken Fried Rice, S&S Spareribs(5), and Egg Roll.
<br>The order comes with 5 pieces of spareribs, 1 egg roll, chicken fried rice, and sweet & sour"
}