{
"name" : "Food Bebe",
"status" : "",
"link" : "https://foodbebe.ca/", 
"hours" : "(Monday - Friday: 11:00 - 15:00)", 
"tel" : "807-768-2323", 
"sms": "", 
"address" : "455 Gemstone Drive", 
"map": "https://maps.app.goo.gl/uh8mNCexXW7FbfMJ7", 
"updated" : "2025-07-16", 
"courtesy" : "circa_1984", 
"text" : "SANDWICHES & WRAPS
<br>All sandwiches come with a choice of soup or salad
<br>3B Grilled Cheese
<br>Brie cheese, bacon and berry coulis grilled to perfection to combine a slightly sweet, salty and creamy creation.
<br>14
<br>Banhi Mi
<br>Seasoned beef/pork pattie topped with pickled carrots/radish, cucumber, cilantro, jalapeno and sriracha scallion mayo on a baguette. Side soup or salad.
<br>14
<br>Chicken Cordon Bleu Sandwich
<br>Chicken maple ham, french mustard Swiss cheese, cream sauce, arugula on a toasted bun. Comes with side salad or soup.
<br>15
<br>Black Bean & Quinoa Wrap
<br>Mildly spiced black bean & quinoa rounds baked & wrapped with mixed greens, avocado, tomato, goat cheese & a chili lime cilantro dressing. Choice of side soup or salad.
<br>12
<br>Chicken Feta Wrap
<br>Chicken, tomatoes, cucumber, feta & mixed greens drizzled with in house ranch & wrapped in a soft tortilla. Choice of side soup or salad.
<br>12
<br>Croque Monsieur
<br>Shaved ham, gruyere cheese & French mustard sandwich lightly toasted, then broiled with more gruyere cheese & béchamel sauce topping. Choice of side salad or soup.
<br>15
<br>FROZEN MEALS & SOUPS TO GO
<br>♥ Take it home ♥
<br>Delicious meals pre-made in house are ready for you to whip up when you want.
<br>CATERING
<br>♥ Call to order ♥
<br>We have custom menus for our clients for all events and occasions.
<br>RESERVATIONS AND PRIVATE BOOKINGS
<br>♥ Call to make a reservation ♥
<br>Space available or you business meetings, bridal showers, and any other special event. Personalized menus available
<br>SALADS
<br>All salads come with toasted and buttered naan
<br>Salad Yvette
<br>(A playful twist on my aunt's Greek salad)
<br>Greens, feta, kalamata olives, tomatoes, cucumber, red onion, bell peppers, and Greek-style dressing.
<br>Add Quinoa $2.00
<br>12
<br>The Maple Dragon
<br>Mixed greens, roasted yam, cucumber, julienned carrot, baby tomatoes. With in house hummus, avocado, feta cheese, sunflower/pumpkin seeds and a maple syrup soya vinaigrette.
<br>12
<br>Cobb Salad
<br>Mixed greens topped with egg, bacon, chicken, choice of feta or blue cheese, tomato, cucumber & finished with in house ranch dressing.
<br>14
<br>Bebe Bowl
<br>Sautéed mushrooms and vegetables tossed with quinoa. Topped with goat cheese, fresh arugula.
<br>French vinaigrette and pesto drizzle.
<br>12"
}