{
"name" : "Mike's Roadhouse",
"status" : "",
"link" : "https://www.mikesroadhouse.ca/", 
"hours" : "(Sunday - Saturday: 11:30 - 22:00)", 
"tel" : "tel: 807-286-7446", 
"sms": "", 
"address" : "Address: 1021 Carrick Street", 
"map": "https://maps.app.goo.gl/vjmL8mXZpsD7WWj98", 
"updated" : "Updated: 2026-01-18", 
"courtesy" : "Courtesy: Justin Menu",
"image0" : "img (8).webp",
"image1" : "img (7).webp",
"text" : "
MIKE'S ROADHOUSE
<br>
<br>Thank You For Your Support We are locally owned and operated.
<br>
<br>HAPPY HOUR Everyday from 2pm - 5pm & 7pm - Close
<br>
<br>DRINK DEALS $5.49 Pint (16oz) Domestic Draught $1 off Glass of house wine Jackson Triggs (White or Red)
<br>
<br>APPY DEALS $12.99 EACH Spinach & Goat Cheese Dip Wings 8pcs (ADD: $0.99 Carrots & Dip - Ranch or Blue Cheese) Asian Chicken Bites
<br>
<br>Must be legal drinking age. Please drink responsibly. Dine-in only.
<br>
<br>WEEKLY SPECIALS AVAILABLE ALL DAY *Beverage purchase required. Dine-in only. Taxes extra.
<br>
<br>WINE DOWN ~ MONDAYS $5 off Bottle of wine
<br>
<br>RIB DAY ~ WEDNESDAYS Served with coleslaw and fries.** $17.99 Half Rack $25.99 Full Rack
<br>
<br>FISH DAY ~ FRIDAYS Served with coleslaw, tartar sauce and fries.** $15.99 1pc Haddock $21.99 2pc Haddock
<br>
<br>BURGER DAY ~ SUNDAYS Served with fries.** Maple peppercorn bacon cheeseburger $16.99 ADD: $1.99 Beef Gravy
<br>
<br>APPETIZERS
<br>
<br>Bavarian Soft Pretzel Bites 10.99 Soft pretzel bites tossed in sea salt served with queso cheese.
<br>
<br>Dry Seasoned Pork Riblets From 15.99 Lightly dusted bone-in pork riblet bites served with lemon wedge and garlic aioli sauce.
<br>
<br>Chicken Wings (8pc) From 15.99 Lightly dusted deep fried and tossed in your choice of wing sauce. Option to add Carrots & dip for $0.99
<br>
<br>Chicken Wings (16pc) From 25.99 Lightly dusted deep fried and tossed in your choice of wing sauce. Option to add Carrots & dip for $0.99
<br>
<br>Beef Nachos From 19.99 Crispy corn tortilla chips topped with seasoned ground beef, shredded mixed cheese, queso cheese sauce, diced tomatoes, green onions, jalapenos serve with sour cream and salsa.
<br>
<br>Buffalo Chicken Quesadilla From 17.99 Breaded Buffalo chicken, mixed cheeses, tomatoes and green onions in a grilled flour tortilla served with sour cream and salsa.
<br>
<br>Spinach & Goat Cheese Dip 17.99 Spinach and artichokes topped with goat cheese and diced tomatoes served with flatbread wedges and tortilla chips.
<br>
<br>Asian Chicken Bites 15.99 Crispy fried chicken tossed with sweet chili sauce and green onions.
<br>
<br>Calamari 17.99 Lightly seasoned dusted calamari served with tangy Thai chili sauce.
<br>
<br>Loaded Cheese Fries From 10.99 Crispy fries topped with queso cheese sauce, green onions, bacon, ranch dressing and sour cream.
<br>
<br>Fish Tacos (3pc) 18.99 Golden fried haddock in beer batter, wrapped in grilled tortilla, topped with shredded lettuce, shredded mixed cheese and our taco sauce. Served with a side of Pico de Gallo and lemon wedge.
<br>
<br>Grilled Chicken Tacos (3pc) 18.99 Grilled chicken breast, wrapped in grilled tortillas with guacamole, topped with shredded lettuce, shredded mixed cheese and our house-made taco sauce. Served with a side of Pico de Gallo and lemon wedge.
<br>
<br>Beef Tacos (3pc) 18.99 Seasoned ground beef, wrapped in grilled tortilla, topped with shredded lettuce, shredded mixed cheese and our taco sauce. Served with a side of Pico de Gallo and lemon wedge.
<br>
<br>Buffalo Cauliflower 13.99 Crispy fried cauliflower tossed in Buffalo butter topped with green onion served with Ranch.
<br>
<br>Fried Pickle Spears 13.99 Tangy dill-battered spears served with Chipotle Ranch.
<br>
<br>Garlic Cheese Bread 10.99 Loaded with garlic butter and melted mixed cheese and parsley.
<br>
<br>Mozzarella Sticks 15.99 Hot & gooey inside, crisp and golden outside. Served with ranch sauce for dipping.
<br>
<br>Crispy Onion Rings 9.99 Crispy fried onion rings served with ranch dip.
<br>
<br>SALADS
<br>
<br>Beet and Goat Salad From 15.99 Diced beets, goat cheese, and sliced almonds on mixed greens, red onions and served with a lemon herb dressing and balsamic glaze on the side.
<br>
<br>Garden Salad From 12.99 Spring mixed green, dried cranberry, diced tomatoes, carrots, cucumber, served with your choice of dressing on the side.
<br>
<br>Maple Bacon Caesar Salad From 15.99 Romaine lettuce, Maple Peppercorn Bacon, croutons, and Parmesan cheese with our Caesar dressing on the side.
<br>
<br>Asian Chicken & Mandarin Orange Salad From 16.99 Spring mix greens, topped with crispy chicken, dried cranberries, fried wonton strips, mandarin oranges, sesame seeds, served with raspberry vinaigrette dressing on the side.
<br>
<br>BURGERS Our 6oz patty are made 100% Certified Angus Beef (NOT GLUTEN FREE) ALL BURGERS are served with ONE SIDE.
<br>
<br>The Ultimate Burger From 18.99 Grilled to perfection topped cheddar cheese, pickles, deep fried onion ring, garlic aioli sauce and garnished with a deep fried pickle served with ONE SIDE.
<br>
<br>Maple Peppercorn Bacon Burger From 18.99 Maple Peppercorn burgers is topped with lettuce, tomato, red onion, pickles, our house-made burger sauce, Cheddar cheese, Maple peppercorn bacon and and served with ONE SIDE.
<br>
<br>The BIG Mike Burger From 23.99 The Big Mike Burger are stack with double patty, double cheddar cheese and topped with lettuce, tomato, red onion, pickles, our house-made burger sauce, smoked bacon and served with ONE SIDE.
<br>
<br>Mushroom Swiss Burger From 18.99 Grilled to perfection topped with mayo, lettuce, tomato, sautéed mushrooms and sautéed onions, Swiss cheese and served with ONE SIDE.
<br>
<br>Crispy Chicken Burger From 17.99 Breaded chicken breast topped with mayo, lettuce, tomato and served with ONE SIDE.
<br>
<br>Roadhouse Burger From 14.99 Roadhouse burger (Hamburger) is topped with lettuce, tomato, red onion, pickles, our house-made burger sauce and and served with ONE SIDE.
<br>
<br>Cheese Burger From 16.99 Cheeseburger is topped with lettuce, tomato, red onion, pickles, our house-made burger sauce, Cheddar cheese and and served with ONE SIDE.
<br>
<br>PASTAS Pastas are served with toasted focaccia garlic toast.
<br>
<br>Chicken Marinara Penne From 19.99 Penne noodles tossed in a Pico de Gallo and marinara sauce, topped with a garlic chicken, parmesan cheese and green onions
<br>
<br>Creamy Alfredo Shrimp Penne From 19.99 Penne noodles tossed in a creamy Alfredo sauce with fresh red peppers, topped with skewer garlic shrimp, parmesan cheese and green onions
<br>
<br>SANDWICHES & WRAPS Sandwiches and wraps are served with ONE SIDE option.
<br>
<br>Crispy Chicken Caesar Wrap From 17.99 Crispy Chicken, maple peppercorn bacon, romaine lettuce, parmesan cheese, tossed in Caesar dressing wrapped in a grilled flour tortilla and a choice of ONE SIDE.
<br>
<br>Buffalo Chicken Wrap From 16.99 Crispy chicken tossed in Buffalo sauce, and wrapped in a grilled flour tortilla with chopped tomatoes, shredded cheese, lettuce and ranch dressing and a choice of ONE SIDE.
<br>
<br>Chicken Club Sandwich From 19.99 Grill chicken breast, smoked bacon, Cheddar cheese, lettuce and tomato on toasted ciabatta bun with mayo and a choice of ONE SIDE.
<br>
<br>Montreal Smoke Meat From 18.99 Carved Montreal smoked meat and Swiss cheese on marble rye bread with mustard and a choice of ONE SIDE.
<br>
<br>Buffalo Cauliflower Bites Wrap From 16.99 Deep fried cauliflower bites tossed in Buffalo sauce, and wrapped in a grilled flour tortilla with chopped tomatoes, shredded cheese, lettuce and ranch dressing and a choice of ONE SIDE.
<br>
<br>CLASSICS Classics are served with ONE SIDE option. (EXCEPT the Chicken Cordon Bleu comes standard with mashed potato)
<br>
<br>Chicken Cordon Bleu From 20.99 Chicken breast stuffed with Swiss cheese and house made peppercorn bacon rolled and wrapped in smoked bacon, finish with cream sauce and served with mashed potato
<br>
<br>Chicken Fingers From 16.99 Breaded chicken fingers with plum sauce and a choice of ONE SIDE.
<br>
<br>Buffalo Chicken Fingers From 17.99 Breaded chicken fingers tossed in buffalo butter sauce with ranch for dipping and a choice of ONE SIDE.
<br>
<br>Deep fried beer battered Haddock fish From 17.99 Deep fried Beer battered haddock fish. Served coleslaw, tartar sauce, lemon wedge and come standard with fries UNLESS ''upgrade is selected for $2.49'' for the choice below.
<br>
<br>BAR-B-QUE BBQ items are served with ONE SIDE option.
<br>
<br>BBQ chicken From 16.99 A roasted BBQ chicken, glazed and caramelized with our Chipotle BBQ sauce, coleslaw and a choice of ONE SIDE.
<br>
<br>BBQ Back Ribs From 19.99 BBQ pork back ribs, glazed with our Chipotle BBQ sauce, coleslaw and a choice of ONE SIDE.
<br>
<br>Chicken & Rib Combo From 28.99 A quarter roasted BBQ chicken leg, half rack of ribs glazed and caramelized with Chipotle BBQ sauce, coleslaw and a choice of ONE SIDE.
<br>
<br>Wing & Rib Combo From 26.99 Lightly dusted wings (4) tossed with Chipotle BBQ sauce, half rack of ribs glazed and caramelized with Chipotle BBQ sauce, coleslaw and a choice of ONE SIDE.
<br>
<br>Steak & Rib Combo From 34.99 Sirloin (7oz) grilled to your specification, half rack of ribs glazed and caramelized with Chipotle BBQ sauce, coleslaw and a choice of ONE SIDE.
<br>
<br>STEAKS Steaks are served with ONE SIDE option.
<br>
<br>Top Sirloin (7oz Certified Angus Beef) From 22.99 Steaks are aged for minimum of 28 days seasoned with house spice and grilled to your specifications, Served with day veg and a choice of ONE SIDE.
<br>
<br>New York (10oz Certified Angus Beef) From 34.99 Steaks are aged for minimum of 28 days seasoned with house spice and grilled to your specifications, Served with day veg and a choice of ONE SIDE.
<br>
<br>SIDES
<br>
<br>Gravy 1.99 Beef gravy
<br>
<br>French fries From 4.99 Not gluten free. Contains a crispy coating.
<br>
<br>Cajun seasoned Fries From 4.99 Not gluten free. Contains a crispy coating.
<br>
<br>Poutine 7.99 Fries not gluten free. Contains a crispy coating. Made with shredded mixed cheese and gravy on side.
<br>
<br>Side - Garden Salad 5.99 Spring mixed greens, dried cranberry, diced tomatoes, shredded carrots, cucumbers with your choice of dressing on the side.
<br>
<br>Side - Caesar Salad 5.99 Romaine lettuce, croutons, parmesan cheese, lemon wedge served with Caesar dressing on the side.
<br>
<br>Side - Day Veg (Broccoli & red peppers) 5.99
<br>
<br>Side - Coleslaw 3.99
<br>
<br>Grilled chicken 7.99
<br>
<br>Garlic Shrimp (5pcs) 5.99
<br>
<br>Peppercorn Bacon 3.99
<br>
<br>Smoked Bacon 3.99
<br>
<br>Extra Sauces From 0.00
<br>
<br>Sauteed Mushrooms & onions 2.99
<br>
<br>Sauteed Mushrooms 2.99
<br>
<br>Sauteed onions 2.99
<br>
<br>DESSERT
<br>
<br>Tiramisu Cake 9.99 Mini Tiramisu cake features delicate layers of ladyfingers soaked in espresso and layered with a velvety smooth mascarpone cheese filling and dusted with cocoa served with whipped cream and caramel drizzle.
<br>
<br>White chocolate Raspberry Cheesecake 9.99 By the Cheesecake Factory - Sweet cream cheesecake swirled with raspberry and chunks of white baked on a chocolate crumb and finished off with raspberry drizzle and whipped cream.
<br>
<br>Chocolate Truffle Mousse 8.99 Rich double chocolate mousse is nestled on a chocolate cake base and topped with a classic chocolate and decorative chocolate shard served with whipped cream and chocolate drizzle.
<br>
<br>PLACE SETTINGS Number of Plastic Cutlery 0.00
<br>
<br>SOFT DRINKS & NON-ALCOHOL BEER
<br>
<br>Bottled Water - 500ml 1.99 Pepsi - 355ml can 1.99 Diet - Pepsi - 355ml can 1.99 Ice Tea - 355ml can 1.99 Ginger Ale - 355ml can 1.99 Root Beer - 355ml can 1.99 Perrier - 330ml bottle 3.49 Coca Cola - 355ml can 1.99 Diet - Coca Cola - 355ml can 1.99 Budweiser Zero - 473ml can 4.99 Heineken 0.0 - 330ml bottle 4.99 Coors Edge 0.5 - 473ml can 4.99 Molson Excel - 355ml can 3.99
<br>
<br>BEER / SELTZERS / COOLERS
<br>
<br>Budweiser (341mL bottle) 5.49 Bud Light (341mL bottle) 5.49 Canadian (341mL bottle) 5.49 Coors Light (341mL bottle) 5.49 Corona (330mL bottle) 6.49 Guinness (440mL can) 7.49 Michelob Ultra (341mL bottle) 6.49 Sleeman Clear 2.0 (341mL bottle) 6.49 Smirnoff Ice (330mL bottle) 6.49 Stella Artois (330mL bottle) 6.49 Alexander Keith's India Pale Ale (341ml bottle) 6.49 Somersby Apple Cider (473ml Can) 7.99
<br>
<br>WINE
<br>
<br>Bottle of Red Wine (750mL) 29.99 Bottle of white Wine (750mL) 29.99
"
}