{
"name" : "Outpost (Inside The Agora Building), The",
"status" : "",
"link" : "https://lusu.ca/services-and-support/the-outpost/", 
"hours" : "(Monday: 11:30 - 16:00), (Tuesday: 11:30 - 23:00), (Wednesday: 11:30 - 20:00), (Thursday: 11:30 - 22:00), (Friday: 11:30 - 20:00)", 
"tel" : "tel: 807-343-8551", 
"sms": "", 
"address" : "Address: 955 Oliver Road (Inside The Agora Building)", 
"map": "https://maps.app.goo.gl/nMSvwkVZQR5KNB6g6", 
"updated" : "Updated: 2025-10-21", 
"courtesy" : "Courtesy: Puunhalaaja", 
"text" : "Small Bites (Outpost Full Menu 1 of 10.webp)
<br>CLASSIC FRIES $5.5 SWEET POTATO FRIES $8 CLASSIC POUTINE $9 AREPA BIRRIA $9 (2 crispy corn cakes, Monterey Jack cheese, Birria beef, cilantro lime crema) FALAFEL CART FRIES $13 (Sweet potato fries with falafel, tomatoes, onions, shredded lettuce, tzatziki sauce, feta and crispy pita strips) WINGS $17 (Sauces: buffalo, hot, BBQ, sweet Thai chilli, honey garlic. Dry Spice: cajun spice, roasted red pepper and garlic spice, salt and pepper) NASHVILLE CHICKEN BITES $11.5 (Spicy Nashville chicken pieces, Alabama white sauce, coleslaw, sweet pickles and Texas cut bread) BUFFALO JUMBO SHRIMP $11 (Pan seared shrimp, peppers, onions, buffalo sauce, blue cheese, ranch dressing, garlic toast) PEP & CHEESE FLATBREAD $11 (Marinara sauce, mozzarella cheese and pepperoni) SESAME CHICKEN FLATBREAD $12 (Hoisin Sauce, mozzarella cheese, Thai chilli peppers, pickled red onion, curried cashews, cilantro and sesame chicken) BALSAMIC TOMATO FLATBREAD $11 (Roasted garlic spread, mozzarella cheese, balsamic marinated tomatoes, onions, arugula, feta cheese and pesto drizzle)
<br>
<br>Greens & Street Bowls (Outpost Full Menu 2 of 10.webp)
<br>GREENS ADD GRILLED CHICKEN $5.5 OR GRILLED SHRIMP $5.5 TEQUILA LIME SHRIMP SALAD $13 (Flame broiled tequila lime shrimp, shredded iceberg lettuce, pickled onion, charred pineapple salsa, honey lime dressing, Tajín spiced tortilla, crema and cilantro) BALSAMIC BLUE CHEESE SALAD $12 (Romaine lettuce, creamy garlic balsamic dressing, sweet and spicy croutons, crumbled blue cheese and pesto drizzle)
<br>
<br>STREET BOWLS BUTTER CHICKEN $14.5 (Traditional butter chicken on basmati rice. Served with warm naan) CHICKEN STRIP $14 (Dusted chicken strips served with fries and your choice of dipping sauce: buffalo, hot, BBQ, sweet Thai chilli, honey garlic) HOT HONEY CHICKEN $14 (Crispy fried hot honey chicken, fried rice, green onion, roasted sesame seeds) MEXICAN DIRTY FRIES $14 (Braised birria beef, seasoned fries, onion, tomato, chipotle lime crema, cilantro) CURRIED CASHEW & VEG STIR FRY $13 (Broccoli, cauliflower, onions and bell peppers stir fried with udon noodles and topped with honey curried cashews) ADD GRILLED CHICKEN $5.5 MAC & CHEESE $12.75 (Macaroni noodles, triple cheese sauce, smoked paprika, garlic toast)
<br>
<br>Handhelds (Outpost Full Menu 3 of 10.webp)
<br>ADD SIDE FRIES $3.5, SIDE SWEET POTATO FRIES $4, SIDE POUTINE $7 CLASSIC CANADIAN BURGER $9.75 (5oz smash burger, lettuce, tomato, onions, burger sauce and pickles) Add bacon $1.50, add cheese $1, sub gluten free bun for $2 Sub Beyond Meat Burger $2.5 HAVANA BURGER $11.75 (5oz smash patty, smoked ham, dill pickles, swiss cheese, dijon mustard aioli, pressed on the grill) THE BLUE BURGER $11.75 (5oz smash patty with blueberry BBQ sauce, bacon, garlic aioli, arugula, blue cheese crumble and blueberry habanero Heartbeat Hot Sauce) CHICKEN & WAFFLE SANDWICH $13 (Fried chicken, maple drizzle, tangy slaw and chipotle aioli on a waffle bun) MALIBU CHICKEN FOLD $12.5 (Grilled chicken breast, shredded lettuce, guacamole, garlic aioli and pineapple salsa on a grilled naan) CAPRESE CHICKEN BURGER $12.75 (6oz grilled chicken breast, marinated tomatoes, onions, arugula, provolone cheese, balsamic reduction and pesto mayo) LENTIL TACOS $11.75 (Three charred flour tortillas, smokey seasoned lentils, charred pineapple salsa, pickled onions, garlic aioli, fresh cilantro) FALAFEL PITA $11.25 (Charred pita, crispy falafel, lettuce, red onions, marinated tomatoes and tzatziki) CALI PLANT BASED BURGER $12.5 (Beyond Meat Burger, charred pineapple salsa, pickled red onion, guacamole, arugula and garlic aioli)
<br>
<br>Specials (Outpost Full Menu 4 of 10.webp)
<br>Tuesday WALKING TACO $6 (Chipotle beef with cilantro crema on nacho flavoured Doritos) Wednesday NEOPOLITAN STYLE PIZZA $11-13 Thursday NASHVILLE HOT CHICKEN SANDWICH $11 (Available in all flavours) Friday HALF-PRICE WINGS $8.5 (Available in all flavours)
<br>
<br>Late Night Menu (6PM - CLOSE) (Outpost Full Menu 5 of 10.webp)
<br>CLASSIC FRIES $5.5 SWEET POTATO FRIES $8 CLASSIC POUTINE $9 MEDITERRANEAN CART FRIES $13 WINGS $17 NASHVILLE CHICKEN BITES $11.5 BUFFALO JUMBO SHRIMP $11 PEP & CHEESE FLATBREAD $11 SESAME CHICKEN FLATBREAD $12 BALSAMIC TOMATO FLATBREAD $11 CHICKEN STRIPS & FRIES $14 MEXICAN DIRTY FRIES $14 BBQ BURGER $9
<br>
<br>Drink Specials (Outpost Full Menu 6 of 10.webp)
<br>Monday (LOCAL LOVE) LOCAL CRAFT BEER Sm $5.25 Tall $6.25 Pint $6.25 Tuesday (TANKARD) ALL DRAUGHT BEER* 32oz Tankards, Busch $7.75 Domestic $8 Premium $9 Wednesday (NOT BEER) COCKTAILS* & NON-ALCHS Signature $8 Basic $6 Non-Alch Cans $5.25 Thursday (THIRSTY) PITCHERS* & FISH ''TANKS''** Domestic $15 Premium $17 Fish ''Tanks'' $10 Friday (LABATT) LABATT TALL BOYS Domestic $6 Premium $7 Seltzers, Ciders, Coolers $5.25 *AVAILABLE AT 4PM AT MAIN BAR
<br>
<br>Signature Cocktails (Outpost Full Menu 7 of 10.webp)
<br>1.5 OZ COCKTAILS | $9 THE ENGINEER (Serious but knows how to start a party) Fireball, Jagermeister, Root Beer WHISKEY BUSINESS (Looks professional but goes hard after hours) Whiskey, Triple Sec, O.J., Soda SPICY NURSE (Bloody Mary may cause cardiac arrest due to high temps and flavour bomb) Vodka, Heartbeat Hot Sauce, Bourbon pickled jalapeno TIRED TEACHER (Part caffeine + Part coping mechanism = Not falling asleep in class) Vodka, Kahlúa, Espresso Cold Brew MAD SCIENTIST (Lab experiment gone right. Caution: Easily consumed.) Tequila, Melon Liqueur, 7up, Nerds TREE HUGGER (Flavours of nature. Best enjoyed in Blundstones) Gin, Maple Syrup, Mint, Lime
<br>
<br>ZERO-PROOF 0% Alchohol | $6 THE HUMANITINI (All the flavour and fizz, none of the proof.) Earl Grey and thyme infused syrup, Lemon, Pear, Soda COMPUTER NERD (A coding companion with sweet bytes of candy) Pineapple, Cran, Soda, sugar rim and Candy
<br>
<br>Basic Cocktails, Shooters & Seltzers & Coolers (Outpost Full Menu 8 of 10.webp)
<br>BASIC COCKTAILS 1 OZ COCKTAILS | $7 LAKEHEAD LAGOON Blue Curaçao, Melon Liqueur, Triple Sec, 7up LONG ISLAND ICED TEA Long Island Mix, Lime Juice, Pepsi COSMOPOLITAN Vodka, Cranberry Juice, Triple Sec, Lime Juice MARGARITA Tequila, Triple Sec, Lime Juice DANGER JUICE Melon Liqueur, Amaretto, Vodka, Cranberry Juice WATER HAZARD Blue Gatorade, Lemonade, 7up, Vodka MARGARITA Tequila, Triple Sec, Lime Juice (Note: Margarita is listed twice)
<br>
<br>SHOOTERS 1 OZ SHOOTERS | $6 LEMON DROP Vodka and Lemon Juice BLUE BALLS Blue Curaçao and Malibu GREEN TEA Peach Schnapps, Jameson, Ginger Ale BURT REYNOLDS Butter Ripple and Spiced Rum HOWLER Banana Liqueur and Blue Curaçao CARAMEL APPLE Butterscotch and Green Apple Sour Puss
<br>
<br>SELTZERS & COOLERS NUTRL SM $6.5 | TALL $7.25 SVNS CRAFTY ELK AMERICAN VINTAGE
<br>
<br>Beer (Outpost Full Menu 9 of 10.webp)
<br>BOTTLES/CANS DOMESTIC BUSCH BUDWEISER BUDLIGHT BLUE ROLLING ROCK MILL STREET PREMIUM ALEXANDER KEITH'S GOOSE ISLAND IPA STELLA ARTOIS** CORONA** MODELO** LOCAL CRAFT* SLEEPING GIANT BREWING CO. LAKEHEAD BREWING CO. DAWSON TRAIL BREWERY CHEAP BEER BUSCH CANS $5.5 | $6 BOTTLES $5.5 | $6.5 TALL BOYS $6.25 | $6.5 | $7.25 **Bottles.
<br>
<br>ON TAP DOMESTIC BUSCH BUDWEISER BUDLIGHT PREMIUM ALEXANDER KEITH'S GOOSE ISLAND IPA MICHELOB ULTRA STELLA ARTOIS LOCAL CRAFT* SLEEPING GIANT BREWING CO. CHEAP BEER BUSCH CHEAP BEER | DOMESTIC | PREMIUM & CRAFT PINT $5 | $6 | $7 TANKARD $10 | $11 | $12 PITCHER $13.5 | $17 | $19
<br>
<br>THE ICONIC TANKARD TUESDAY! is always a party! Every Tuesday at 4pm we're pouring 32oz Tankards for $7.75, $8 & $9. *Ask the bartender for our rotating selection of these local favourites!",
"image0" : "img4.webp",
"image1" : "img5.webp",
"image2" : "img6.webp",
"image3" : "img7.webp",
"image4" : "img8.webp",
"image5" : "img9.webp",
"image6" : "img10.webp",
"image7" : "img11.webp",
"image8" : "img12.webp"
}