{
    "link": "",
    "hours": "",
    "tel": "tel: 807-620-0196",
    "sms": "",
    "address": "Address: 782 Macdonell Street",
    "map": "https:\/\/maps.app.goo.gl\/EUqFghfC4XqSP96b6",
    "updated": "Updated: 2024-10-28",
    "courtesy": "Courtesy: JustTheMenu",
    "text": "SHAREABLES &amp; APPETIZERS<br\/><br\/>NACHOS 19 Tortilla chips topped with shredded cheese, bacon, onions, tomatoes, peppers, and jalape&#241;os.<br\/>GOAT CHEESE DIP 16<br\/>CALAMARI 19 Fried golden brown with crispy banana pepper rings. Served with garlic aioli, tzatziki, and a slice of lemon.<br\/>MUSSELS AND TOASTED BAGUETTE 21 Mussels simmered in house-made white wine &amp; garlic sauce, served with a toasted baguette and a slice of lemon.<br\/>BRUSCHETTA 17 Tomatoes with basil, garlic, and feta on toasted baguette. Drizzled with a balsamic reduction.<br\/>SHRIMP AU GRATIN 20 Shrimp baked in Calvados, baked, finished with a hint of bruschetta.<br\/>ARANCINI 18 Crispy risotto blended with mushrooms, thyme, garlic, and parmesan cheese, served with marinara sauce.<br\/>JALAPE&#209;O POPPERS 12 Breaded and filled jalape&#241;os stuffed with cream cheese.<br\/>DEEP FRIED PICKLES 14 Fried dill pickle spears served with ranch.<br\/>BACON WRAPPED STEAK SKEWERS 18 Steak wrapped in bacon seasoned to perfection, served with a horseradish aioli.<br\/>SCALLOPS &amp; BACON 24 Scallop medallions wrapped in seasoned bacon, served with a lemon wedge.<br\/>GOURMET BRUSSEL SPROUTS 16 Deep-fried brussel sprouts tossed in butter and lemon, sprinkled with almonds and spicy salt.<br\/>LOADED POTATO SKINS 15 Potato skins filled with bacon, cheese, BBQ sauce and chives. Served with a side of sour cream.<br\/>SLIDER FLIGHT 24 One of each per plate:<br\/>CHICKEN SLIDER<br\/>PULLED PORK SLIDER<br\/>MUSHROOM SWISS SLIDER<br\/>BACON CHEESEBURGER SLIDER<br\/>WAREHOUSE WINGS 19<br\/>BREADED OR UNBREADED<br\/>Served with carrots and celery<br\/>Sauces:<br\/><br\/>BBQ<br\/>MILD<br\/>HOT<br\/>HONEY GARLIC<br\/>ROASTED RED PEPPER<br\/>LEMON PEPPER<br\/>SALT &amp; PEPPER<br\/>GARLIC PARM<br\/>DRY CAJUN<br\/>BURGERS<br\/><br\/>All burgers are served with fries or garden salad.<br\/>ADD FRIED EGG 2<br\/>SUB CAESAR, GREEK, PEAR SALAD OR SWEET POTATO FRIES +$3<br\/><br\/>INDUSTRY WAGYU 27 Premium Wagyu beef patty topped with lettuce, tomato, onion, cheddar cheese and bacon on a toasted kaiser.<br\/>BELLA BURGER 20 6oz beef patty topped with spring mix, saut&#233;ed onion, roasted jalape&#241;o havarti, and garlic aioli.<br\/>CLASSIC BACON CHEESE 18 6oz beef patty topped with spring mix, tomato, red onion, bacon, ketchup, and cheddar cheese.<br\/>MUSHROOM SWISS BURGER 18 6oz beef patty topped with garlic saut&#233;ed mushrooms, melted Swiss cheese, and garlic aioli.<br\/>BEYOND MEAT BURGER 18 4oz Beyond Meat Burger, topped with spring mix, tomato, red onion, and ketchup.<br\/>LAMB BURGER 20 6oz lamb patty with tzatziki, cucumber, red onion, tomato, and lettuce.<br\/>TACOS<br\/><br\/>PESCADO FISH TACO TRIO 19 Beer-battered Cod, avocado crema, cilantro, lime, cabbage, and tangy house sauce.<br\/>CHICKEN TINGA TACO TRIO 18 Chicken cooked to perfection, pulled and spiced. Served with fried banana peppers and arugula.<br\/>STICKY PORK TACO TRIO 18 BBQ pulled pork served with pickled cabbage, spicy aioli, and crispy onions.<br\/>SALADS<br\/><br\/>ADD CHICKEN 4 ADD GRILLED SHRIMP 5<br\/><br\/>CAESAR 18 Fresh cut romaine lettuce topped with house-made Caesar dressing, topped with croutons, parmesan cheese, fresh cooked bacon.<br\/>GREEK 17 Spring mix with cucumbers, tomatoes, feta and Kalamata olives. Dressed in house-made Greek dressing.<br\/>GARDEN 16 Mixed greens and fresh vegetables dressed in house-made balsamic vinaigrette.<br\/>PEAR 17 Spring mix, fresh pear, feta, candied pecans, dressed in house-made honey dijon dressing.<br\/>SUMMER SALAD 20 Spinach, strawberries, avocado, feta, and watermelon, topped with a poppyseed dressing.<br\/>CAPRESE SALAD 18 Cucumber, tomato, basil, bocconcini, and mixed lettuce dressed in our house-made vinaigrette.<br\/>POUTINE<br\/><br\/>CLASSIC POUTINE 16 Fries tossed in salt and coated in house-made gravy.<br\/>INDUSTRY POUTINE 19 Fries tossed in salt and coated in house-made gravy with cheese curds, topped with chopped fried chicken.<br\/><br\/>CHICKEN &amp; FISH<br\/><br\/>All dishes are served with fries or garden salad.<br\/>ADD CAESAR, GREEK, PEAR SALAD OR SWEET POTATO FRIES FOR $3<br\/><br\/>HOT HONEY CHICKEN SANDWICH 19 Buttermilk marinated chicken breast with hot honey on a toasted brioche bun.<br\/>HONEY DILL SANDWICH 18 Fried chicken breast tossed in our honey dill sauce, served on a toasted brioche bun.<br\/>BUFFALO CHICKEN CAESAR WRAP 17 Fried chicken breast tossed with our in-house buffalo Caesar dressing.<br\/>BUTTERMILK CHICKEN &amp; WAFFLE 20 Crispy Belgian waffle topped with crispy buttermilk chicken breast and bacon. Served open-face with syrup.<br\/>INDUSTRY FISH &amp; CHIPS 20 One piece of local beer-battered cod with in-house tartar sauce and a lemon wedge.<br\/>PULLED PORK SANDWICH 19<br\/>Slow-cooked BBQ pulled pork served with coleslaw and pickles.<br\/><br\/>PASTA<br\/><br\/>Pasta provided fresh from Agostino's Deli, served with toasted baguette.<br\/><br\/>CHICKEN &amp; BROCCOLI ALFREDO 22 Fresh fettuccine tossed with house-made alfredo, pan-seared chicken, broccoli, topped with grated parmesan.<br\/>SEAFOOD FETTUCCINE 25 Fresh fettuccine tossed with house-made alfredo, spinach, cherry tomatoes, shrimp, baby clams, mussels, topped with grated Grana Padano.<br\/>CARBONARA 22 Fresh Fettuccine with traditional carbonara sauce made with egg yolk, black pepper, Grana Padano, seared pancetta.<br\/>GNOCCHI ROS&#201; 19 Fresh gnocchi tossed with house-made ros&#233; sauce, red peppers, and spinach, topped with fresh parmigiana.<br\/>GNOCCHI VERDANT 24 Fresh gnocchi tossed with browned butter, garlic, portobello &amp; button mushrooms, fresh thyme, topped with grated Grana Padano. Finished with truffle oil drizzle.<br\/>LOBSTER VODKA PENNE 30 A mild spice tomato and vodka sauce served with lobster.<br\/>PUTTANESCA 25 Olives, peppers, tomato, and garlic saut&#233;ed in olive oil with Grana Padano.<br\/>PIZZA<br\/><br\/>Fresh dough provided by Donato's Bakery.<br\/><br\/>MARGHERITA 19 Tomato base, fresh mozzarella, basil, topped with extra virgin olive oil.<br\/>GOAT CHEESE &amp; PANCETTA 23 Tomato base, pancetta, goat cheese, arugula, topped with balsamic reduction glaze.<br\/>CLASSIC PEPPERONI 20 Tomato base, pepperoni, fresh mozzarella.<br\/>CANDIED FIG 24 Caramelized onions, goat cheese, topped with honey drizzle and arugula.<br\/>MEATLOVERS 24 Tomato base, mozzarella, bacon crumble, pancetta, pepperoni.<br\/>BUFFALO CHICKEN 22 Buffalo base, mixed cheese, banana peppers, green onion, breaded chicken breast and finished with ranch drizzle.<br\/>DESSERTS &amp; COFFEES<br\/><br\/>CHEESECAKE 11 Your choice of cheesecake topped with featured sauce. NEW YORK, CHOCOLATE SWIRL, CARAMEL PECAN<br\/>CHOCOLATE MOUSSE 11 Light and creamy chocolate mousse topped with whipped cream and fresh fruit.<br\/>CR&#200;ME BR&#219;L&#201;E 12 Rich vanilla custard with a caramelized sugar crust, topped with fresh fruit &amp; mint.<br\/>TIRAMISU 13 Flavorful layered espresso, mascarpone, and lady fingers.<br\/>Ask your server about our featured lattes and coffees.<br\/><br\/>ESPRESSO 4<br\/>AMERICANO 4<br\/>CAPPUCCINO 5<br\/>BAILEYS &amp; COFFEE 8<br\/>IRISH COFFEE 9<br\/>SPANISH COFFEE 9<br\/><br\/>MOCKTAILS (0% ABV)<br\/><br\/>SAVING DAYLIGHT 9 Industry mandarin syrup, lemon, pineapple juice<br\/>NOJITO 8 Muddled seasonal berries, lime, simple syrup, club soda, mint<br\/>MANGO MULE 8 Honey syrup, mango puree, lime, ginger beer, cucumber slices<br\/>CUCUMBER GIMLET 7 Club Soda, muddled cucumber, lime, simple syrup<br\/>RASPBERRY BEES KNEES 8 Lemon, honey, raspberries, filtered water<br\/>WATERMELON BREEZE 8 Watermelon syrup, fresh mint, lime, club soda<br\/>FOUNTAIN DRINKS 3.5<br\/>Pepsi, Diet Pepsi, 7up, Ginger Ale, Iced Tea<br\/><br\/>NON ALCOHOLIC BEER 6<br\/>Bud Zero<br\/>Heineken 0.0<br\/><br\/>JUICE 4.5<br\/>Cranberry, orange, pineapple, Clamato, ginger beer<br\/><br\/>EL PRESIDANTE CUBANO 16 White rum, dry vermouth, orange cura&#231;ao, grenadine<br\/>MAPLE CINNAMON WHISKEY SOUR 15 Bourbon, lemon juice, maple syrup, cinnamon<br\/>GRILLED PINEAPPLE DAIQUIRI 16 Pineapple, white rum, spiced rum, orange cura&#231;ao, simple syrup<br\/><br\/>SUMMER SIGNATURE COCKTAILS<br\/><br\/>wood chip smoked +2<br\/><br\/>PEACH ORCHARD 14 White rum, peach schnapps, Industry peach syrup, lemon<br\/>WATERMELON SUGAR 14 Vodka, watermelon syrup, limoncello, and grapefruit juice<br\/>GOLDEN PHANTOM 14 Galliano Vanilla, White Creme de Cacao, heavy cream, topped off with chocolate shavings<br\/>VANILLA SUNRISE 13 Galliano Vanilla, vodka, sparkling lemonade<br\/>DILLIGHT 14 Empress 1908, limoncello, lemon, lime, fresh dill, simple syrup<br\/>MEXICAN FIESTA 13 Tequila Reposado, lime, grenadine, ginger beer<br\/>TROPICAL HEATWAVE 14 Tequila blanco, triple sec, lime, simple syrup, coconut milk, topped with jalape&#241;o slices<br\/>SOUR CHERRY DYNAMITE 14 White rum, Chambord, maraschino liqueur, Industry sour cherry syrup, lime<br\/>WHITE SUMMER SANGRIA 13 White wine, vodka, peach schnapps, 7up, muddled mandarin orange, simple syrup<br\/>RED SUMMER SANGRIA 13 Red wine, Grande Marnier, simple syrup, orange, lemon, soda<br\/>INDUSTRY STAPLES<br\/><br\/>wood chip smoked +2<br\/><br\/>INDUSTRY CAESAR 12 Tequila reposado, Dill Pickle Heartbeat Hot Sauce, Worcestershire, lemon, Clamato<br\/>THE STANDARD 13 Rye, bourbon, maple syrup, Cointreau, lemon<br\/>NO HARMER DONE 13 Rye, bourbon, demerara syrup, espresso, orange bitters<br\/>PANACEA 14 Tequila reposado, honey syrup, lemon, ginger beer, mezcal float<br\/>NEW YORK SOUR 12 Rye, lemon, simple syrup, egg white, red wine float<br\/>ESPRESSO MARTINI 13 Vodka, Kahlua, espresso, simple syrup<br\/>JUNGLE BIRD 15 Spiced rum, Campari, lime, pineapple juice<br\/>INDUSTRY PI&#209;A COLADA 15 Rum, pineapple juice, coconut milk, lime<br\/>MIMOSA 11 Sparkling white wine, orange juice<br\/>MIDORI SOUR 13 Midori, vodka, lemon, lime, soda<br\/><br\/>CLASSIC COCKTAILS<br\/><br\/>wood chip smoked +2<br\/><br\/>MOSCOW MULE 1.5oz Spirit 11<br\/>Vodka, lime, ginger beer<br\/><br\/>(Text about the history of the Moscow Mule)<br\/><br\/>COSMOPOLITAN 1.5oz Spirit 12<br\/>Vodka, triple sec, lime, cranberry juice<br\/><br\/>(Text about the history of the Cosmopolitan)<br\/><br\/>APEROL SPRITZ 2oz Spirit &amp; 3oz Sparkling 13<br\/>Aperol, sparkling wine, soda<br\/><br\/>GOLD RUSH 2oz Spirit 12<br\/>Bourbon, lemon, honey syrup<br\/><br\/>LIMONCELLO SPRITZ 2oz Spirit 13<br\/>Limoncello, soda, prosecco, lemon<br\/><br\/>HUGO SPRITZ 1.5oz Spirit 12<br\/>Elderflower, soda water, prosecco, mint, lime<br\/><br\/>EL DIABLO 1.5oz Spirit 12<br\/>Tequila Blanco, lime, cassis, ginger beer<br\/><br\/>ITALIAN GREYHOUND 1.5oz Spirit 13<br\/>Gin, Aperol, grapefruit juice, lime, simple syrup<br\/><br\/>MANHATTAN 2oz Spirit 13<br\/>Rye, sweet vermouth, Angostura Bitters<br\/><br\/>DARK &amp; STORMY 1oz Spirit 10<br\/>Lime, ginger beer, dark rum float<br\/><br\/>OLD FASHIONED 1.5oz Spirit 13<br\/>Bourbon, demerara syrup, Angostura Bitters<br\/><br\/>(Text about the history of the Old Fashioned)<br\/><br\/>WHITE LINEN 1.5oz Spirit 12<br\/>Gin, elderflower liqueur, lemon, cucumber, simple syrup, soda<br\/><br\/>LONG ISLAND ICED TEA 2oz Spirit 13<br\/>Vodka, gin, white rum, tequila blanco, lime, cola<br\/><br\/>CLASSIC COCKTAILS<br\/><br\/>wood chip smoked +2<br\/><br\/>HARVEY WALLBANGER 1.5oz Spirit 11<br\/>Vodka, galliano, orange juice<br\/><br\/>The Harvey Wallbanger cocktail emerged in the 1950s or early 1960s. It is most commonly attributed to Donato &quot;Duke&quot; Antone, a bartender in Los Angeles, who supposedly created the drink and named it after a local surfer named Harvey. The story goes that Harvey, after a few too many of the cocktails, would bump into walls on his way out of the bar, thus earning the drink its memorable name. The cocktail gained widespread popularity in the 1970s thanks to a successful marketing campaign by George Bednar, a marketing executive for McKesson Imports Company, the importer of Galliano. The campaign featured a cartoon character, Harvey Wallbanger, which helped cement the drink's place in popular culture.<br\/><br\/>AMARETTO SOUR 2.5oz Spirit 14<br\/>Amaretto, bourbon, lemon, simple syrup, egg white<br\/><br\/>PAPER PLANE 2oz Spirit 14<br\/>Bourbon, Aperol, amaro<br\/><br\/>CABLE CAR 2oz Spirit 13<br\/>Spiced rum, dry cura&#231;ao, simple syrup, lemon<br\/><br\/>MARTINI 3oz Spirit 14<br\/>Gin\/vodka, dry vermouth, orange bitters<br\/><br\/>According to historians and locals, the cocktail was invented in the mid-1800s during the California Gold Rush era. A miner, wishing to celebrate his luck in his search for gold, is said to have asked for champagne at a local bar to mark the occasion. The barman, not having any, insisted on creating a cocktail with the ingredients available at the time: gin, vermouth, bitters, maraschino liqueur, and lemon.<br\/><br\/>An emblem of sophistication and elegance, the Martini's allure only grew, becoming a staple of American culture. Its popularity soared in the mid-20th century, immortalized by icons such as James Bond. However, it was the 1960s that cemented the Martini's place in pop culture, thanks to the hit television series Mad Men. The show's lead character, Don Draper, often seen sipping a Martini, epitomized the cocktail's association with power, style, and the sophisticated yet tumultuous world of advertising. Mad Men reignited interest in the Martini, celebrating its role as a timeless symbol of mid-century glamour.<br\/><br\/>NEGRONI\/BOULEVARDIER 3oz Spirit 14<br\/>Gin\/Rye, Campari, sweet vermouth<br\/><br\/>Originated in Florence, Italy, in 1919. Count Camillo Negroni, seeking a stronger version of his favorite cocktail, the Americano, requested bartender Fosco Scarselli at Caff&#232; Casoni to replace soda water with gin. The result was a bold, balanced drink that quickly gained popularity. The Negroni's vibrant red hue and perfectly balanced bittersweet profile made it an instant classic. Over the decades, it has become a symbol of Italian aperitivo culture, celebrated for its simplicity and elegance. The cocktail's legacy endures, with countless variations and a dedicated global following, making it a timeless icon of refined taste and Italian sophistication.<br\/><br\/>DAIQUIRI 2oz Spirit 12<br\/>White rum, lime, simple syrup<br\/><br\/>MARGARITA 1.5oz Spirit 13<br\/>Tequila Blanco, triple sec, lime, simple syrup<br\/><br\/>GIN SMASH 2oz Spirit 12<br\/>Gin, fresh basil, lime, simple syrup, soda<br\/><br\/>TOM COLLINS 2oz Spirit 12<br\/>Gin, lemon, simple syrup, soda<br\/><br\/>FRENCH 75 2oz Spirit 3oz Sparkling 14<br\/>Gin, lemon, sparkling wine<br\/><br\/>The French 75 cocktail, or in French simply a Soixante Quinze, has a history as vibrant and explosive as its flavors. Named after the French 75mm field gun, renowned for its power and precision during World War I, this cocktail was said to be first concocted by English soldiers fighting in France during the First World War. These soldiers took the only raw ingredients they had on hand, allegedly, and combined gin, fresh lemon juice, sugar, and Champagne, 1  serving the whole concoction in a 75-millimeter artillery shell. &#160; <br\/><br\/>SPIRITS<br\/><br\/>VODKA<br\/><br\/>Polar Ice, Canada 9<br\/>Tito's, USA 10<br\/>Ketel One, Netherlands 10<br\/>Grey Goose, France 12<br\/>GIN<br\/><br\/>Tanqueray London Dry, England 9<br\/>Plymouth Gin, England 12<br\/>Reid's Spiced Gin, Ontario 12<br\/>Tanqueray Ten, England 13<br\/>Drumshando Gunpowder, Ireland 13<br\/>Reid's Navy Strength Gin, Ontario 12<br\/>Empress 1908, British Columbia 12<br\/>Isle of Harris, Scotland 21<br\/>RUM<br\/><br\/>Captain Morgan White\/Spiced\/Dark 9<br\/>Appleton Estate 8 Yr, Jamaica 11<br\/>Appleton Estate 12 Yr, Jamaica 12<br\/>El Dorado 12 Yr, Guyana 13<br\/>El Dorado 15 Yr, Guyana 18<br\/>TEQUILA\/MEZCAL<br\/><br\/>1800 Blanco\/Reposado 10<br\/>Teremana Reposado 14<br\/>Patron Silver 18<br\/>Don Julio Blanco\/Reposado 18<br\/>Mezcal Agua Santa 15<br\/>Clase Azul 40<br\/>NORTH AMERICAN WHISKEYS<br\/><br\/>J.P. Wiser's Special Blend, Ontario 9<br\/>Crown Royal, Manitoba 9<br\/>Forty Creek, Ontario 9<br\/>J.P. Wiser's 18 Yr, Ontario 21<br\/>Maker's Mark, Kentucky 12<br\/>Wild Turkey, Rare Breed, Kentucky 17<br\/>INTERNATIONAL WHISKEYS<br\/><br\/>Jameson, Cork 10<br\/>Green Spot, Cork 21<br\/>Nikka From the Barrel, Japan 16<br\/>Nikka Yoichi Single Malt, Japan 21<br\/>Glenfiddich 12 Yr, Speyside 18<br\/>Glenfiddich 15 Yr, Speyside 23<br\/>Lagavulin 16 Yr, Islay 28<br\/><br\/>WHITE &amp; ROS&#201;<br\/><br\/>JACKSON-TRIGGS CHARDONNAY (Canada)<br\/>6oz: 8<br\/>9oz: 11.5<br\/>750ml: 36<br\/>Cedar, pear, toast<br\/>J. LOHR RIVERSTONE CHARDONNAY (California)<br\/>6oz: 12.5<br\/>9oz: 17.5<br\/>750ml: 45<br\/>Citrus, nutty, pear<br\/>INNISKILLIN PINOT GRIGIO (Canada)<br\/>6oz: 12.5<br\/>9oz: 17.5<br\/>750ml: 45<br\/>Nutty, melon, citrus<br\/>SANTA MARGHERITA PINOT GRIGIO (Italy)<br\/>6oz: 12.5<br\/>9oz: 17.5<br\/>750ml: 45<br\/>White fruit, nutty, pear<br\/>JACKSON-TRIGGS SAUVIGNON BLANC (Canada)<br\/>6oz: 8<br\/>9oz: 11.5<br\/>750ml: 36<br\/>Citrus, green apple, herbal<br\/>KIM CRAWFORD SAUVIGNON BLANC (New Zealand)<br\/>6oz: 12.5<br\/>9oz: 17.5<br\/>750ml: 45<br\/>Passion fruit, gooseberry, herbal<br\/>WEGELER SLATE MOSEL TROCKEN RIESLING (Germany)<br\/>6oz: 14<br\/>9oz: 18<br\/>750ml: 50<br\/>Crisp pear, yellow apple, herbal<br\/>MER SOLEIL RESERVE CHARDONNAY (California)<br\/>6oz: 15<br\/>9oz: 20<br\/>750ml: 58<br\/>Tropical fruits, toast, vanilla<br\/>LA CREMA MONTEREY CHARDONNAY (California)<br\/>6oz: 13<br\/>9oz: 18<br\/>750ml: 50<br\/>Citrus, nutty, green fruit<br\/>STONELEIGH LATITUDE SAUV BLANC (New Zealand)<br\/>6oz: 13<br\/>9oz: 18<br\/>750ml: 50<br\/>Smoky, prune, cloves<br\/>DONNA GRETA PECORINO SUPERIORE (Italy)<br\/>6oz: 13.5<br\/>9oz: 17.5<br\/>750ml: 48<br\/>Citrus, fruits, toast<br\/>LES JAMELLES CHARDONNAY (France)<br\/>6oz: 9<br\/>9oz: 14.5<br\/>750ml: 40<br\/>Pear, hazelnut, oak<br\/>BOUGRIER VOUVRAY CHENIN BLANC (France)<br\/>6oz: 11<br\/>9oz: 16<br\/>750ml: 42<br\/>Tangerine, pear, smoky honey<br\/>L'ORANGERAIE ROS&#201; PAYS D'OC (France)<br\/>6oz: 9<br\/>9oz: 12<br\/>750ml: 33<br\/>Citrus, herbal, berry<br\/>FEATHERSTONE ROS&#201; 2023 (Canada)<br\/>6oz: 10.5<br\/>9oz: 14<br\/>750ml: 40<br\/>Candy apple, watermelon, beetroot<br\/>CAVES D'ESCLANS WHISPERING ANGEL ROS&#201; (France)<br\/>6oz: 14<br\/>9oz: 19.5<br\/>750ml: 55<br\/>Nutty, bread, plum<br\/>RED<br\/><br\/>JACKSON-TRIGGS CAB SAV (Canada)<br\/>6oz: 8<br\/>9oz: 11.5<br\/>750ml: 30<br\/>Berry, licorice, bread<br\/>JACKSON-TRIGGS MERLOT (Canada)<br\/>6oz: 8<br\/>9oz: 11.5<br\/>750ml: 30<br\/>Prune, chocolate, jam<br\/>CHATEAU STE. MICHELLE CAB SAV (Washington)<br\/>6oz: 12<br\/>9oz: 16<br\/>750ml: 42<br\/>Dark fruit, pepper, spice<br\/>PELEE ISLAND MERLOT (Canada)<br\/>6oz: 8<br\/>9oz: 11.5<br\/>750ml: 30<br\/>Toast, nutty, red fruit<br\/>TREANA CAB SAV 2020 (California)<br\/>6oz: 15<br\/>9oz: 21<br\/>750ml: 61<br\/>Dark berries, chocolate, all spice<br\/>J. LOHR SEVEN OAKS CAB SAV (California)<br\/>6oz: 12<br\/>9oz: 16<br\/>750ml: 45<br\/>Smoky, prune, vanilla<br\/>VILLA ANTINORI TOSCANA (Italy)<br\/>6oz: 13<br\/>9oz: 17<br\/>750ml: 46<br\/>Licorice, floral, nutty<br\/>THE BLACK CHOOK SHIRAZ (Australia)<br\/>6oz: 11.5<br\/>9oz: 15<br\/>750ml: 41<br\/>Smoky, cherry, leather<br\/>TRAPICHE RESERVE MALBEC (Argentina)<br\/>6oz: 12.5<br\/>9oz: 18<br\/>750ml: 45<br\/>Smoky, prune, cloves<br\/>CATENA MALBEC (Argentina)<br\/>6oz: 12.5<br\/>9oz: 18<br\/>750ml: 45<br\/>Smoky, prune, cloves<br\/>SANTA JULIA RESERVA MALBEC (Argentina)<br\/>6oz: 11<br\/>9oz: 16<br\/>750ml: 40<br\/>Plum, berry, honey<br\/>MAZZEI FONTERUTOLI NO. 10 2021 (Italy)<br\/>6oz: 12<br\/>9oz: 17<br\/>750ml: 42<br\/>Dark berries, savoury, herbal<br\/>BERONIA RESERVA (Spain)<br\/>6oz: 13<br\/>9oz: 17<br\/>750ml: 48<br\/>Red fruit, vanilla, cloves<br\/>ANNA MARIA ABBONA NEBBIOLO 2020 (Italy)<br\/>6oz: 15<br\/>9oz: 21<br\/>750ml: 60<br\/>Dark fruit, pepper, herbal<br\/>MOILLARD BOURGOGNE PINOT NOIR (France)<br\/>6oz: 13<br\/>9oz: 18<br\/>750ml: 50<br\/>Red cherries, violets, earthy<br\/>MCMANIS ZINFANDEL (California)<br\/>6oz: 12<br\/>9oz: 16<br\/>750ml: 43<br\/>Vanilla, cherry, black pepper<br\/><br\/>BEERS &amp; CANS<br\/><br\/>Running Stone 9<br\/>Bae's Haze 9<br\/>Border Run 9<br\/>Sultana Gold 9<br\/>Lakeside Kolsch 9<br\/>Channel Marker 9<br\/>Forgotten Lake 9<br\/>Coors Light 7<br\/>Coors Original 7<br\/>Budweiser 7<br\/>Bud Light 7<br\/>Stella 8<br\/>Heineken 8<br\/>Corona 8<br\/>Michelob Ultra 8<br\/>Somersby 9<br\/>Strongbow 9<br\/>White Claw 9<br\/>Vizzy 8.5<br\/>Bud Light Seltzer 8.5<br\/>DRAFT<br\/><br\/>ask your server about our featured taps -<br\/>Lakeside Kolsch 9<br\/>Sultana Gold 9<br\/>Rickards Red 9<br\/>Stella 10<br\/>Blue Moon 9<br\/>Bae's Haze 9<br\/>Border Run 9<br\/>Lakehead Light Lager 9<br\/>SHOOTERS<br\/><br\/>COOL COLADA 1oz Spirit 8 Pineapple vodka, coconut vodka, pineapple juice<br\/>GRASS HOPPER 1oz Spirit 8 Cr&#232;me de menth, cr&#232;me de cacao, light cream<br\/>KAMIKAZE 1oz Spirit 8 Vodka, orange liqueur, lime<br\/>CANDY CORN 1oz Spirit 8 Galliano, orange cura&#231;ao, cream<br\/>BEAM ME UP SCOTTY 1.5oz Spirit 9 Coffee liqueur, banana liqueur, Irish cream<br\/>RASPBERRY GIMLET 1oz Spirit 8 Vodka, Chambord, lime<br\/>ALABAMA SLAMMER 1oz Spirit 8 Amaretto, orange juice, sloe gin<br\/>VIVA PUFF 1oz Spirit 7 Raspberry Sour Puss, white cr&#232;me de cacao<br\/>",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "image4": "img4.webp",
    "image5": "img5.webp",
    "image6": "img6.webp",
    "image7": "img7.webp",
    "image8": "img8.webp",
    "image9": "img9.webp",
    "name": "Industry Social House, The"
}