{
    "name": "Portside Steak and Seafood Restaurant",
    "status": "",
    "link": "https://www.theprincearthurhotel.com/portside-restaurant/",
    "hours": "(Sunday - Saturday: 07:30-13:30, 17:00 - 20:00",
    "tel": "807-346-5139",
    "sms": "",
    "address": "17 Cumberland Street North",
    "map": "https:\/\/maps.app.goo.gl\/EspXyTc1aZJdLm579",
    "updated": "2026-01-28",
    "courtesy": "Justin Menu",
    "text": "
BREAKFAST MENU
<br>Toast options: White, brown & marble rye.
<br>CLASSIC BREAKFAST (CGF) | $14.25 Two Canada grade A eggs (choose your style) served with toast, home fries and your choice of bacon, ham or sausage.
<br>EGGS BENEDICT | $16.95 Two poached eggs on a toasted English muffin with grilled Canadian back bacon topped with hollandaise sauce. Served with home fries.
<br>STACK OF PANCAKES | $12.95 Three pancakes served with butter and syrup.
<br>PORTSIDE PLATTER | $17.95 Two eggs (choose your style) served with two strips of bacon, two sausages, two pancakes, toast, and home fries.
<br>CLASSIC FRENCH TOAST (CGF) | $13.25 Three slices of white bread dipped in egg and grilled golden brown. Add cinnamon egg blend | $0.95
<br>OATMEAL | $10.25 Steaming oatmeal with brown sugar on the side. Add slices of apple or cinnamon | $0.95
<br>BREAKFAST SANDWICH (CGF) | $14.95 Choice of brioche, bagel or English muffin with one large grade A egg, a sausage patty & cheddar cheese. Served with home fries.
<br>GRANOLA YOGURT PARFAIT (CGF) | $10.75 Layers of vanilla yogurt and seasonal fruits topped with granola. Served in a parfait glass.
<br>OMELETTES
<br>All Omelettes are $16.95 | Served with Home Fries & Toast. Additional toppings $0.95 each
<br>MUSHROOM & SWISS OMELETTE (CGF) Three fluffy eggs filled with sautéed mushrooms and Swiss cheese.
<br>WESTERN OMELETTE (CGF) Three fluffy eggs filled with bacon, tomatoes, green onions, sautéed peppers, and mixed cheese.
<br>DENVER OMELETTE (CGF) Honey ham, green onions, and melted cheese in a three egg omelette.
<br>CHEESE OMELETTE (CGF) Fluffy eggs stuffed with our blend of cheddar and mozzarella cheese.
<br>SIDES
<br>TOAST WITH PRESERVES | $4.75
<br>BAGEL WITH CREAM CHEESE | $5.25
<br>ENGLISH MUFFIN | $4.75
<br>CEREAL (CGF) | $6.25
<br>MUFFINS (CGF) | $4.75
<br>FRUIT BOWL (GF) | $9.25
<br>THREE BREAKFAST SAUSAGES | $5.95
<br>THREE SLICES OF BACON | $5.95
<br>TWO SLICES OF HAM | $5.95
<br>LUNCH MENU
<br>Lunch menu available starting at 11 AM.
<br>SALADS
<br>TACO SALAD | $20.75 Your choice of taco seasoned beef or chicken, served with fresh field greens, diced tomatoes, green onions, and pub style cheese mix.
<br>CRISPY CHICKEN RANCH SALAD | $19.25 Sliced crispy chicken tenders served on a bed of mixed salad greens, grape tomatoes, green onions, bacon, and cheese with ranch dressing.
<br>NEW COBB SALAD | $22.95 Iceberg lettuce topped with chicken, diced bacon, boiled egg, grape tomatoes, blue cheese, green onion and avocado. Served with Ranch dressing.
<br>NEW GREEK SALAD WITH SHRIMP | $22.95 Romaine lettuce topped with cucumber, grape tomatoes, black olives, green and red peppers, red onion, Feta cheese, & 5 shrimp sautéed in garlic butter. Served with Greek salad dressing.
<br>CAESAR SALAD (GF) | $16.95 Fresh crispy romaine lettuce tossed with bacon, parmesan cheese, croutons and creamy caesar salad dressing. Add extra chicken +$6.50
<br>NEW CHEF’S CALIFORNIA SALAD (GF) | $21.95 Mixed fresh field greens tossed with grapes, Monterey Jack cheese, strawberries, Mandarin wedges, and topped with chicken breast. Served with a raspberry vinaigrette dressing.
<br>HANDHELDS
<br>All handhelds served with your choice of fries or soup of the day. Add $2.95 to switch your side to a tossed salad or onion rings. Add $0.95 each to include an extra sauce/dressing.
<br>GRILLED CHEESE (CGF) | $10.50 Grilled white bread with two slices of medium cheddar cheese.
<br>CHICKEN CAESAR WRAP | $19.25 Grilled 6oz smoked applewood chicken, crispy fresh romaine lettuce, bacon, and parmesan cheese heat sealed in a 12 inch tortilla.
<br>SOUTHERN VEGGIE WRAP (V) | $19.25 Tortilla wrap with guacamole, salad mix, seasoned grilled tofu, salsa, green onions, diced tomatoes, cucumbers, and cheese blend.
<br>SWEET & SPICY THAI WRAP | $18.95 Crispy sliced chicken tenders served on a bed of mixed salad greens, topped with shredded carrots, diced tomatoes, green onions, and sweet & spicy Thai sauce.
<br>BLT (CGF) | $11.75 Classic toasted bacon, lettuce, tomatoes and mayo. Served on your choice of bread.
<br>BEEF OR CHICKEN TACO WRAP | $19.25 Taco seasoned beef or chicken with fresh field greens, diced tomatoes, green onions, and pub style cheese mix served in a tortilla with side salsa & sour cream.
<br>HONEY DILL & ALMOND CHICKEN WRAP | $18.95 Crispy sliced chicken tenders with spinach, diced tomatoes, green onions, toasted almonds, pub style cheese mix, and honey dill sauce.
<br>CALIFORNIA MELT (V, CGF) | $19.75 Prepared on a grilled ciabatta bun with guacamole, roasted red pepper, tomatoes, cucumbers, red onions, and topped with jalapeño jack cheese.
<br>PORTSIDE FAVOURITES
<br>All Portside favourites & burgers are served with your choice of fries or soup of the day. Add $2.95 to switch your side to a tossed salad or onion rings. Add $0.95 each to include an extra sauce/dressing.
<br>FAVOURITES
<br>NEW TERIYAKI NOODLE BOWL (CGF) | $21.95 Assorted Asian vegetables, choice of sliced chicken or beef - stir-fried together in a rich teriyaki sauce. Served over a bed of tender ramen noodles or Basmati rice.
<br>NEW BBQ FLATBREAD | $18.95 Grilled flatbread topped with BBQ sauce & homemade aioli sauce, sliced grilled chicken, crispy diced bacon, red and green onion & mozzarella cheese.
<br>PHILLY CHEESE STEAK (CGF) | $19.95 5oz thinly sliced tenderized beef braised au jus with sautéed peppers, mushrooms, and topped with pub style cheese mix.
<br>GRILLED REUBEN (CGF) | $19.25 Thin sliced Montreal smoked beef, tangy sauerkraut, Swiss cheese, and grainy dijon mustard. Served on grilled Texas marble rye.
<br>ROYAL CLUBHOUSE (CGF) | $19.25 Grilled applewood seasoned chicken breast, bacon, lettuce, tomatoes, sliced cheddar cheese, and mayo between three pieces of toasted bread.
<br>CHICKEN QUESADILLA | $19.25 Grilled tortilla smothered in melted pub cheese with tomatoes, green onions, and smoked applewood grilled chicken.
<br>CHICKEN FINGERS | $19.50 Five pieces of juicy, golden chicken tenders served deep fried with your choice of dipping sauce. (Plum, sweet & spicy thai, BBQ, honey mustard, teriyaki, or sweet & sour).
<br>BATTERED FISH | $19.95 Two pieces of Guinness beer battered cod cooked golden brown and served with coleslaw, tartar, and lemon.
<br>BURGERS
<br>CHEESE BURGER (CGF) | $19.95 Locally sourced 6oz beef patty topped with lettuce, tomatoes, red onions, and cheddar. Served on a toasted brioche bun with homemade aioli sauce. Add three slices of bacon | $5.95
<br>CHICKEN BURGER | $19.95 5oz golden breaded chicken breast topped with two strips of bacon, Swiss cheese, aioli sauce, tomatoes, and lettuce on a toasted brioche bun.
<br>NEW SMASH BURGER (CGF) | $21.95 Two smashed and grilled 3oz burger patties, with homemade chili sauce, cheddar cheese, pickles, lettuce, tomato & onion. Served on a grilled brioche bun. Add three slices of bacon | $5.95
<br>VEGGIE BURGER (V) | $19.95 Pure vegetarian burger topped with caramelized onions, sautéed peppers, goat cheese, fresh tomato, and lettuce. Served on a brioche bun with homemade aioli sauce.
<br>NEW ZACH’S SPECIAL (CGF) | $18.95 Grilled focaccia with grilled chicken, Swiss cheese, bacon, sautéed onions, mushrooms & garlic aioli.
<br>PASTAS
<br>Served with garlic toast.
<br>CHICKEN ALFREDO | $19.75 Al dente cooked fettucine pasta and sliced chicken breast tossed in a creamy rich Alfredo sauce. Sprinkled with parmesan cheese.
<br>PASTA PRIMAVERA (V, CGF) | $16.95 Al dente cooked penne pasta tossed with rich marinara sauce, seasonal vegetables, and parmesan cheese.
<br>PASTA & MEATBALLS (CGF) | $18.95 Spaghetti pasta with rich, tangy marinara sauce topped with parmesan cheese and five tasty meatballs.
<br>DINNER MENU
<br>Dinner Menu Available Starting 5PM
<br>APPETIZERS (15% OFF Wednesdays 5PM-8PM)
<br>CHICKEN WINGS (CGF) | $19.75 (Happy Hour: $16.80) One pound of chicken wings made in house. Your choice of salt & pepper, lemon pepper, hot & spicy, buffalo, BBQ, sweet & spicy Thai or teriyaki.
<br>CHEESE STICKS (V) | $10.95 (Happy Hour: $9.30) Six battered mozzarella sticks served with marinara dipping sauce.
<br>VEGGIE SPRING ROLLS (V, GF) | $8.25 (Happy Hour: $7.00) Six spring rolls served with plum sauce.
<br>NACHOS (GF) | $14.25 (Happy Hour: $12.10) Fresh made nachos topped with diced tomatoes, green onions, diced peppers, sliced black olives, and nacho cheese. Served with sour cream & salsa. Add ground beef or chicken | $6.00
<br>PIZZA (V, CGF) | $16.95 (Happy Hour: $14.40) 12 inch pizza | Flavours: Cheese, pepperoni, Canadian, or vegetarian. Additional toppings | $3.00 each
<br>NEW COCONUT BUTTERFLY SHRIMP (GF) | $12.95 (Happy Hour: $11.00) Six pieces of coconut crusted butterflied shrimp served with zesty seafood sauce and lemon.
<br>ENTRÉES
<br>All entrees include half portion of tossed salad, vegetable of the day and your choice of mashed potato, roasted potato, rice or fries.
<br>NEW PORK SOUVLAKI & MUSHROOM RISOTTO (GF) | $33.95 Two seasoned Souvlaki pork skewers served on a bed of creamy three mushroom risotto (Shitake, Oyster, Crimini). Served with seasonal vegetables and Tzatziki sauce.
<br>CRISPY SOUTHERN FRIED CHICKEN | $24.25 Three pieces of crispy southern fried chicken served with fries and coleslaw.
<br>8 OZ NEW YORK STEAK | $47.95 Flame broiled New York striploin seasoned with Montreal steak spice. Served with sautéed garlic buttered mushrooms and topped with three onion rings.
<br>8 OZ ATLANTIC SALMON | $39.95 Baked lemon pepper seasoned Atlantic salmon with smokey Hollandaise sauce, served with three pieces of buttered shrimp.
<br>BBQ RIBS (GF) | $37.95 (FULL) .. $29.95 (HALF) Slow cooked in house tender BBQ ribs.
<br>CHICKEN PARMESAN | $35.95 Golden brown panko breaded 6oz chicken breast topped with marinara sauce and shredded mozzarella cheese.
<br>GRILLED FRENCH CUT PORK CHOPS (GF) | $34.95 Seasoned flame broiled pork chop glazed with in-house Guinness dark ale BBQ sauce.
<br>LIVER & ONIONS | $29.95 Lightly floured and grill seared. Served with bacon and caramelized onion.
<br>PASTA
<br>LASAGNA | $21.95 A generous portion of zesty beef lasagna topped with parmesan cheese. Served with garlic toast & side caesar salad.
<br>GNOCCHI (V) | $17.95 Served in a rich creamy tomato pesto sauce and served with garlic bread.
<br>CHICKEN & BACON TORTELLINI | $26.50 Cheese filled tortellini served with grilled sliced chicken breast, diced bacon, and herbs, tossed in a creamy white wine sauce. Served with garlic toast.
<br>DESSERT MENU
<br>NY CHEESECAKE | $10.50 New York style cheesecake drizzled with your choice of topping and whipped cream. Toppings: raspberry, chocolate, caramel, or vanilla.
<br>CHEF’S CHOICE DESSERT | $8.25
<br>ICE CREAM (GF) | $4.50 Scoop of vanilla ice cream topped with your choice of raspberry, chocolate, caramel, or vanilla topping.
<br>GLUTEN-FREE CHEF’S CHOICE (GF) | $10.75
<br>FRUIT BOWL (GF) | $9.25
<br>RAINBOW SORBET (GF) | $4.50 Frozen dairy free fruit puree.
<br>BEVERAGES
<br>SOFT DRINK | $4.00
<br>JUICE | $4.00
<br>WATER BOTTLE | $4.00
<br>MILK | $4.75
<br>CHOCOLATE MILK | $5.25
<br>HOT CHOCOLATE | $4.95
<br>TEA | $3.75
<br>HERBAL TEA | $4.75
<br>COFFEE/DECAF COFFEE | $4.25
<br>KIDS MENU
<br>Available for ages 12 and under only.
<br>BREAKFAST
<br>PANCAKES & BACON | $9.75
<br>CEREAL & TOAST | $9.95
<br>CLASSIC BREAKFAST (CGF) | $10.75
<br>LUNCH & DINNER
<br>NEW MAC & CHEESE | $11.95
<br>FLATBREAD PEPPERONI PIZZA | $11.95
<br>CHEESE BURGER & FRIES | $13.75
<br>Legend: CGF Can Be Changed to Gluten-Free | GF Gluten-Free | V Vegetarian
"
}