{
    "link": "",
    "hours": "",
    "tel": "tel: 807-285-1144",
    "sms": "",
    "address": "Address: 377 Memorial Avenue",
    "map": "https:\/\/maps.app.goo.gl\/ymeQvYtG17gqzpbp9",
    "updated": "Updated: 2024-11-08",
    "courtesy": "Courtesy: Justin Menu",
    "text": "WINGS<br\/><br\/>Mix &amp; Match by the Pound: Served with veggie sticks &amp; your choice of Ranch or Blue Cheese dipping sauce.<br\/>Sauced: Mild, Medium, Hot, Suicide, Sriracha Honey, Louisiana Sweet Heat, Tequila Habanero, Honey Garlic, Sweet Chili, San Fransisco Spicy Garlic, Smoked Applewood, Roasted Red Pepper, Parmesan &amp; Herb, Dry Hot, Brazilian BBQ, West Coast Quake, All Dressed, Maple Bacon, Sour Cream &amp; Onion, Spicy Dill, Lemon Pepper<br\/>Dry: Seasoned, Salt &amp; Vinegar, Dill Pickle, Salt &amp; Pepper, Cajun, Smoked Applewood, Roasted Red Pepper, Parmesan &amp; Herb, Dry Hot, Brazilian BBQ, West Coast Quake, All Dressed, Maple Bacon, Sour Cream &amp; Onion, Spicy Dill, Lemon Pepper<br\/>LB: $14<br\/>2 LBS: $27<br\/>3 LBS: $40<br\/>4 LBS: $54<br\/>6 LBS: $68<br\/>8 LBS: $85<br\/>10 LBS: $135<br\/>12 LBS: $165<br\/>15 LBS: $200<br\/>20 LBS: $250<br\/>30 LBS: $450<br\/>40 LBS: $540<br\/>Extra Veggie Sticks: $3<br\/>Extra Dip: $1<br\/>APPY'S<br\/><br\/>Deep Fried Pickles: 8 Battered pickle spears served with ranch dip. $11<br\/>Onion Rings: A generous portion of thick cut onion rings. $9<br\/>Potato Skins: 6 potato skins filled with cheese, bacon and green onions. $11<br\/>Mushroom Caps: Half Pound of battered mushrooms served with Ranch dip. $11<br\/>Mozza Sticks: 8 Mozza sticks served with Ranch or Marinara dip. $11<br\/>Mini Burgers: 4 Homemade burgers topped with cheese, lettuce &amp; tomatoes. $11<br\/>Nachos Combo: Pick Any 3 for $28<br\/>NACHOS<br\/><br\/>Our nachos are served with your choice of 2 meat toppings &amp; cheese. $13<br\/>Meat Toppings: $3<br\/>Veggie Toppings: $2<br\/>Tomatoes, Green Peppers, Green Onions, Bacon, Ground Beef &amp; Chicken<br\/>Extra Cheese: $3<br\/>THE FAVOURITES<br\/><br\/>Fries and Gravy: A nude helping of fresh cut fries served with gravy. $5<br\/>Poutine: Fresh cut fries topped with cheese curds &amp; gravy. $10<br\/>Perogies: 1\/2 dozen of &quot;Baba's Best&quot; served with sauteed onions, bacon &amp; sour cream. $10<br\/>Veggie Plate: A generous platter of in-season veggies with ranch or blue cheese dip. $13<br\/>THE MAINS<br\/><br\/>All items below are served with choice of Fries, Caesar Salad or Greek Salad.<br\/><br\/>Shooter Burger: Homemade beef patty, thick cut onion rings &amp; our shooter sauce with lettuce &amp; tomato. $15<br\/><br\/>Club House: A triple decker sandwich layered with turkey, lettuce, tomato, bacon and cheese served on your choice of bread. $15<br\/><br\/>Wicked Chicken: 2 Deep fried white meat fillets topped with Havarti cheese, Sriracha Aioli, lettuce &amp; tomato. $14<br\/><br\/>Chicken Fingers: 4 Chicken fingers deep fried to a golden brown and served with plum sauce. $14<br\/><br\/>Hamburger: Homemade beef patty cooked to perfection, with lettuce &amp; tomato. $11<br\/><br\/>Add Cheese: $1<br\/><br\/>Add Bacon: $2<br\/><br\/>Maltese's Hot Italian: Locally made sausage served with sauteed peppers &amp; onions. $7<br\/><br\/>Add Fries: $3",
    "image0": "img0.webp",
    "name": "Shooter's Tavern"
}