{
"name" : "Arnikko's Pizzeria",
"status" : "",
"link" : "", 
"hours" : "(Sunday: 15:00 - 20:00), (Tuesday - Saturday: 11:00 - 21:00)", 
"tel" : "807-623-5966", 
"sms": "", 
"address" : "1501 Brown Street", 
"map": "https://maps.app.goo.gl/h4tpXc8daTkN4Kdr9", 
"updated" : "2025-11-26", 
"courtesy" : "Justin Menu",
"text" : "🍕 Annikko's Pizzeria Menu
<br>Pizza
<br>PEPPERONI & CHEESE A blend of cupping and flat pepperoni over classic mozzarella. $18.99
<br>
<br>CHEESE Nothing more to be said - simple and satisfying. $15.99
<br>
<br>CANADIAN EH Our version of a Canadian classic: mushrooms, onions, roasted peppers, bacon, shaved ham, and a drizzle of maple syrup. $22.99
<br>
<br>HULA HELL YOU THINK YOU ARE? HAWAIIAN?! Shaved ham & pineapple - sweet and salty in all the right ways. $19.99
<br>
<br>MEATLOVERS Shaved ham, pepperoni, bacon, beef crumble stacked to satisfy. $25.99
<br>
<br>THE STALLONE Italian sausage, salami, olives, roasted peppers, and ricotta. A heavyweight pie. $25.99
<br>
<br>VEGGIE PIZZA (HOUSE COMBO) Chef's choice of assorted house vegetables. $22.00
<br>
<br>THE WESTON DELUXE Homemade sausage, shaved ham, bacon, roasted peppers, onions, and olives. $22.99
<br>
<br>Slice & Can of Pop $6.50
<br>SOLD ALL DAY, EVERY DAY!
<br>
<br>Sides & Snacks
<br>HOT OLIVES A sautéed blend of Kalamata & green olives with peperoncinis. $5.99
<br>
<br>MEATBALL SUB Loaded with homemade meatballs and sauce on a toasted bun. $9.75
<br>
<br>MUFFULETTA SANDWICH Salami Mortadella Ham provolone & housemade olive tapenade on a toasted Roma Bakery Bun $9.75
<br>
<br>HOMEMADE MEATBALLS 3 for $5.99 8 for $16.99
<br>
<br>HOMEMADE PASTA SAUCE $12.99
<br>
<br>Available Toppings
<br>MEATS: Beef, sausage, pepperoni, bacon, salami, ham
<br>
<br>VEGGIES & MORE: Tomato, roasted peppers, onion, mushrooms, banana peppers, jalapeños, pineapple, green olives, black olives, ricotta, mozzarella
<br>
<br>Salads
<br>Fresh daily salads available - ask us what's fresh today! More menu items coming soon.
<br>
<br>Hours of Operation
<br>Sunday: 3:00 PM - 8:00 PM
<br>
<br>Monday: Closed
<br>
<br>Tuesday - Saturday: 11:00 AM - 9:00 PM
<br>
<br>Contact Us
<br>807-623-5966 1501 Brown St."
}