{
"name" : "Both Hands Wood-Fired Pizzeria & Bakery",
"status" : "pc",
"link" : "https://bothhandswoodfired.ca/", 
"hours" : "Rebranded to All Hands Bakery - No longer selling direct to the public", 
"tel" : "807-286-4263", 
"sms": "", 
"address" : "297 Park Avenue", 
"map": "https://maps.app.goo.gl/CcwvBEFPwwD4daY5A", 
"updated" : "2025-07-19", 
"courtesy" : "Justin Menu", 
"text" : "Pizza<br/>All of our regular crust pizzas are made on a thin sourdough crust made entirely from local Brule Creek Farms Flour, and topped with a blend of mozzarella and locally produced Thunder Oak Gouda. All pizzas come with 3 toppings and our cheese blend.<br/><br/>Our Favourites<br/>Park Avenue<br/>Pepperoni, Roasted Red Peppers, Pesto<br/>Gran Torino<br/>Italian Sausage, Hot Peppers, Green Olives<br/>Bohemian<br/>Ham, Bell Peppers, Goat Ch&#232;vre<br/>Angry Hawaiian<br/>Ham, Pineapple, Hot Peppers<br/>The G.O.A.T. (v)<br/>Sundried Tomatoes, Garlic, Bell Peppers, Goat Ch&#232;vre<br/>Rowan Tree Special<br/>Pepperoni, Bacon, Mushrooms, Green Olives, Goat Ch&#232;vre<br/>Plain Jane (v)<br/>Tomato Sauce, Cheese<br/>Fungus Among Us (v)<br/>Mushrooms, Green Olives, Onions<br/>Pricing<br/>Wood-fired pizza<br/>16&quot; Large Pizza<br/>$31.50<br/>Includes 3 toppings and our cheese blend.<br/><br/>Extra toppings $1.50<br/><br/>Wood-fired pizza<br/>11&quot; Medium Pizza<br/>$15.75<br/>Includes 3 toppings and our cheese blend.<br/><br/>Extra toppings $0.75<br/><br/>Wood-fired pizza<br/>Pizza by the Slice<br/>$8.00<br/>Choose a slice of one of our pre-made wood-fired pizzas.<br/><br/>Gluten-free pizza<br/>11&quot; Medium Pizza<br/>$16.75<br/>Our gluten free dough is made in house with organic buckwheat flour, organic corn flour, organic brown rice flour, guar gum and yeast.<br/><br/>Warning: These are made with out added gluten, but in a facility that uses gluten.<br/><br/>11&quot; Medium Pizza<br/>Frozen Pizza<br/>$15.75<br/>Our Frozen pizzas are pre-cooked and ready to be crisped up at home. They are available in house and at a number of local locations. You can find them at Agostinos Delhi &amp; Bakery, Georges Market, The Cheese Encounter, Superior Seasons Online Farmers Market, Kelly's Nutrition, and Maltese Grocery.<br/><br/>Available toppings<br/>Pepperoni<br/>Prosciutto<br/>Ham<br/>Double smoked bacon<br/>Italian sausage<br/>Pineapple<br/>Onions<br/>Mushrooms<br/>Bell Peppers<br/>Roasted red peppers<br/>Hot peppers<br/>Green olives<br/>Spiced eggplant<br/>Pesto<br/>Spinach<br/>Tomato<br/>Supreme<br/>Goat ch&#232;vre<br/>Feta cheese<br/>Bread<br/>Our sourdough and whole grain breads are made with organic flours or flour that is grown and milled locally. Our breads contain no dairy, no added fats or oils, and no sugar &#8211; pretty much just flour, water and salt.<br/><br/>Why sourdough? Unfermented grain is really difficult to digest. By fermenting our dough over a long period with a natural leaven, we make bread that is rich in flavour with nutrients that can be more easily absorbed by the body. Some people find that they can eat Both Hands Wood-Fired Pizzeria &amp; Bakery bread and feel great when conventional bread doesn&#8217;t agree with them. Our bread made with spelt flour is particularly suited for these folks. And, for those of you who think all this sourdough talk is health hyperbole, our Peasant Bread is a real crowd pleaser, and it is made with commercial yeast.<br/><br/>Pricing<br/>Yeasted<br/>Peasant Bread<br/>$6.75<br/>Our only yeasted bread. Peasant bread is our lightest, made with local Brule Creek sifted whole wheat flour, white flour, water, unrefined sea salt, yeast.<br/><br/>Sourdough<br/>Cranberry Sunflower<br/>$7.00<br/>A slightly sweet sourdough bread perfect for breakfast or a snack anytime. Made with local Brule Creek whole wheat flour, white flour, water, organic sunflower seeds, organic dried cranberries, unrefined sea salt.<br/><br/>Sourdough<br/>Cinnamon Raisin<br/>$7.00<br/>The classic with a whole grain twist. This slightly sweet sourdough bread will light up your Saturday. Made from organic spelt flour from a farm in Brandon, MB, water, organic Thompson raisins, organic cinnamon, unrefined sea salt.<br/><br/>Sourdough<br/>The Whole Hog<br/>$6.75<br/>Our hundred percent whole wheat sourdough bread, covered in delicious organic sesame seeds. Pure and simple. Made with local Brule Creek whole wheat flour, water, organic sesame seeds, unrefined sea salt.<br/><br/>Sourdough<br/>Spelt &amp; Flax<br/>$6.75<br/>Whole grain spelt and organic flax seed goodness. Our most appropriate bread for those who have a hard time digesting gluten. Made with organic spelt flour from a farm in Brandon, MB, water, organic brown flax seed, unrefined sea salt.<br/><br/>Sourdough<br/>Light Rye<br/>$6.75<br/>A rye and sifted whole wheat blend gives this sourdough a light rye taste with enough height and form to toast or turn into a sandwich. Brule Creek sifted whole wheat and rye flour, water, unrefined sea salt.<br/><br/>Sourdough<br/>100% Rye<br/>$6.75<br/>The real deal &#8211; rye flour only in this one. The rye starter used to leaven this bread gives it a unique sour flavour. Our only bread baked in pans, it's a righteous brick of a loaf. Brule Creek rye flour, water, unrefined sea salt.<br/><br/>Granolas<br/>1lb of granola<br/>Maple Crunch<br/>$12.50<br/>Our Maple Crunch granola is a made with organic rolled oats and seeds (pumpkin, sesame, sunflower), butter, and Ontario maple syrup.<br/><br/>1lb of granola<br/>Orange Cranberry<br/>$12.50<br/>Our Orange Cranberry granola is a made with organic cranberries, organic rolled oats and seeds (sunflower, sesame), butter, Ontario maple syrup, orange juice and zest."
}