{
    "status": "",
    "link": "",
    "hours": "(Tuesday - Thursday: 13:30 - 19:30), (Saturday - Sunday: 13:30 - 21:00)",
    "tel": "tel: 807-355-0116",
    "sms": "sms: 807-355-0116",
    "address": "Address: 84 Hull Avenue",
    "map": "https:\/\/maps.app.goo.gl\/g8hZpX4eWikLKo16A",
    "updated": "Updated: 2025-10-05",
    "courtesy": "Courtesy: Justin Menu",
    "text": "DishesBibimbapThin sliced beef, mushroom, spinach, onion, carrot, zucchini, paprika, and a sunny side-up egg. Served with rice and gochujang sauce (a spicy Korean red pepper sauce).CAD$18.50 - CAD$19.50Fried ChickenChicken wings is perfectly crunchy outside and deliciously juicy inside. (8 Pieces) Served with honey mustard dipping sauce.CAD$17.50Korean Sweet and Spicy Fried ChickenFried chicken coated with sweet and spicy Korean red pepper sauce (8 pieces)CAD$18.99Half & Half ChickenNot sure which chicken to try? You can try them both! Includes 5 pieces of fried chicken and 5 pieces of Korean sweet & spicy chicken.CAD$20.99Chicken & Egg Fried RiceStir-fried rice with chicken breast, green onion, carrot, eggs, and soy sauce for seasoning.CAD$17.50Chicken Wings & Drumsticks with ColeslawFried marinated chicken wings and drumsticks (8 pieces) coated with special sauce served with coleslaw. The wings are crispy on the outside, tender and juicy on the...CAD$19.50Kimchi Fried RiceFried rice, kimchi, ham, cremini mushroom, onion, carrot, green onion, sesame oil with sunny side up eggCAD$18.50Kimchi-Jjigae (Kimchi Stew) with RiceKimchi, pork, tofu, onion, mushroom, and green onion.CAD$20.50Jeyak Bokkeum (Spicy stir-fried pork)Thin marinated pork, onion, garlic, Korean hot pepper flakes, carrot, cabbage, green onion, and salad lettuce salad served with soy dressing. The dish is served with rice.CAD$20.50JapchaeSweet potato noodle stir-fried with vegetables* (beef optional) *The type of mushroom used could change depending on the supply.CAD$19.50 - CAD$20.50BulgogiThin marinated slices of beef, onion, green onion, carrot, mushroom, sesame seed, and sesame oil stir-fried with soy dressing. Served with rice or noodle.CAD$21.50Side DishRiceCAD$3.50KimchiHomemade Kimchi (4 oz)CAD$4.00Gluten-FreeGluten-Free BulgogiThin marinated slices of beef, onion, green onion, carrot, mushroom, sesame seed, and sesame oil stir-fried with gluten-free soy dressing. Served with rice or noodle. This...CAD$21.50Gluten-Free Jeyuk BokkeumThin marinated pork, onion, garlic, Korean hot pepper flakes, carrot, cabbage, green onion, and salad lettuce salad served with gluten-free soy dressing. The dish is...CAD$20.50Gluten-Free KimchiHomemade kimchi (4 oz.) made with gluten-free ingredients.CAD$4.50Gluten-Free BibimbapBeef, carrot, zucchini, mushroom, spinach, red paprika, beef or veggie. Served with gluten-free soy sauce dressing or gochujang (red pepper paste).CAD$19.50 - CAD$20.50Beverages",
    "image0": "img1.webp",
    "name": "Sunny's Kitchen"
}