{
"name" : "Aroma Bliss",
"status" : "",
"link" : "https://aromabliss.neocities.org", 
"hours" : "(Sunday: 12:00 - 00:00), (Monday - Thursday: 11:00 - 23:00), (Friday - Saturday: 12:00 - 00:00)", 
"tel" : "807-355-8585", 
"sms": "807-355-8585", 
"address" : "36 Cumberland Street South", 
"map": "https://maps.app.goo.gl/EmLfrVTSSxrRrNgw8", 
"updated" : "2025-09-18", 
"courtesy" : "DB!", 
"text" : "Appetizer
<br>Masala Papad
<br>Crispy fried Papad topped with a zesty mix of chopped onions, tomatoes, coriander, and spices. A perfect crunchy and flavorful starter!
<br>$4.99
<br>
<br>Roasted Papad
<br>Crispy and flavorful, roasted papad is the perfect crunchy snack to elevate any meal.
<br>$2.99
<br>
<br>Fry Papad
<br>Golden and crisp, fried papads adds a delightful crunch to your plate with every bite.
<br>$2.99
<br>
<br>Cactus cut potato with tandoori dip
<br>Crispy, thinly sliced cactus-cut potatoes seasoned to perfection, served with a tangy and spiced tandoori dip. A bold and zesty appetizer!
<br>$12.99
<br>
<br>Chicken Tandoori
<br>Flavorful Indian dish of marinated chicken roasted in a tandoor, bursting with smoky, spicy goodness.
<br>Half $16.99
<br>Full $22.99
<br>
<br>Chicken Malai Tikka
<br>Chicken Malai Tikka - creamy, tender grilled chicken with subtle spices.
<br>$17.99
<br>
<br>Paneer Tikka Masala
<br>Paneer Tikka Masala - spiced grilled paneer in a rich, tangy tomato gravy.
<br>$16.99
<br>
<br>Veg Curries
<br>Karai Paneer
<br>Savor the rich flavors of soft paneer cubes in a spicy tomato gravy, enhanced with bell peppers and onions. Served sizzling hot in a traditional karahi, perfect with naan or rice.
<br>$16.99
<br>
<br>Paneer Bhurji
<br>Scrambled cottage cheese cooked with onions, tomatoes, and aromatic spices, served hot. A flavorful North Indian delight, perfect with roti, Naan.
<br>$16.99
<br>
<br>Paneer butter masala
<br>Soft cottage cheese cubes simmered in a rich, creamy tomato gravy infused with aromatic spices, butter, and fresh cream. A classic North Indian delicacy, best enjoyed with naan or steamed rice.
<br>$16.99
<br>
<br>Paneer kaju masala
<br>A rich and creamy North Indian delicacy featuring soft paneer cubes and crunchy cashews simmered in a luscious, spiced tomato-based gravy. A perfect blend of flavors and textures, served with fresh herbs. Pairs perfectly with naan or rice.
<br>$16.99
<br>
<br>Paneer lavabdar
<br>A rich and creamy North Indian delicacy featuring soft paneer cubes simmered in a luscious tomato-based gravy, infused with aromatic spices, butter, and cashews. Served with a touch of cream for an indulgent experience. Perfect with naan or rice!
<br>$16.99
<br>
<br>Veg jaipuri
<br>A delightful medley of fresh vegetables cooked in a rich, aromatic gravy with a perfect blend of Rajasthani spices. The vibrant and flavorful dish offers a royal taste, capturing the essence of Jaipur's culinary heritage. Served with your choice of Indian bread or rice.
<br>$16.99
<br>
<br>Deluxe Curries
<br>Paneer Patiala
<br>A flavorful and spicy scrambled cottage cheese dish cooked with onions, tomatoes, and aromatic spices, served hot. Perfect with roti, paratha, or pav, it's a must-try for paneer lovers with a touch of spinach gravy.
<br>$17.99
<br>
<br>Paneer Pasanda
<br>A delicious medley of seasonal vegetables tossed in a rich, flavorful gravy, cooked on a hot tawa with aromatic spices. Served with fresh herbs and a hint of butter for an irresistible taste. Perfect with naan or rice!
<br>$17.99
<br>
<br>Malai Kofta (Sweet)
<br>Creamy, flavorful dumplings made from fresh paneer and potatoes, simmered in a rich, aromatic gravy. A perfect blend of spices for a truly indulgent experience.
<br>$17.99
<br>
<br>Jafrani Kofta (Spicy)
<br>Creamy, flavorful dumplings made from fresh paneer and potatoes, delicately spiced and simmered in a rich, flavorful gravy. A royal treat for your taste buds.
<br>$17.99
<br>
<br>Cheese Angoori
<br>A creamy, flavorful curry with cheese, simmered in a rich, aromatic gravy. Served with tender, soft dumplings of cheese, this dish is a perfect blend of richness and spice.
<br>$17.99
<br>
<br>Veg Hyderabadi
<br>Veg Hyderabadi
<br>A flavorful and spicy scrambled cottage cheese dish cooked with onions, tomatoes, and aromatic spices, served hot. Perfect with roti, paratha, or pav, it's a must-try for paneer lovers with a touch of spinach gravy.
<br>$16.99
<br>
<br>Veg tawa masala
<br>A delicious medley of seasonal vegetables tossed in a rich, flavorful gravy, cooked on a hot tawa with aromatic spices. Served with fresh herbs and a hint of butter for an irresistible taste. Perfect with naan or rice!
<br>$16.99
<br>
<br>Dal fry
<br>A rich and flavorful lentil dish made with slow-cooked yellow lentils, tempered with aromatic spices, garlic, and butter. Garnished with fresh coriander and served hot. Perfect with steamed rice or Indian bread.
<br>$14.99
<br>
<br>Dal tadka
<br>A classic North Indian dish made with yellow lentils simmered to perfection and topped with a flavorful tempering of ghee, cumin, garlic, and aromatic spices. This dish is a comforting blend of rich, earthy flavors. A perfect balance of spice and warmth, ideal for any occasion.
<br>$14.99
<br>
<br>Kathiyavadi
<br>Dhaba Style Sev Tameta
<br>A flavorful blend of tangy tomatoes cooked in aromatic spices, topped with crispy sev for the perfect crunch. A delightful and tangy treat for your taste buds!
<br>$14.99
<br>
<br>Kaju Kathiya
<br>Crispy and savory, Kaju Gathiya is a traditional Indian snack made with a blend of chickpea flour and cashews, deep-fried to perfection. A delightful crunch in every bite!
<br>$15.99
<br>
<br>Dudh Sev Bhaji
<br>A creamy and flavorful curry made with sev noodles, simmered in rich milk and aromatic spices. A comforting vegetarian dish, perfect with roti or rice.
<br>$14.99
<br>
<br>Lasaniya Bateka
<br>Lasaniya Bateka is a flavorful dish made with crispy potato patties, smothered in a tangy, aromatic garlic and spice sauce. A perfect blend of crunch and zest in every bite!
<br>$14.99
<br>
<br>Kaju Lasan
<br>Experience the perfect blend of rich, buttery cashews roasted to golden perfection and coated with aromatic garlic spices that awaken your taste buds. Kaju Lasan - a snack that's bold, crunchy, and unforgettable!
<br>$14.99
<br>
<br>Chicken Curries
<br>Butter chicken
<br>Creamy, spiced tomato gravy envelops tender chicken pieces, creating a rich and flavorful dish. Perfectly paired with naan or rice for a delicious meal.
<br>$17.99
<br>
<br>Karai chicken
<br>Spicy chicken cooked with bell peppers, onions, and tomatoes in a rich blend of aromatic spices
<br>$17.99
<br>
<br>Chicken Tikka Masala
<br>A symphony of smoky, tender chicken tossed in a rich, velvety sauce infused with bold spices and herbs - experience the classic comfort of Chicken Tikka Masala.
<br>$17.99
<br>
<br>Hakka Food
<br>Veg Manchurian Dry
<br>Crispy, golden-brown vegetable balls tossed in a savory, spicy Chinese-style sauce with a perfect balance of flavors. A delightful vegetarian appetizer for any occasion.
<br>$14.99
<br>
<br>Veg Manchurian Gravy
<br>Crispy mixed vegetables cooked in a savory, tangy gravy with a perfect blend of spices. A delightful, flavorful dish that pairs beautifully with rice or noodles.
<br>$15.99
<br>
<br>Hakka Noodles
<br>Savory stir-fried noodles tossed with fresh vegetables, aromatic spices, and a hint of soy sauce. A perfect balance of flavor and crunch!
<br>$14.99
<br>
<br>Fried Rice
<br>Fragrant stir-fried rice tossed with fresh vegetables, eggs, and savory seasonings. A perfect blend of flavors for a satisfying meal!
<br>$14.99
<br>
<br>Chinese Bhel
<br>Crispy noodles tossed with crunchy vegetables and zesty sauces, a perfect Indo-Chinese fusion snack. Spicy, tangy, and irresistibly delicious!
<br>$14.99
<br>
<br>Rice
<br>Jeera Rice
<br>Fragrant basmati rice tempered with cumin seeds, cooked to perfection for a light, aromatic side dish. A flavorful accompaniment to any curry or dish of your choice.
<br>$8.99
<br>
<br>Plain Rice
<br>Steamed white rice, perfectly cooked to a light, fluffy texture. A simple and delicious side dish to complement any meal
<br>$6.99
<br>
<br>Roti
<br>Tandoori Naan
<br>Soft, fluffy Naan baked to perfection in a traditional clay tandoor, offering a rich, smoky flavor and a golden, buttery finish. Perfectly paired with any curry or enjoyed on its own!
<br>$3.99
<br>
<br>Butter Naan
<br>Soft, fluffy butter naan baked to perfection in a traditional clay tandoor, offering a rich, smoky flavor and a golden, buttery finish. Perfectly paired with any curry or enjoyed on its own!
<br>$3.99
<br>
<br>Garlic Naan
<br>Soft, fluffy garlic naan baked to perfection in a traditional clay tandoor, infused with aromatic garlic and butter for an authentic taste. A classic, warm accompaniment to any dish.
<br>$4.49
<br>
<br>Tandoori Roti
<br>Tandoori roti is a traditional Indian flatbread cooked in a clay oven called a tandoor.
<br>$2.99
<br>
<br>Cheese Naan (AMUL CHEESE)
<br>Soft and crispy flatbread, perfectly cooked on a hot griddle.
<br>$5.99"
}