{
"name": "Prospector Steak House",
"link": "https://prospectorsteakhouse.com/prospector-steak-house",
"hours": "(Sunday - Thursday: 16:00 - 21:00), (Friday - Saturday: 16:00 - 22:00)",
"tel": "tel: 807-345-5833",
"sms": "",
"address": "Address: 27 Cumberland Street South",
"map": "https://maps.app.goo.gl/G7EFWmMt8vd7Wt9p9",
"updated": "Updated: 2026-01-31",
"courtesy": "Courtesy: Justin Menu",
"text": "
PROSPECTOR STEAKHOUSE
<br>STARTERS
<br>PRIME RIB MEATBALLS — $16 Reduced whisky sauce, w smeared garlic mashed potato.
<br>BACON WRAPPED SCALLOPS — $17 Six tender scallops wrapped in crispy bacon. (Gluten free option available)
<br>SHRIMP STUFFED SHROOMS — $16 Six mushroom caps stuffed w a special shrimp and cream cheese mix, then baked. (Gluten free option available)
<br>CALAMARI — $18 Crispy, tender calamari with red peppers, served with curry aioli and seafood sauce.
<br>SHRIMP AU GRATIN — $18 Six shrimp baked in garlic butter topped w cheese and served w garlic toast. (Gluten free option available)
<br>ESCARGOTS — $17 Six escargots in mushroom caps baked in garlic butter topped w cheese and served w garlic toast. (Gluten free option available)
<br>PANKO CRUSTED MOZZARELLA — $14 Hand breaded with marinara sauce.
<br>BBQ BRAISED BEEF POUTINE — $20 Fresh cut fries topped w prime rib braised in our house-made whiskey BBQ sauce, cheese curds, green onions, pickled onions and horseradish aioli.
<br>BRAISED PRIME RIB FLATBREAD — $21 Whisky BBQ braised prime rib, caramelized onions, honey drizzle and mozzarella cheese.
<br>PRIME RIB NACHOS — $23 House-made chips topped w braised prime rib, bacon, jalapenos, green onions, roasted red peppers, tomato, green olives, salsa, and sour cream. (Gluten free option available)
<br>HANDHELDS
<br>PRIME RIB DIP — $29 A beef dip made w our own shaved prime rib, caramelized onions, provolone cheese, arugula, and house-made horseradish aioli.
<br>SOUTHERN CHICKEN SANDWICH — $29 Southern style, hand breaded chicken breast, w bacon, arugula, roasted red peppers, mozzarella, pickles, w spicy aioli. ~ option for blackened chicken ~
<br>WHISKY BURGER — $31 4oz beef patty, braised whisky bbq pulled beef, bacon, provolone, arugula, pickles, horseradish aioli.
<br>BACON DOUBLE CHEESE BURGER — $29 Two 4oz beef patties, w cheese, bacon, lettuce, tomato, pickle, mayo, and frizzled onions.
<br>FROM THE SEA
<br>SEAFOOD THERMIDOR — $49 Scallops, pollock, and shrimp, all cooked in a white cream sauce, and served in a homemade bread bowl, topped with a cheese blend.
<br>GLAZED SALMON — $39 Salmon fillet w glazed lemon aioli sauce baked on a bed of rice and roasted onions. (Gluten free option available)
<br>SHRIMP DINNER — $39 Ten jumbo shrimp, breaded and served on a bed of rice.
<br>PICKEREL & CHIPS — $36 Beer battered pickerel w fresh cut fries, tarter, pickled vegetables. (Gluten free option available)
<br>all entrées include all you can eat, soup, salad, and Prospector buns.
<br>PRIME RIB
<br>SMALL CUT — 6OZ - $39 REGULAR CUT — 8OZ - $46 EXTRA CUT — 12 OZ - $56 (our most popular cut) OWNERS CUT — 14OZ - $64
<br>STEAK
<br>RIBEYE — $49 10 oz. lemon chive butter and frizzled onions.
<br>SIRLOIN — $49 8oz. mushroom and peppercorn sauce.
<br>NEW YORK OSCAR — $51 10oz. shrimp and scallop béarnaise sauce.
<br>FILLET MIGNON — MKT 8oz. our most tender cut, wrapped in smoked bacon.
<br>PASTA
<br>PASTA POMODORO — $32 Ground prime rib and beef meatballs, simmered in a savoury tomato sauce w fresh herbs, and spices.
<br>CHICKEN PARM — $36 Parmesan crusted chicken breast topped w house marinara and mozzarella, over fettuccine in a rose sauce.
<br>CARBONARA — $36 Fettuccini, cream sauce, roasted garlic, mushrooms, bacon, w pecorino romano cheese. Choice of chicken or shrimp.
<br>SIDES
<br>french fries, parmesan potato wedges, garlic mashed, baked potato, rice, or seasonal vegetables. ~ Loaded Potato $4, Twice Baked $4, Poutine $5, Onion Rings $5 ~
<br>PROSPECTOR BREWHOUSE HOME BREWS
<br>Pints(16oz) – 7 | Steins(20oz) – 9 | Tasting Flight – 9
<br>Padre Luchador - Light Mexican Lager: Unmask our lightly hopped and refreshing twist on a Mexican Lager. Made with barley, rice, corn malt, Chinook and Hallertau hops.
<br>Wall - IPA: A traditional IPA with rich malt, big on Cascade and Citra hops, and dark like the Northern waters where the elusive Walleye often strike.
<br>The Wild - Blueberry Wheat: For the hipster in us all, showcasing subtle blueberry flavour - a Northern Ontario treat. Brewed with wheat, malt, cascade hops, and blueberries.
<br>Teddy loves his Pilsner: Our unique take on a classic Czech style Pilsner. A slight, bread-like malt flavour, with some hop bitterness.
<br>Cumberland Light: Brewed with a light American lager in mind. This is likely our easiest drinking, most refreshing, light lager to date. A great summer beer.
<br>GUEST TAP Lakeside Kolsch, Lake of the Woods Brewing, Kenora
<br>NORTHERN ONTARIO CRAFT Support Local (473ml can) – 8.5
<br>Swing Bridge Blonde Ale, Manitoulin Brewing, Manitoulin Is.
<br>Border Run Cream Ale, Dawson's Trail Brewery, Thunder Bay
<br>Channel Marker Light, Lake of the Woods Brewing, Kenora
<br>Sultana Gold Pale Ale, Lake of the Woods Brewing, Kenora
<br>White Out Hazy IPA, Sleeping Giant Brewery, Thunder Bay
<br>Skull Rock Stout, Sleeping Giant Brewery, Thunder Bay
<br>Northern Logger, Sleeping Giant Brewery, Thunder Bay
<br>Heritage Dry Cider, West Avenue, Freelton, On.
<br>Crafty Elk Hard Juice, Thunder Bay, On. (Mango and Honey or Blueberry, Cranberry, and Acai)
<br>FEATURE: Porter of Prov, Manitoulin Brewing, Manitoulin Is.
<br>COCKTAILS
<br>Rum Punch - 14 Goslings Dark Rum, Campari, lime, lemon, orange, and pineapple juices (2oz)
<br>Strawberry Gin Sour - 13 Beefeater Gin, strawberry puree, lemon juice (1.5 Oz)
<br>Tequila Old Fashioned - 14 Hornitos Tequila, Agave syrup, bitters, Amarena cherry (2oz)
<br>Raspberry Tequila Sour - 13 Hornitos Tequila, Raspberry Sourpuss, Triple Sec, soda (2oz)
<br>Blueberry Mojito - 13 Empress Gin, Lambs Rum, mint, lime, blueberries, soda (1.5oz)
<br>The White Linen - 14 Cucumber Infused Plymouth Gin, St Germaine, lime juice, muddled cucumber, and soda. (2.5oz)
<br>Old Prospector - 14 Rittenhouse Rye Campari, Dry Vermouth, Grapefruit bitters. , (2.5oz).
<br>Bee's Knees 14 Empress Gin,, lemon juice, honey syrup (2oz)
<br>Pineapple jalapeño Margarita 14 Jalapeno Infused Tequila, Cointreau, lime juice, pineapple juice.. (2oz)
<br>Peach Moscato Sangria Brandy, Banrock Moscato - peach, orange, lemon juices - peaches and strawberries, with soda.
<br>MARTINI - 13
<br>Chocolate Martini - 13 Vanilla Vodka, Creme de Cacao, Rum Chata (3oz)
<br>Martinez - 13 Hendricks Gin, Luxardo Cherry Liquor, Blanc Vermouth (3oz)
<br>Espresso Martini Vanilla vodka, kahlua, creme de cacao, chilled espresso (3oz)
<br>WINE (Glass/Bottle)
<br>HOUSE WINES
<br>Lapin Bleu, Merlot, France. 9/32
<br>Corte Vigna, Pinot Grigio, Italy. 9/32
<br>RED
<br>La Mascota, Cabernet Sauvignon, Argentina. 12/39
<br>Leyda Reserva, Pinot Noir, Chile. 12/39
<br>Red Knott, Shiraz, Australia. 13/40
<br>Panizzi, Chianti Colli Senesi, Italy. 13/40
<br>Jasci & Marchesani, Montepulciano D'Abruzzo DOC, Italy. 14/42
<br>Tomas Cusine, Llebre, Tempranillo, Spain. 15/44
<br>WHITE
<br>Reif Estate, Riesling, Niagara on the Lake. 11/35
<br>Henry Of Pelham, Chardonnay, Niagara on the Lake. 12/39
<br>Jasci & Marchesani, Trebbiano D'Abruzzo DOC, Italy. 13/40
<br>White Cliff, Sauvignon Blanc, New Zealand. 13/40
<br>ROSE
<br>JP Azeitao, Syrah, Portugal. 8.5/32
<br>Banrock Station, Pink Moscato. Australia 9/33
<br>Celliers Des Princes Le Triporteur Rose, Rhone, France. 12/39
<br>BY THE BOTTLE
<br>2022 Piattelli Luján de Cuyo Reserve Malbec, Argentina. 40
<br>2022 Tomero, Malbec, Mendoza, Argentina. 44
<br>2021 Don't Tell Gary, Shiraz, Australia. 46
<br>2021 Clos de Luz Massal, Cabernet Sauvignon, Chili. 52
<br>2020 Umberto Cesari Liano, Sangiovese/Cabernet Sauvignon, Italy. 59
<br>2021 Castelvecchi Chianti Classico Capotondo, Sangiovese, Italy. 65
<br>2020 Tinta Fina, Tempranillo, Spain. 82
<br>2019 Sidewood Mappinga Shiraz, Australia. 90
<br>2021 Castello Romitorio, Romitorio Toscana IGT, Italy. 110
<br>2018 Castello Romitorio, Brunello Di Montalcino, Sangiovese, Italy. 190
<br>SPECIALTY COFFEE – 11
<br>Irish: Irish Whiskey
<br>Spanish: Kahlua and Rum
<br>Monte Cristo: Kahlua and Grand Marnier
<br>Blueberry Tea: Grand Marnier and Amaretto, served with orange slice
<br>DESSERT – 11
<br>Cheesecake Silky smooth vanilla cheesecake, whipped to perfection and served with your choice of house-made berry compote, rich caramel, or decadent chocolate sauce.
<br>Warm Apple Crisp Tender, cinnamon-kissed Granny Smith apples baked beneath a golden oat crumble, served warm with a scoop of creamy vanilla ice cream.
<br>Double Chocolate Brownie A rich, fudgy chocolate brownie drizzled with luscious dulce de leche and velvety coffee-infused chocolate sauce. Pure indulgence in every bite.
<br>Coffee or Tea – 3.75 Espresso – 3.75
"
}