{
    "link": "",
    "hours": "",
    "tel": "tel: 807-356-5524",
    "sms": "",
    "address": "Address: 635 Arthur Street West",
    "map": "https:\/\/maps.app.goo.gl\/3TbPAmzm4btKuvhN8",
    "updated": "Updated: 2025-01-20",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Hot Beverages<br\/><br\/>Masala Chai<br\/>$3.99<br\/>Spiced Indian tea blend with aromatic flavors, perfect for chai (tea) enthusiasts.<br\/>Bun Specials<br\/>Dabeli (Oil\/Butter)<br\/>$5.49<br\/>Spicy potato filling in a bun, garnished with tamarind chutney, pomegranate, sev, and peanuts. Choice of oil or butter.<br\/><br\/>Masala Bun Burger<br\/>$6.49<br\/>Spiced patty served between buns, typically includes a blend of Indian spices and sauces for a unique taste.<br\/><br\/>Cheese Masala Bun Burger<br\/>$7.49<br\/>A bun filled with a spicy mixture of cheese, onions, tomatoes, and aromatic Indian spices, creating a unique twist on the traditional burger.<br\/><br\/>Bun Samosa<br\/>$5.99<br\/>Crispy fried samosa filled with spiced potatoes and peas, sandwiched in a bun with tangy chutneys.<br\/><br\/>DC Special Jumbo Burger<br\/>$8.99<br\/>Jumbo-sized burger with a blend of paneer, aloo tiki, topped with cheese, fresh vegetables, and authentic Indian chutneys, served in a bun.<br\/>Extra Cheese<br\/>$0.99<br\/>Add extra cheese to your bun special for a richer, creamier experience.<br\/><br\/>Vada Pav (Oil)- 2 PCS<br\/>$8.99<br\/>Deep-fried spiced potato fritter sandwiched in a soft bun, typically complemented with tangy tamarind and spicy garlic chutneys.<br\/>Sandwich<br\/>Masala Toast Sandwich<br\/>$7.49<br\/>Toasted bread filled with a spicy mixture of mashed potatoes and peas, complemented by aromatic Indian spices and green chutney.<br\/>Cheese Masala Toast Sandwich<br\/>$7.49<br\/>Toasted sandwich filled with a spicy blend of mashed potatoes, peas, aromatic Indian spices, and melted cheese.<br\/>Veg Cheese Sandwich<br\/>$7.99<br\/>Layered with homemade green chutney, slices of tomato, cucumber, boiled potato, and capsicum, sprinkled with ground spices, and topped with cheese.<br\/>Veg Grill Cheese Sandwich<br\/>$7.99<br\/>Grilled bread layered with cheese, typically includes tomatoes, cucumbers, onions, green bell peppers, and a spread of green chutney.<br\/>Grilled Paneer Sandwich<br\/>$8.49<br\/>Grilled sandwich filled with marinated paneer, onions, capsicum, and a blend of Indian spices, complemented by a spread of green chutney.<br\/>Schezwan Cheese Sandwich<br\/>$8.99<br\/>Spicy schezwan sauce and melted cheese between slices of bread, typically accompanied by onions and bell peppers.<br\/>DC Special Club Sandwich<br\/>$9.99<br\/>Triple-layered sandwich with a special blend of vegetables, chutneys, and spices, typically includes cheese and is grilled to bring out the flavors.<br\/>Milkshake<br\/>Vanilla Milkshake<br\/>$4.79<br\/>Creamy Vanilla Shake, Blended to Perfection with Rich Ice Cream<br\/>Strawberry Milkshake<br\/>$5.49<br\/>Creamy Strawberry Milkshake- the perfect fruity indulgence<br\/>Strawberry Banana Milkshake<br\/>$5.99<br\/>A blend of ripe strawberries, creamy bananas, milk, and ice cream, creating a smooth and fruity beverage.<br\/>Chocolate Milkshake<br\/>$5.99<br\/>Decadent chocolate shake blended to perfection, a delightful treat for chocolate lovers and beyond.<br\/>Oreo Milkshake<br\/>$5.99<br\/>An indulgent milkshake blended with the classic flavors of Oreo cookies.<br\/>Lassi<br\/>Plain Lassi<br\/>$4.99<br\/>Traditional, smooth yogurt drink- perfectly tart and refreshing.<br\/>Mango Lassi<br\/>$5.99<br\/>Traditional Indian drink with mango and yogurt.<br\/>Rose Lassi<br\/>$5.99<br\/>Refreshing rose flavored yogurt smoothie.<br\/>Chat Specials<br\/>Pani Puri (Cold)<br\/>$4.99<br\/>Hollow, crispy puris filled with a spicy and tangy mixture, typically includes tamarind chutney, potato mash, and onion, served with flavored water.<br\/>Sev Puri<br\/>$6.99<br\/>Flat crispy puris topped with potatoes, onions, tamarind and green chutneys, and garnished with sev (crunchy gram flour noodles).<br\/>Bhel Puri<br\/>$7.49<br\/>Savory Indian street snack bursting with flavorful ingredients like puffed rice, tangy chutneys, and mixed vegetables.<br\/><br\/>Basket Chat<br\/>$7.99<br\/>Basket chat is a delightful assembly of crispy fried baskets filled with a mix of spiced chickpeas, potatoes, onions, and chutneys, typically garnished with fresh herbs",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "name": "Desi Chatko"
}