{
    "link": "",
    "hours": "",
    "tel": "tel: 807-623-1888",
    "sms": "",
    "address": "Address: 845 May Street North, Unit C",
    "map": "https:\/\/maps.app.goo.gl\/M8bhNWX9qMpSPBme6",
    "updated": "Updated: 2024-11-05",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Vietnamese Rice Noodle Soups - Pho<br\/>Rice noodles with your choice of beef, onions, and green onions.<br\/><br\/>Pho Tai (Rare Beef)<br\/>$21.50<br\/>Pho Nam (Rare Beef and Beef Flank)<br\/>$22.70<br\/>Pho Vien (Rare Beef and Beef Balls)<br\/>$22.70<br\/>Special Pho<br\/>Rare lean beef, flanked beef, and beef balls.<br\/><br\/>$23.90<br\/>Pho Tom Yum<br\/>Pho tom yum comes with sour and spicy soup, shrimp, and rare beef.<br\/><br\/>$23.90<br\/>Appetizers<br\/>Spring Rolls - Pork (2 pcs)<br\/>One order comes with two pieces.<br\/><br\/>$12.60<br\/>Vegetable Spring Rolls (2 pcs)<br\/>$12.60<br\/>Egg Rolls (2 pcs)<br\/>$12.60<br\/>Deep-Fried Wonton (16 pcs)<br\/>$20.30<br\/>Summer Rolls (2 pcs)<br\/>Shrimp and pork, and ice berg lettuce.<br\/><br\/>$12.60<br\/>Chicken Balls (12 pcs)<br\/>One order comes with twelve pieces.<br\/><br\/>$24.90<br\/>Riblets Side<br\/>$24.90<br\/>Bon Bon Spareribs (12 pcs)<br\/>One order comes with twelve pieces.<br\/><br\/>$26.90<br\/>Wonton Soups (Meat Broth)<br\/>Consomme Soup<br\/>$13.60<br\/>Special Wonton Soup<br\/>Wonton special comes with wonton, shrimp, BBQ pork, and vegetables.<br\/><br\/>$23.90<br\/>BBQ Pork Wonton Soup<br\/>Wonton soup with barbeque pork.<br\/><br\/>$16.70<br\/>Vegetable Wonton Soup<br\/>$21.50<br\/>Plain Wonton Soup<br\/>$19.10<br\/>Noodle Bowl - Bun Thit<br\/>Vietnamese Rice Noodle Bowl<br\/>Vietnamese vermicelli rice noodles topped up with lettuce, cucumber, carrot, pork spring roll, cashew, and protein.<br\/><br\/>$22.70<br\/>Com Tam<br\/>Com Tam<br\/>This traditional Vietnamese broken rice dish comes with steamed egg (+ have ground pork), cucumber, tomato, carrots, and a choice of meat. The fragmented\/fractured rice gives an umami flavor and texture due to its size.<br\/><br\/>$23.90<br\/>Asian Cuisines<br\/>Chicken Guy Ding<br\/>Carrot, broccoli, mushroom, red and green pepper, and celery.<br\/><br\/>$27.90<br\/>Day Jug Woey<br\/>Chicken, shrimps, BBQ pork, mixed greens, chicken ball, and wonton.<br\/><br\/>$29.90<br\/>Beef and Broccoli<br\/>$27.90<br\/>Black Bean Sauce Riblets<br\/>Red and green peppers, and black bean sauce.<br\/><br\/>$28.90<br\/>J.J. Chicken<br\/>Chicken, red peppers, green peppers, black bean sauce, and hoisin sauce.<br\/><br\/>$27.90<br\/>Sweet and Sour Shrimp<br\/>Sweet and sour shrimp comes with pepper, shrimp, celery, onion, and carrot.<br\/><br\/>$28.90<br\/>Shrimp and Lobster Sauce<br\/>Shrimp and lobster sauce comes with pepper, black bean sauce, egg pork, and shrimp.<br\/><br\/>$29.90<br\/>Lunch Special<br\/>The lunch special is available from 11:30 a.m. to 1:30 p.m.<br\/><br\/>Lunch Special<br\/>Chicken fried rice with one side.<br\/><br\/>$19.90<br\/>Combination Dinner<br\/>Dinner Combination 1<br\/>Chicken fried rice with two sides.<br\/><br\/>$23.90<br\/>Family Dinner<br\/>Dinner for Two<br\/>Dinner for two comes with two egg rolls, ten chicken balls, chicken chop suey, and chicken fried rice.<br\/><br\/>$49.10<br\/>Dinner for Three<br\/>Dinner for three comes with three egg rolls, twelve chicken balls, crispy wontons, chicken chop suey, and chicken fried rice.<br\/><br\/>$73.10<br\/>Dinner for Four<br\/>Dinner for four comes with four egg rolls, chicken balls, twelve bon bon spareribs, crispy wontons, chicken fried rice, beef, and greens.<br\/><br\/>$97.10<br\/>Dinner for Five<br\/>Dinner for five comes with five egg rolls, chicken balls, bon bon spareribs, two chicken fried rice, and two beef and greens.<br\/><br\/>$131.90<br\/>Dinner for Six<br\/>Dinner for six comes with six egg rolls, chicken balls, bon bon spareribs, crispy wontons, riblets side, two special fried rice, and two beef and greens.<br\/><br\/>$158.30<br\/>Noodles<br\/>Lo Mein<br\/>Lo mein comes with soft noodles, carrots, broccoli, celery, onion, bean sprouts, mushroom, and napa.<br\/><br\/>$26.29<br\/>Chow Mein<br\/>Chow mein comes with crispy noodles, carrots, celery, onion, bean sprouts, mushroom, and napa.<br\/><br\/>$26.29<br\/>Singapore Noodles<br\/>Singapore noodles come with shrimp, chicken, BBQ pork, carrot, pepper, onion, egg, bean sprouts, curry, and thin rice noodles.<br\/><br\/>$28.99<br\/>Pad Thai<br\/>Pad Thai comes with chicken, shrimp, egg, pepper, and bean sprouts.<br\/><br\/>$28.99<br\/>Shanghai Noodles<br\/>Shanghai noodles come with flat noodles, cabbage, pepper, shrimp, chicken, and BBQ pork.<br\/><br\/>$29.99<br\/>Cantonese Chow Mein<br\/>Cantonese chow mein comes with crispy noodles, carrot, broccoli, celery, onion, bean sprouts, mushroom, napa, shrimp, chicken, and BBQ pork.<br\/><br\/>$29.99<br\/>Cantonese Lo Mein<br\/>Cantonese lo mein comes with soft noodles, carrots, broccoli, celery, onions, bean sprouts, mushrooms, napa, shrimps, chicken, and barbeque pork.<br\/><br\/>$29.99<br\/>Stir Fried<br\/>Egg Foo Young<br\/>Egg foo young comes with napa, mushroom, celery, carrot, bean sprouts, onion, and egg.<br\/><br\/>$26.99<br\/>Chop Suey<br\/>Chop suey comes with napa, mushroom, celery, carrot, bean sprouts, and onion.<br\/><br\/>$26.29<br\/>Mixed Greens<br\/>Napa, broccoli, mushroom, and carrot.<br\/><br\/>$26.29<br\/>Curry<br\/>Broccoli, napa, mushroom, and carrot.<br\/><br\/>$26.29<br\/>Fried Rice<br\/>Fried Rice<br\/>Your choice of style.<br\/><br\/>$15.99<br\/>Special Fried Rice<br\/>Shrimp, pork barbeque, chicken, sprouts, and mushrooms.<br\/><br\/>$18.99<br\/>Drinks<br\/>Pop<br\/>$3.00",
    "image0": "img0.webp",
    "name": "Pho Umami"
}