{
"name" : "Neebing Roadhouse",
"status" : "",
"link" : "https://theneebing.com/", 
"hours" : "(Sunday - Wednesday: 16:00 - 23:00), (Thursday - Saturday: 12:00 - 00:00)",
"tel" : "tel: 807-475-3544", 
"sms": "", 
"address" : "Address: 2121 Highway 61", 
"map": "https://maps.app.goo.gl/AQ1WQRtpeDziQJ4u6", 
"updated" : "Updated: 2025-09-03", 
"courtesy" : "Courtesy: Salad Man", 
"text" : "Add side fries to any app for $3.50<br/>or side poutine $5.00<br/>or side salad $4.00<br/>or onion rings $4.00<br/>or sweet fries $4.50<br/><br/>Garlic Shrimp - 6 shrimp swimming in garlic butter and baked with a blend of mixed cheese. Served with garlic bread - $16.95<br/><br/>Popcorn Shrimp - A basket of Chipotle Mango seasoned popcorn shrimp. Served with House made Torpedo sauce - $13.95<br/><br/>THAI BITES - Fried chicken breast bites tossed in Sweet Thai sauce topped with chow mien noodles and green onion and sesame seeds - $15.50<br/><br/>Buffalo Chicken Dip - Spicy Chicken &amp; Cream Cheese Bake served with Tortilla Chips - $15.95<br/><br/>Dill Pickle Chips - Fried crisp and served with Cajun aioli - $11.95<br/><br/>Dry Ribs - Lightly dusted Pork ribs fried to a crispy golden brown. Served with Lemon and Cajun Aioli - $13.95<br/><br/>Neebing Firebombs - A Neebing original is back! Jalape&#241;os, bacon, and cheese, mixed into a potato hash. Fried crisp and served with sriracha and Cajun Aioli - $11.95<br/><br/>Bruschetta - Toasted garlic flat bread topped with house made bruschetta, feta cheese and balsamic glaze - $12.95<br/><br/>Fish Tacos - Beer-battered pickerel filet, pineapple-cilantro slaw, pico de gallo, sriracha glaze, three warm flour tortillas - $14.95<br/><br/>Crispy Cauliflower - Served with your choice of sauce. Mild, medium, hot, honey garlic, Chefs blend, Baton Rouge, Sweet chili or creamy garlic parm - $14.95<br/><br/>Cheese Curds - Beer soaked mozza curds battered and fried - $13.95<br/><br/>WINGS<br/><br/>CLASSIC WINGS - Thick &amp; juicy wings served with carrot sticks and your choice of ranch or blue cheese dip.<br/><br/>1 pound 14.95<br/>2 pounds 28.95<br/>CHECK OUT OUR NEW DRY RUB FLAVOURS.<br/><br/>Mango Habanero Dill Pickle Salt And Vinegar<br/>Ketchup All Dressed.<br/>NEEBING SAUCES<br/><br/>Mild Medium Hot Honey Garlic Chefs Blend<br/>Baton Rouge Sweet Chili Salt And Pepper<br/>Roasted Red Pepper &amp; Garlic Cajun<br/>Lemon Pepper Creamy Garlic Farm<br/>NACHOS<br/><br/>Add 4oz. Guacamole 2.00<br/>Extra Salsa or Sour Cream 1.50<br/>Extra Cheese 5.00<br/>Extra Bacon 2.50<br/>CHEESE NACHOS 17.95<br/><br/>ULTIMATE NACHOS<br/><br/>Loaded with bacon, cheese, diced tomatoes, jalape&#241;os and green onions 20.95<br/>PULLED PORK NACHOS<br/><br/>Our Ultimate nachos with BBQ pulled pork 22.95<br/>BUFFALO CHICKEN NACHOS<br/><br/>Loaded with bacon, cheese, jalape&#241;os, green onions and our signature buffalo chicken dip 23.95<br/>Awesome POUTINES with a Twist!<br/><br/>CLASSIC<br/><br/>Hand cut fries topped with cheese curds and mozzarella smothered with gravy 11.95<br/>ULTIMATE<br/><br/>The classic with bacon and green onions and Jalape&#241;os 14.95<br/>PULLED PORK<br/><br/>The classic with bbq pulled pork, bacon and green onions 15.95<br/>BUFFALO CHICKEN<br/><br/>Grilled chicken breast, buffalo dip, green onions, bacon and jalape&#241;os 16.95<br/><br/>Fresh Soups &amp; Salads<br/><br/>SOUP du JOUR: $5.95<br/><br/>FRENCH ONION SOUP: $9.50<br/><br/>French bread sliced and grilled golden brown.<br/>without cheese: 1 slice 1.95 3 slice 5.95<br/>with cheese: 1 slice 2.75 3 slice 7.45<br/>NEEBING'S ALL INCLUSIVE: $12.95<br/><br/>Daily soup, garlic toast and choice of side Caesar or Neebing greens. Sub French onion soup 16.95<br/>CAESAR SALAD: Full size 14.00 &#189; size 8.95<br/><br/>Add chicken Breast 7.00<br/>Add half a dozen shrimp 7.00<br/>BLACKENED CHICKEN CAESAR SALAD: $22.95<br/><br/>Served warm, with Blackened Chicken and saut&#233;ed peppers and onions. Sub blackened shrimp 22.95<br/>SIRLOIN STEAK SALAD: $23.95<br/><br/>Fire grilled 5 oz AAA Canadian Sirloin. Served on baby greens with goat cheese, tomato, roasted red pepper and sweet red onion. Drizzled with Balsamic Glaze.<br/>MEDITERRANEAN GREEK SALAD: $22.95<br/><br/>Cucumbers, tomatoes, red onion, peppers and olives over Spring greens with Feta cheese. Your choice of Grilled or Crispy chicken. Served with a warm Pita Bread 22.95<br/>sub shrimp 22.95<br/>ORIENTAL CHICKEN SALAD: $21.95<br/><br/>Mixed greens topped with Crispy Asian noodles, toasted almonds, cucumber and carrot. Choice of Grilled or Crispy chicken 21.95 sub shrimp 21.95<br/>Juicy Burgers<br/><br/>Our 6oz patties are made only from fresh AAA Canadian Angus Chuck. All Burgers are topped with lettuce, tomato and pickles.<br/><br/>Burgers Platters are served with choice of French Fries, Soup or Neebing Greens. Substitute Onion Rings, Sweet Potato Fries or Caesar for 3.50. Upgrade to French Onion Soup 4.00 Add gravy 2.00 Extra patty 5.00<br/><br/>CLASSIC BURGER: $16.00<br/><br/>add cheddar 1.50 add bacon 2.00<br/>THE NEEBING BURGER: $19.95<br/><br/>40 years and counting. Topped with Black Forest ham, cheddar and fried onions.<br/>THE RAGING BULL: $19.95<br/><br/>A spicy patty with jalape&#241;os, bacon and cheddar<br/>THE GHOST OF HIGHWAY 61: $21.95<br/><br/>A spicy patty with cheddar, bacon and our house made Ghost pepper-onion jam. Topped with an over easy egg (warning: this burger is VERY spicy!!)<br/>HIGHWAY 61: $20.95<br/><br/>Cheddar, bacon, fried egg and frizzled onions<br/>THE BIG ROADIE: $25.00<br/><br/>Double patty, double cheese, double bacon<br/>BOURBON BLUE: $21.95<br/><br/>Topped with fried onions, bacon, bourbon and Dijon aioli and blue cheese<br/>BLUEBERRY CHEVRE: $21.95<br/><br/>Blueberry compote, goat cheese, frizzed onions<br/>ALPINE BURGER: $20.95<br/><br/>Mushrooms, fried onions, bacon and Swiss cheese<br/>BEYOND BURGER: $19.95<br/><br/>A plant-based patty with crisp lettuce, tomato and pickles<br/><br/>Available after 5pm<br/><br/>We Use Fresh, Never Frozen Manitoba Poultry &amp; Alberta AAA Beef<br/><br/>Served with your choice of fresh cut fries, Mashed potato or Baked potato (upgrade to loaded baked for 3.00) onion rings, sweet potato fries and Chef's Choice of vegetables.<br/><br/>Add side Dinner Greens or Caesar salad to any entree for 4.00<br/><br/>CLASSIC NEW YORK<br/><br/>AAA 12 oz. grilled to your specs 39.00<br/>add sauteed shrimp 7.00, add mushrooms 4.00<br/>MUSHROOM CHICKEN<br/><br/>Twin baked chicken breasts topped with a creamy white wine mushroom sauce 30.00<br/>BAKED SALMON<br/><br/>Atlantic salmon filet baked with blueberry maple syrup 31.00<br/>STUFFED YORKIE<br/><br/>10 oz of Braised prime rib, stuffed in a large Yorkshire pudding. Topped with red wine jus 26.00<br/>NEEBING PRIME RIB<br/><br/>12 oz cut AAA aged slow cooked prime rib served with Yorkshire au jus. (Available Thursday, Friday and Saturday after 5pm) 46.00<br/>Tantalizing PASTA<br/><br/>Served with garlic bread<br/><br/>CHICKEN PARMESAN<br/><br/>A crispy chicken breast baked till golden brown and topped with mozzarella cheese. Served on fettuccini with marinara 24.95<br/>MAC &amp; CHEESE<br/><br/>Our Chefs own 3 cheese sauce 16.95<br/>add pulled pork 5.00<br/>add buffalo chicken 7.00<br/>Loaded (bacon, tomato, jalape&#241;os, green onion) 6.00<br/>&#189; dozen shrimp 7.00<br/>FETTUCCINE ALFREDO<br/><br/>House made with parmesan in a creamy, garlic &amp; white wine sauce 17.95<br/>add chicken breast 7.00<br/>add shrimp 7.00<br/>CREAMY CARBONARA<br/><br/>House made with parmesan in a creamy garlic &amp; white wine sauce with bacon 19.95<br/>add chicken breast 7.00<br/>add shrimp 7.00<br/>Thin Crust PIZZA<br/><br/>Pies are made in house on a 15&quot; thin crust.<br/><br/>Available after 4pm.<br/><br/>MOZZARELLA CHEESE PIZZA 20.50<br/><br/>NEEBING DELUXE<br/><br/>Pepperoni, sausage, ham, bacon, peppers, mushrooms and onions 23.95<br/>MEATLOVERS<br/><br/>Pepperoni, sausage, bacon, ham and mozzarella 24.95<br/>MAUI WOWI<br/><br/>Ham, sausage, bacon, pineapple, mozzarella and cheddar 24.95<br/>NEEBING WHITE OUT<br/><br/>Garlic and parmesan cream sauce, mozzarella, chicken, bacon, mushrooms, and onions 24.95<br/>BUFFALO CHICKEN PIZZA<br/><br/>Chicken, bacon, green onions, mozzarella cheese on a buffalo ranch base 25.95<br/>CANADIAN<br/><br/>Pepperoni, bacon, mushrooms, and mixed cheese 23.95<br/>DILL PICKLE<br/><br/>Creamy garlic base, dill pickles, mozzarella and parmesan cheese 21.95<br/>Add Toppings (2.50 Per Topping)<br/><br/>Pepperoni, Bacon, Ham, Sausage, Grilled Chicken Breast, Ground Beef, Pulled Pork, Mushrooms, Jalape&#241;o, Green Peppers, Tomatoes, Roasted Red Pepper, Pineapple, Green Olives, Black Olives, Garlic<br/><br/>Extra: Feta, mozzarella/cheddar blend, mozzarella 4.00<br/><br/>Neebing Favourite - New Menu Item<br/>Vegetarian Item<br/><br/>All Kids Meals $9.95 Includes Kids Drink<br/><br/>PEP &amp; CHEESE PIZZA<br/><br/>BURGER &amp; FRIES<br/><br/>CHICKEN TENDERS &amp; FRIES<br/><br/>ROADY'S BOW TIE PASTA<br/><br/>Choice of Marinara, Cheddar Cheese Sauce, Alfredo or Garlic Butter<br/>GRILLED CHEESE &amp; FRIES<br/><br/>DESSERT<br/><br/>VANILLA ICE CREAM SUNDAE<br/>(Chocolate, strawberry or caramel) $3.95<br/>Substitute Fries for Caesar or Greens Salad<br/>Delicious DESSERTS<br/><br/>AUNTY EMM'S CHEESECAKE<br/>Ask your server for daily flavours. $9.95<br/>CHOCOLATE BROWNIE<br/>Served warm with a scoop of ice cream. $7.95<br/>APPLE CRISP<br/>Stuffed full of wedged apples within a coconut cinnamon streusel. Topped with caramel sauce and a scoop of vanilla ice cream. $8.95<br/>Refreshing BEVERAGES<br/><br/>Bottomless Coffee or Tea: $3.50<br/>Bottomless Fountain Pop: $3.95<br/>Milk 2% or Chocolate: $4.25<br/>Red Bull: $4.95<br/>Hot Chocolate: $4.50<br/>Fountain Juice: $3.95<br/>Apple Juice: $3.95<br/><br/>COCKTAILS<br/><br/>Classic Cocktails<br/><br/>NEEBING CAESAR<br/><br/>Vodka, Motts Clamato, pickle &amp; pickled green bean, rimmed with Irad. spices.<br/>GREYHOUND<br/><br/>Hendricks Gin and grapefruit juice garnished with an orange slice.<br/>WHISKEY SOUR<br/><br/>Rye, lemon juice, simple syrup &amp; bitters<br/>MOSCOW MULE<br/><br/>Vodka, Ginger Beer, lime juice, garnished with a lime wedge.<br/>DARK 'N STORMY<br/><br/>Captain Morgan's dark rum, ginger beer, splash of bar lime and a lime wedge.<br/>MIKE FORESTER<br/><br/>Captain Morgan's Spiced Rum &amp; Diet Coke.<br/>NEEBING<br/>* 1L of Naked Grape Sangria $32<br/>* Premium with Blackberry Somersby<br/><br/>MONKEY'S LUNCH<br/>* Banana Liqueur, Kahlua &amp; Milk<br/><br/>RASPBERRY ICECUBE<br/>* Raspberry Vodka, Icebox Long Island, lime juice &amp; Pepsi<br/><br/>APEROL SPRITZ<br/>* Aperol, Prosecco &amp; a splash of soda garnished with an orange slice<br/><br/>WHITE FREEZIE<br/>* Banana liqueur, Raspberry Sourpuss &amp; 7up<br/><br/>SPICY PALOMA<br/>* Tequila Blanco, Aperol, lime, simple syrup, grapefruit juice, jalapeno topped with Fresca and a Tajin rim.<br/><br/>CLASSIC/RASPBERRY MOJITO<br/>* White rum, raspberry vodka, muddled mint, raspberries, club soda, simple syrup.<br/><br/>POMEGRANATE MARGARITA<br/>* Tequila, Triple Sec, lime juice, pomegranate juice. Served in a sugar rimmed glass.<br/><br/>CUCUMBER FIZZ<br/>* Gordon's gin, club soda, lemonade, mint &amp; cucumber<br/><br/>PASSION PUNCH<br/>* Vodka, Chambord, pineapple juice and a splash of lime.<br/><br/>HIGH BALLS<br/><br/>BAR RAIL $6.29<br/>SPECIAL PREMIUMS $7.29<br/>DRAMBUIE &amp; GM $8.99<br/>COOLERS<br/><br/>SMIRNOFF ICE &amp; MIKE'S HARD $7.99 ea.<br/>Seltzer Ice - $7.99<br/>Simply Spiked Cherry (355ml - $7.49)<br/>Simply Spiked Peach (355ml-$7.49)<br/>Half &amp; Half Peach Tea<br/>Papaya Passionfruit<br/>Blackberry Lemon<br/>Blueberry Pomegranate<br/>ARIZONA HARD TEA $7.99 ea.<br/>* Green Tea<br/>* Peach Tea<br/><br/>SPECIALTY COFFEES<br/><br/>HOT DIRTY BANANA $8.99 ea.<br/><br/>Banana Liqueur, Kahlua<br/>SNOW CAP $8.99 ea.<br/><br/>Vanilla Vodka, Frangelico, Raspberry Garnish<br/>ROYAL IRISH $8.99 ea.<br/><br/>Crown Royal, Baileys<br/>NUTTY IRISHMAN $8.99 ea.<br/><br/>Jameson, Frangelico<br/>HOT SHOT $8.99 ea.<br/><br/>Patron, Baileys, Mint Garnish<br/>RASPBERRY TRUFFLE $8.99 ea.<br/><br/>Vodka, Kahlua, Chambord<br/>BOTTLED BEER<br/><br/>DOMESTIC $6.29<br/>IMPORTED $7.29<br/>PREMIUM $7.29<br/>SPECIAL PREMIUMS $7.99<br/>PUB CANS $6.99<br/>Sub Zero on TAP<br/><br/>COORS &amp; CANADIAN $4.49<br/>GLASS $6.49<br/>20 OZ. GLASS $8.69<br/>32 OZ. MUG $10.99<br/>60 OZ. PITCHER $19.99<br/>BEER on TAP<br/><br/>12 OZ. GLASS $6.99<br/><br/>20 OZ. GLASS $9.49<br/><br/>32 OZ. MUG $11.99<br/><br/>60 OZ. PITCHER $21.99<br/><br/>HEINEKEN, Guinness $7.99<br/><br/>LOCAL BEER $8.99<br/><br/>Sleeping Giant: 20 Pale Ale, Northern Logger, 360 Pale Ale, White Out, Skull Rock Stout, Beaver Duck, Mr. Canoehead<br/>Lake of the Woods: Lakeside Pilsner, Channel Marker, Sultana Gold Ale, Nautical Disaster Pale Ale<br/>WINE<br/><br/>WHITE<br/><br/>6 oz. $8.29 / 9 oz. $11.99 / Bot. $38<br/>Jackson Triggs Chardonnay<br/>Barone Montalto Pinot Grigio<br/>Open Riesling<br/>Santa Margherita Pinot Grigio<br/>Toasted Head Chardonnay<br/>Kim Crawford Sauvignon Blanc<br/>RED<br/><br/>6 oz. $8.29 / 9 oz. $11.99 / Bot. $38<br/>Jackson Triggs Cabernet Sauvignon<br/>Bodega Toro Malbec<br/>McGuigan Shiraz<br/>Ravenswood Zinfandel<br/>Tom Gore Cabernet Sauvignon<br/>Bread and Butter Pinot Noir
<br> The following items are part of a 'GLUTEN FREE' menu.
<br>Small Plates & Bar Snacks
<br>
<br>Cheese Nachos 17.95
<br>Ultimate Nachos Loaded with bacon, diced tomatoes, green onion, jalapeno and cheese 20.95
<br>Pulled Pork Nachos Our ultimate nachos with bbq pulled pork 22.95
<br>Buffalo Chicken Nachos Loaded with chicken, bacon, green onions, jalapeno, our signature buffalo sauce and cheese. 23.95
<br>French Fries Basket 7.50 Au Jus 2.00
<br>One Pound Wings 14.95 Mild, medium, hot, sriracha, honey garlic, chefs blend, Cajun, BBQ, Salt & Pepper, roasted garlic and pepper, creamy garlic & parmesan
<br>Two Pound Wings 28.95 Mild, medium, hot, sriracha, honey garlic, chefs blend, Cajun, BBQ, Salt & Pepper, roasted garlic and pepper, creamy garlic & parmesan
<br>Dip Flight
<br>Chipotle mango seasoned waffle fries. Served with dilly dip, guacamole and hummus 15.95
<br>
<br>For all Poutines, gravy will be substituted with beef Jus
<br>Classic Poutine
<br>hand cut fries topped with cheese curds and mozzarella 11.95
<br>Ultimate Poutine
<br>The classic with bacon and green onions and jalapenos 14.95
<br>Pulled Pork Poutine
<br>The classic with bbq pulled pork, bacon and green onions 15.95
<br>Buffalo Chicken Poutine
<br>Grilled chicken breast, buffalo dip, green onions, bacon and jalapenos 16.95
<br>
<br>Fries and Corn tortillas are fried in the same grease as items that contain gluten
<br>
<br>NEEBING ROADHOUSE
<br>
<br>Salads (ASK ABOUT OUR SOUP OF THE DAY)
<br>Caesar Salad 'No croutons' Full size 14.00 1/2 size 8.95 Add chicken Breast 7.00 Add half a dozen shrimp 7.00
<br>Blackened Chicken Caesar Salad 'No croutons' Served warm, with Blackened Chicken and sautéed peppers and onions. 22.95 Sub Blackened shrimp 22.95
<br>Sirloin Steak Salad 5 oz Sirloin, Served on baby greens with goat cheese, tomato, roasted red pepper and sweet red onion. Drizzled with Balsamic Glaze 22.95
<br>Oriental Chicken Salad 'No noodle' Mixed greens topped with toasted almonds, cucumber and carrot. Choice of Grilled or Crispy chicken 21.95
<br>Chicken Club Burger
<br>Grilled chicken breastin a lettuce wrap with tomato cheddar and bacon 18.95 Make it a Buffalo Chicken Burger 19.95
<br>
<br>Fries and Corn tortillas are fried in the same grease as items that contain gluten
<br>
<br>NEEBING ROADHOUSE
<br>
<br>Large Plates (available after 5pm)
<br>Served with your choice of Fresh cut fries, Mashed potato or Baked potato (upgrade to loaded baked for 3.00) onion rings, sweet potato fries and Chefs Choice of vegetables. Add side Dinner Greens or Caesar salad to any entree for 4.00
<br>Classic New York... AAA 12 oz grilled to your specs.....39.00 add sauteed shrimp 7.00 add mushrooms 4.00
<br>Mushroom Chicken... Twin baked chicken breasts topped with sautéed white wine mushroom sauce 30.00
<br>Baked Salmon... Atlantic Salmon fillet; baked and basted with Canadian Maple/ Blueberry Syrup 30.95
<br>Neebing Prime Rib.. 12 oz cut AAA aged slow cooked prime rib served with Yorkshire au jus. (Available Thursday, Friday and Saturday after 5pm) 46.00
<br>Vanilla Ice Cream 5.95
<br>Vanilla Ice Cream with Chocolate, strawberry or Caramel sauce",
"image0" : "img0.webp",
"image1" : "img1.webp",
"image2" : "img2.webp",
"image3" : "img3.webp",
"image4" : "img4.webp",
"image5" : "img5.webp",
"image6" : "img6.webp"
}