{
    "link": "",
    "hours": "",
    "tel": "tel: 807-344-7660",
    "sms": "",
    "address": "Address: 32 St. Paul Street",
    "map": "https:\/\/maps.app.goo.gl\/DKpoX2JfaeTmWYGn8",
    "updated": "Updated: 2025-04-17",
    "courtesy": "Courtesy: Justin Menu",
    "text": "ASK ABOUT OUR VEGAN OPTIONS<br\/>?<br\/><br\/>CAN BE MADE GLUTEN FRIENDLY<br\/>(GF)<br\/><br\/>THE BIG BREAKFAST (GF) $17.5<br\/><br\/>Two eggs, choice of bacon, ham, or sausage, toast &amp; home fries. Choice of Finn pancakes, 2 French toast or waffles<br\/><br\/>PANCAKES, WAFFLES OR FRENCH TOAST (GF)$14.5<br\/>Four firm pancakes or choice of 3 waffles or french toast with ham, bacon, or sausage. Gluten free add $3.<br\/><br\/>STUFFED FRENCH TOAST OR WAFFLES (GF) $16.5<br\/>Two pieces of French Toast or Waffles stuffed with cream cheese, topped with cherry, blueberry or apple. Served with ham, bacon or sausage. Gluten Free add 3<br\/><br\/><br\/>GLUTEN FREE POTATO PANCAKES (4) $15.5<br\/>Our interpretation with sun dried tomatoes, mozzarella cheese and a hint of green onions. Served with sour cream.<br\/><br\/>__________________________________________<br\/><br\/>RECOMMENDED<br\/><br\/>STEAK &amp; EGGS (GF) $24<br\/>6oz AAA New York strip and eggs cooked the way you like them served with hand cut home fries and choice of toast.<br\/><br\/>&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<br\/><br\/>BREAKFAST 1, 2 OR 3 (GF)<br\/>Eggs any style with choice of bacon, ham or sausage. Includes toast and home fries. Options include: Breakfast 2 eggs (no meat) for $10, Breakfast 2 eggs for $12, Breakfast 3 eggs for $13, respectively.<br\/><br\/>BREAKFAST SCRAMBLER (GF) $16.5<br\/>Choice of bacon, ham, or sausage, with saut&#233;ed onions, fresh mushrooms and fresh bell peppers topped with cheddar cheese. Served with toast &amp; home fries.<br\/><br\/>BREAKFAST QUESADILLA $17.5<br\/>Scrambled eggs with bacon, potatoes, tomatoes &amp; cheese. Served in a flour tortilla with a side of salsa &amp; sour cream.<br\/><br\/>BREAKFAST BURRITO  $17.5<br\/>Ham, bacon or sausage, saut&#233;ed onions, peppers &amp; mushrooms served in a 12&#8221; shell and topped with cheese. Includes sour cream and salsa, and side of home fries. Add $2 for all 3 meats.<br\/><br\/>ULTIMATE BREAKFAST BOWL (GF) $17.5<br\/>Hand cut home fries with ham, bacon and sausage, chorizo sausage, scrambled eggs, topped with cheese then smothered in a buttery hollandaise sauce.<br\/><br\/>FRIED EGG GRILLED CHEESE (GF) $10<br\/>A fried egg on a grilled cheese sandwich. Gluten free add $3.<br\/><br\/>ROOSTER TOPPER (GF)  $9.5<br\/>English muffin with one egg, bacon, ham or sausage with cheese<br\/><br\/>Add Ons:<br\/><br\/>Bacon, ham, or sausage $4, Chicken $5, Peameal Bacon $5, Shaved steak $6, Kielbasa $6, 6oz NY strip $10, 9oz Lobster tail $27 (price reflects market value and is subjet to change), Side Hollandaise $2.5, Side Nutella $1<br\/><br\/>ROOSTER&#8217;S BENNY BOARD<br\/>Our hollandaise is Gluten Free<br\/><br\/>THE CLASSIC (GF)  $18<br\/>Classic Benedict with toasted English muffin, grilled smoked ham, poached eggs topped with a buttery hollandaise sauce.<br\/><br\/> <br\/><br\/>THE POSEIDON (GF)  $37<br\/>An 8oz lobster tail butterflied, served on toasted English muffins with sliced tomato, poached eggs topped with a Parmesan hollandaise sauce.<br\/><br\/><br\/>VEGETARIAN BENNY (GF)  $21?<br\/>Poached eggs atop grilled asparagus, spinach, avocado, sun-dried tomato and feta served on English muffins with buttery hollandaise. Includes a side of salsa.<br\/><br\/>MEXI BENNY    $21?<br\/>Fiesta grilled jalapeno infused chicken breast, salsa, sour cream and poached eggs atop an English muffin. Add avocado for $2.<br\/><br\/>NEW!<br\/><br\/>THE EL TRES (GF)   $21?<br\/>Chorizo sausage, English muffin, poached eggs and hollandaise topped with a black bean, corn and lime salsa, El Tres Green hot sauce, cilantro, and sour cream.<br\/><br\/> <br\/><br\/>NEW!<br\/><br\/>THE VIKING (GF)  $23<br\/>4oz of Norwegian Salmon, toasted English Muffin and poached eggs topped with a buttery dilled hollandaise and a sprinkle of fresh lemon zest.<br\/><br\/> <br\/><br\/>&#8220;THE WALLEYE&#8221;   $25<br\/>6 oz Pan fried walleye with a hint of lemon on a grilled English muffin, topped with poached eggs and hollandaise. Served with home fries.<br\/><br\/>KING BENNY (GF)    $37<br\/>A 7oz beef tenderloin on a toasted English muffin with sliced tomato, poached eggs and topped with Parmesan hollandaise sauce.<br\/><br\/><br\/>BRUSCHETTA BENNY (GF)  $22?<br\/>Grilled English muffin, poached eggs, pesto hollandaise, fresh Bruschetta mix and home fries.<br\/><br\/>UKRAINIAN BENEDICT (GF) $23.5<br\/>A toasted English muffin stacked with a potato pancake and mini Kielbasa sausage, poached eggs, topped with a buttery hollandaise sauce.<br\/><br\/>THE GREAT CANADIAN (GF)  $22.5<br\/>A toasted English muffin with peameal bacon, poached eggs, topped with buttery hollandaise and sprinkled with Parmesan cheese.<br\/><br\/>THREE EGG OMELETTE BOARD<br\/>Served with toast (white, rye or multigrain) and home fries.<br\/>Egg white only omelettes add $2, Gluten free toast add $3<br\/>Add a side of Rooster&#8217;s Classic Hollandaise $2.50<br\/><br\/> <br\/><br\/> THE EL TRES  $19<br\/>Chorizo packed omelette topped with Heartbeat Hot Sauce El Tres Green, sour cream and black bean corn salsa infused with lime and cilantro.<br\/><br\/>HAM &amp; CHEESE (GF)  $18<br\/>Savoury diced breakfast ham, cheddar and blended cheddar folded into fluffy scrambled eggs. Sometimes less is more!!<br\/><br\/>THE GREEK (GF)   $19?<br\/>Treat yourself to the taste of Mediterranean! Loaded with green and red peppers, green and red onions, oregano and a healthy portion of feta cheese.<br\/><br\/>DENVER OR WESTERN (GF)  $17<br\/>Keep it classic with your choice of bacon or ham, packed with green peppers, mushrooms, onions and a cheddar blend.<br\/><br\/>HEAT SEEKER (GF)   $19??<br\/>Wake up your tastebuds with this lively option. Roasted red peppers, tomatoes, red onions, basil, banana peppers, spinach and mozarella cheese. Made with HeartBeat Red Habanero hot sauce!<br\/><br\/>MEAT LOVERS   $19<br\/>Bacon, ham, sausage and cheddar cheese. Your hearty go to!<br\/><br\/>VEGETARIAN (GF)   $19?<br\/>Veggie lovers rejoice! Jam packed with saut&#233;ed asparagus, spinach, mushrooms, bell peppers, red onion and a cheddar blend.<br\/><br\/>Heartbeat Hot Sauce Bottles 12<br\/>Scorpion | Dill Serrano | Red Habanero| Blueberry Habanero| El Tres Green|Pineapple Habanero<br\/><br\/>SWEET TOOTH TO GO<br\/> <br\/><br\/>CINNAMON BUNS      $2.5<br\/>BUTTER TARTS           $1.5<br\/><br\/> <br\/><br\/>CINNAMON BUN GRILLER  $2.75<br\/>Fresh warm cinnamon buns grilled to perfection and served with caramel or chocolate syrup.<br\/><br\/> <br\/><br\/><br\/><br\/><br\/><br\/><br\/>NIBBLING &amp; NOSHING<br\/>VEGETARIAN<br\/>?<br\/><br\/>SPICY<br\/>?<br\/><br\/>ASK ABOUT OUR VEGAN OPTIONS<br\/>?<br\/><br\/>CAN BE MADE GLUTEN FRIENDLY<br\/>(GF)<br\/><br\/>QUESADILLA    $16.5?<br\/>Chicken, bacon or both! Saut&#233;ed veggies &amp; 3 cheeses wrapped in a 12&#8243; tortilla. Served with salsa and sour cream. Add shaved steak for $4. Ask server for our vegan option.<br\/><br\/>CHICKEN CAESAR WRAP   $13.5<br\/>Crisp romaine, chicken pieces, bacon bits, Parmesan and Asiago Caesar dressing. Make it crispy Buffalo chicken Add $1.5<br\/><br\/>FETA WRAP   $13.5<br\/>Diced chicken, romaine, cucumber, peppers, onions &amp; feta cheese<br\/><br\/>VEGAN WRAP     $16.5??<br\/> Grilled marinated tofu, roasted red peppers, red onions, fresh spinach, hummus and sun-dried tomato vegan mayo wrapped in a fresh tortilla.<br\/><br\/>REUBEN WRAP     $15.5??<br\/>Filled with all the classic flavours and ingredients as our sandwich: corned beef, sauerraut, swiss cheese, diced dill pickles on the inside, and your choise of mustard or 1000 island. Add Dill pickle heartbeat hotsauce for $1<br\/><br\/> <br\/><br\/>ROOSTER WRAP   $13.5<br\/>Chicken, cheese, beer infused onions, peppers, mushrooms with lettuce &amp; tomato. Served with your choice of Ranch, Honey Mustard or Italian dressing<br\/><br\/>STEAK &amp; CHEESE WRAP  $14.5<br\/>New York Strip, beer infused onions, bell peppers, button mushrooms, cheese blend, romaine and chipotle aioli<br\/><br\/>ROOSTER TOES  $12<br\/>Breaded chicken strips served with Dill, Ranch, Honey Mustard, BBQ or Plum sauce<br\/><br\/>Add Ons:<br\/><br\/>Poutine $6?<br\/>Caesar $5<br\/>Garlic Fries $5<br\/>Sweet Potato Fries $5<br\/>Onion Rings $5<br\/>Fries $5<br\/>Garden Salad $5<br\/>Soup $5<br\/>Gravy $2.50<br\/><br\/>FLATBREADS &amp; ROOSTER BOWLS<br\/>VEGAN BOWL  (GF) $16.5??<br\/>Fresh spinach, grilled peppers, onions &amp;asparagus, avocado, grilled tofu, toasted chickpeas and vegan cheese on a bed of quinoa with sun-dried tomato vegan mayo drizzle<br\/><br\/>THE CLUCK NORRIS POUTINE $16.5<br\/>Crispy chicken tossed in a spicy sauce blend atop our hand cut fries, curds, gravy ans drizzled with our house made honey dill. Poutine with a kick<br\/><br\/>PHILLY CHEESE STYLE POUTINE $16.5<br\/>Phil your bellies with shaved steak, sauteed onions, mushrooms atop our hand-cut home fries, curds, gravy &amp; drizzled with our house-made peppercorn ranch.<br\/><br\/>CLASSIC POUTINE     $12.5??<br\/>Real cheese curds topped with a thick special blend gravy<br\/><br\/>MEXI POUTINE (GF)   $16.5<br\/>Diced chicken, shredded cheese, corn chips, salsa, sour cream and green onions all topped with Heartbeat hot sauce. Delicioso!<br\/><br\/>CANADIANA BREAKFAST (GF)  $16,5<br\/>Bacon and cheese curds, tater tots, scrambled eggs hollandaise sauce and Nor&#8217;wester maple syrup. get your Canadian pride on eh&#8230;<br\/><br\/> <br\/><br\/>MEAL SIZED SALADS<br\/> <br\/><br\/>All produce for our salads are picked fresh on a daily basis and topped with one of our sensational dressings (Ranch, Honey Mustard, Blue Cheese, French, Balsamic (GF) , Raspberry, Italian, Oil &amp; Vinegar, 1,000 Island)<br\/><br\/> <br\/><br\/>CAESAR    SIDE:$7 I Full: $14<br\/>Romaine, bacon, grated Parmesan cheese and croutons.<br\/><br\/> GARDEN   SIDE: $6.5 I Full: $12.5?<br\/>Lettuce, peppers, carrots, cucumbers, celery, onions &amp; tomatoes. <br\/><br\/> GREEK    SIDE: $8 I Full: $16?<br\/>Romaine lettuce, onions, peppers, tomatoes, cucumber, feta &amp; black olives. Side: $6 | Full: $15<br\/><br\/> <br\/><br\/>CHEF&#8217;S     $16.5<br\/>Lettuce, tomatoes, peppers, onions, carrots, celery, cucumber, ham, cheese &amp; hard boiled egg<br\/><br\/>CHICKEN OR TUNA BELT    $16.5<br\/>Salad greens with chopped bacon, cucumbers, tomatoes, peppers, onions &amp; a hard boiled egg<br\/><br\/><br\/><br\/><br\/><br\/><br\/>THE SANDWICH STOP<br\/>VEGETARIAN<br\/>?<br\/><br\/>SPICY<br\/>?<br\/><br\/>ASK ABOUT OUR VEGAN OPTIONS<br\/>?<br\/><br\/>CAN BE MADE GLUTEN FRIENDLY<br\/>(GF)<br\/><br\/>We cook our own roasts, turkeys &amp; Hams on a daily basis.<br\/>All sandwiches can be made Gluten Free add $3<br\/><br\/>PHILLY CHEESE STEAK    $15.5<br\/>Shaved steak, saut&#233;ed onions and mushrooms topped with provalone cheese on a hogie bun<br\/><br\/>RUEBEN    $15.5<br\/>Corned beef stacked high with sauerkraut, Swiss cheese topped wih mustard or 1,000 Island. Served with a crispy Kosher dill<br\/><br\/>GRILLED MELT   $15.5<br\/>Tuna or chicken breast topped with mozzarella cheese and tomato, grilled on a 12 grain artisan bun.<br\/><br\/>ROOSTER CLUB   $15.5<br\/>Ham, turkey, bacon, lettuce, tomato &amp; cedar cheese on 2 slices of break<br\/><br\/>HOT NIP   $15.5<br\/>6oz fresh ground chuck patty with sliced red onions served on a Brioche bun with fries and gravy.<br\/><br\/>SANDWICH BOARD   $8.5<br\/>Choice of egg salad, tuna salad or grilled cheese<br\/><br\/>DENVER, BLT OR WESTERN    $11.5<br\/><br\/> <br\/><br\/>RECOMMENDED<br\/>STEAK SANDWICH   $24<br\/>6oz AAA NY strip grilled to perfection with sauteed mushrooms &amp; onions, served on garlic toast. Served with hand cut French fries.<br\/><br\/>MONTE CRISTO  $15.5<br\/>Ham and turkey smothered with mozzarella cheese served on French toast.<br\/><br\/>CHICKEN PARMESAN    $15.5<br\/>Panko crusted balsamic marinated chicken breast with parmesan, basil, oregano, mozzarella and banana peppers. Topped with our house made sauce on spacatelli bun.<br\/><br\/>CHICKEN CLUB  $15.5<br\/>Breaded chicken, bacon, cheese, lettuce &amp; tomato served on a spacatelli<br\/><br\/>JIM&#8217;S TBS  $15.5<br\/>Shaved turkey, bacon &amp; mozzarella cheese on rye bread.<br\/><br\/>HOT TURKEY OR BEEF   $16.5<br\/>Smothered in thick gravy with fries and coleslaw.<br\/><br\/>Sandwich, Burger, and Wrap Add Ons:<br\/><br\/>Poutine $6?<br\/>Caesar $5<br\/>Garlic Fries $5<br\/>Sweet Potato Fries $5<br\/>Onion Rings $5<br\/>Fries $5<br\/>Garden Salad $5<br\/>Soup $5<br\/>Gravy $2.50<br\/><br\/> <br\/><br\/>BURGERS, BURGERS, BURGERS<br\/>All our burgers are made with 6oz of ground chuck.<br\/>Served on a brioche bun w\/ lettuce, tomato &amp; onion.<br\/>All burgers can be made Gluten Free add $3<br\/><br\/>BONOBO&#8217;S BOUNTIFUL BURGER  $15.5 ?<br\/>Locally handmade vegan seed patty by Bonobo&#8217;s Foods, guacomole, tomato, roasted red peppers, spinach, feta, and balsamic drizzle on a brioche bun<br\/><br\/>SLEEPING GIANT   $15.5<br\/>Beer infused onions, cheddar Mozzarella, peameal bacon &amp; BBQ sauce.<br\/><br\/> <br\/><br\/>BACON MOZZA BBQ MUSHROOM   $15.5<br\/>A crispy onion ring, hickory smoked bacon, mozzarella cheese, saut&#233;ed mushrooms and house made BBQ sauce.<br\/><br\/>THE ANGRY ROOSTER ?$15.5<br\/>Not named after the owner but comes with plenty of attitude&#8230; smoked bacon, aged cheddar, crispy fried jalapenos and Siracha aioli.<br\/><br\/>HENHOUSE BURGER   $15.5<br\/>Served with one clucking over easy atop a juicy crusted chicken breast. Topped with mozzarella, lettuce, tomato and house-made basil mayo.<br\/><br\/>Sandwich, Burger, and Wrap Add Ons:<br\/>Poutine $6?<br\/>Caesar $5<br\/>Garlic Fries $5<br\/>Sweet Potato Fries $5<br\/>Onion Rings $5<br\/>Fries $5<br\/>Garden Salad $5<br\/>Soup $5<br\/>Gravy $2.50<br\/>",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "name": "Rooster's Bistro"
}