{
"name" : "Malabar Mandi Kitchen",
"status" : "",
"link" : "https://www.malabarmandikitchen.com/", 
"hours" : "(Sunday - Saturday: 12:00 - 00:00)", 
"tel" : "tel: 807-357-8056", 
"sms": "", 
"address" : "Address: 108 Frederica Street East", 
"map": "https://maps.app.goo.gl/9FVyW6hPXksVQThSA",
"updated" : "Updated: 2025-12-04", 
"courtesy" : "Courtesy: Justin Menu",
"image0" : "img (5).webp",
"image1" : "img (6).webp",
"image2" : "img (7).webp",
"image3" : "img (8).webp",
"text" : "
Malabar Mandi Restaurant Menu
<br>Chicken Pieces (Roasted, Char-Grilled, and Glazed)
<br>Shawaya (Roasted) Juicy, golden-roasted chicken seasoned with a flavourful blend of Malabar gravy. Balanced, aromatic, and rich flavour. Quarter 8.99 Half 16.99 Full 31.99
<br>
<br>Alfahm (Char-Grilled) Grilled style chicken (leg + thigh attached) with a bold marinade that's deeply flavourful. Crisp skin, juicy inside. Quarter 9.99 Half 18.99 Full 32.99
<br>
<br>Honey Garlic Chicken Chicken glazed in a rich honey garlic blend, layered with savoury spices and a subtle kick.
<br>
<br>Mandis and Ghee Rice Combos
<br>Classic Malabar Mandi 21.99 Slow-cooked, steamed chicken and fragrant rice infused with traditional Malabar and Arabic spices. Comes with garlic white sauce & Tangy Tomato Salsa.
<br>
<br>Shawaya Chicken Mandi 21.99 Quarter chicken in a flavourful Malabar gravy, served with mandi rice cooked in aromatic stock. Comes with garlic white sauce & tangy tomato salsa.
<br>
<br>Alfahm Chicken Mandi 22.99 One Grilled quarter chicken in Malabar dry rub, served with mandi rice. Comes with garlic white sauce & tangy tomato salsa.
<br>
<br>Ghee Rice & Chicken Kadai 18.99 Includes aromatic Ghee Rice made with Jeerakasala/Kaima rice, our signature Chicken Kadai cooked with onions, tomatoes, and roasted spices, plus a refreshing onion raita salad and coconut chammanthi on the side. Comforting, filling, and packed with authentic flavour.
<br>
<br>Combos
<br>Shawaya Combo 17.99 Juicy, golden-roasted chicken seasoned with a flavourful blend of Malabar spiced gravy. Two soft pillowy naan, coriander mint chutney and garlic white sauce.
<br>
<br>Alfahm Combo 18.99 Grilled style chicken with a bold marinade, two soft pillowy naan, coriander mint chutney and garlic white sauce.
<br>
<br>Honey Garlic Combo 19.99 Glazed quarter chicken. Two soft pillowy naan, coriander mint chutney and garlic white sauce.
<br>
<br>Feast Box
<br>(Serves 4)
<br>
<br>Classic Mandi Feast Box 78.99 Shawaya Mandi Feast Box 78.99 Alfahm Mandi Feast Box 82.99
<br>
<br>Bread & Rice
<br>Naan 2.49 Soft pillowy naan baked until golden.
<br>
<br>Extra Mandi Rice 9.99 Extra Ghee Rice 9.99
<br>
<br>Cold Drinks
<br>Passion-Fruit Mojito 4.99 Blueberry Mojito 4.99 Strawberry Mojito 4.99 Fresh Mint Mojito 4.99 Mango Lassi 6.99
<br>
<br>Hot Drinks
<br>Sulaimani (Black Tea) 3.49 Kerala Milk Tea 4.49
<br>
<br>Desserts
<br>Walnut Baklava 3.99 One of the most beloved desserts in the world, baklava is wonderful layers of crispy, flaky fillo, with sweet walnuts and doused with pure honey, lemon juice and rose water.
<br>
<br>Ice Cream Fruit Salad 9.99 Sweet mango and banana pieces layered with smooth vanilla ice cream and finished with a bright strawberry topping.
<br>
<br>House-made Sauces & Sides 1.99 each
<br>Garlic White Sauce Tomato Salsa Green Chutney Coconut Chammanthi Onion Salad (Raita)
"
}