{
"name" : "Pie.Ology (May Street South)",
"status" : "",
"link" : "https://www.ilovepieology.com", 
"hours" : "(Tuesday: 11:00 - 15:00), (Thursday - Friday: 11:00 - 15:00)", 
"tel" : "tel: 807-631-3056", 
"sms": "", 
"address" : "Address: 119 May Street South",
"map": "https://maps.app.goo.gl/qdQXBQcmSUXeAnRU7", 
"updated" : "Updated: 2025-08-09", 
"courtesy" : "Courtesy: Justin Menu", 
"text" : "pie.ology
<br>
<br>HAND PIES MADE WITH HEART
<br>
<br>ALL HAND PIES COME FROZEN WITH BAKING INSTRUCTIONS
<br>
<br>BREAKFAST HAND PIES, $7.00 each
<br>
<br>DELUXE BREAKFAST Tarrymore Farms eggs, ham & bacon from The Commissary, diced red peppers & green onions, cheese
<br>
<br>BIG BREAKFAST Tarrymore Farms eggs, sausage made from Maltese ground pork, bacon from Bogdala's, cheese
<br>
<br>CLASSIC BREAKFAST Tarrymore Farms eggs, bacon from Bogdala's, a blend of cheese
<br>
<br>VEGGIE BREAKFAST Tarrymore Farms eggs, oven roasted tomatoes, tomatillos & peppers, cheese
<br>
<br>EAST END BREAKFAST Tarrymore Farms eggs, ham from The Commissary, spring onions, cheese
<br>
<br>CAMPFIRE BREAKFAST Eggs, sausage, bacon, baked beans, Heartbeat Hot Sauce red habanero
<br>
<br>BREAKFAST POUTINE Tarrymore Farms eggs, bacon from Bogdala's, diced red peppers and green onions, home fries, Thunder Oak cheese curds, Hollandaise-style sauce, cheese
<br>
<br>CHIPOTLE STEAK & EGGS Tarrymore Farms eggs, smoky chipotle seasoning blend, striploin steak in a sauce made with chipotle peppers in adobo sauce, lime, cilantro and agave syrup, house-made pickled jalapeños, cheese
<br>
<br>HUEVOS RANCHEROS Tarrymore Farms eggs, pico de gallo with jalapeno, refried beans, a blend of cheese
<br>
<br>LUNCH/DINNER HAND PIES, $7.00 each
<br>
<br>PLOUGHMAN'S North Country Meats mild Italian sausage, mashed potatoes, roasted red peppers, cheese
<br>
<br>HAM & SWISS North Country Meats ham, Thunder Oak Swiss cheese, a blend of cheese
<br>
<br>ANGRY HAWAIIAN Ham, grilled pineapple, cheese, Heartbeat Hot Sauce pineapple habanero
<br>
<br>PIZZA My-Pride Farm pepperoni, mozzarella cheese, tomato sauce, a blend of cheese
<br>
<br>BBQ BACON CHEESEBURGER Cornell Farms ground beef, slow-cooked onions, bacon, house made BBQ sauce, cheese
<br>
<br>SHEPHERD'S Cornell Farms ground beef, mashed potatoes, carrots, peas, cheese, gravy
<br>
<br>CHEESEBURGER Cornell Farms ground beef, ketchup, mustard, relish, pickles, cheese
<br>
<br>SAUSAGE ROLL Ground pork from Maltese with our own blend of seasoning
<br>
<br>MUSHROOM & SWISS Mushrooms sautéed with onions, garlic and herbs, Thunder Oak Swiss cheese, a blend of cheese
<br>
<br>TOMATO BASIL DeBruin's Greenhouses roasted Roma tomatoes, nut-free pesto, mozzarella cheese
<br>
<br>MAC N' CHEESE Fusilli in a house made creamy cheese sauce
<br>
<br>SPICY MAC N' CHEESE Fusilli in a house made creamy cheese sauce, Heartbeat Hot Sauce red habanero
<br>
<br>FRUIT/SWEET HAND PIES, $6.50 each
<br>
<br>STRAWBERRY RHUBARB Belluz Farms strawberries, garden grown rhubarb, sugar
<br>
<br>APPLE Apples, cinnamon, nutmeg, sugar. This hand pie comes in both vegan and non-vegan options
<br>
<br>APPLE RASPBERRY Apples, raspberries, sugar. This hand pie comes in both vegan and non-vegan options.
<br>
<br>BUMBLEBERRY Apples, strawberries, raspberries, blueberries and sugar. This hand pie comes in both vegan and non-vegan options.
<br>
<br>MINI HAND PIES, $4.50 each
<br>
<br>SAMOSA Potatoes, peas, East-Indian seasoning and spices
<br>
<br>SPINACH & FETA Spinach, red onions, feta cheese, dill
<br>
<br>FOR A FULL LIST OF INGREDIENTS PLEASE CONTACT US DIRECTLY",
"image0" : "img3.webp",
"image1" : "img4.webp"
}