{
    "link": "",
    "hours": "",
    "tel": "tel: 807-623-3111",
    "sms": "",
    "address": "Address: 1650 Dease Street",
    "map": "https:\/\/maps.app.goo.gl\/rNUmgfmvaRiwqPQm6",
    "updated": "Updated: 2025-02-05",
    "courtesy": "Courtesy: Justin Menu",
    "text": "Appetizers &amp; Snacks<br\/>Samosas (3 Pcs) CA$7.00 Crispy pastry pockets filled with flavourful spices. #3 most liked<br\/><br\/>Mix Veg Pakora (6 Pcs) CA$7.00 Crispy fried mixed vegetables in a light batter. #1 most liked<br\/><br\/>Vada Pav (2 Pcs) CA$10.00 Crispy fried doughnut sandwich filled with spiced potato filling. #2 most liked<br\/><br\/>Chole Puri (2 Puri) CA$10.00 Traditional North Indian-style chickpea curry served with two soft, puffed...<br\/><br\/>Masala Khichadi CA$3.00 Traditional Indian comfort food made with a blend of spices and rice. 100% (13)<br\/><br\/>Chole Naan (1 Naan) CA$8.00 Soft, leavened flatbread served with a rich, spicy chickpea curry.<br\/><br\/>Indian Flatbreads<br\/>Fresh Roti (2 pcs) CA$1.00 Fresh, Soft, Handmade Fulka Roti (Whole Wheat) Rating: 100% (5)<br\/><br\/>Paratha (2 pcs) CA$2.00 Traditional Indian flatbread made with whole wheat flour without any leavening agent. Popular<br\/><br\/>Laccha Paratha (2 pcs) CA$3.50 Flaky, layered flatbread perfect for pairing with curries or enjoying on its own.<br\/><br\/>Aloo Paratha (2 pcs) served with yogurt CA$5.00 Stuffed flatbread with spiced potato filling, served warm.<br\/><br\/>Paneer Kulcha naan (1 pc) CA$3.00 Soft, fluffy naan stuffed with paneer, perfect for pairing with your favorite dishes.<br\/><br\/>Kulcha Naan (1 pc) CA$2.50 Soft, fluffy flatbread filled with seasoned potato, perfect for pairing with your favorite dishes.<br\/><br\/>Rice Dishes<br\/>Veg Biryani Price: CA$14.99 Aromatic rice dish with soya, mixed vegetables, and spices, offering a rich and savoury flavour.<br\/><br\/>Pulao Rice Price: CA$12.99 Fragrant rice dish with mixed vegetables and aromatic spices, perfect as a main course or side dish.<br\/><br\/>Lemon Rice Price: CA$13.99 Tangy rice dish infused with fresh lemon juice and aromatic spices for a zesty and refreshing flavour.<br\/><br\/>Curd Rice Price: CA$12.99 Creamy yoghurt mixed with rice, cucumber, carrot, potato, and apple for a cooling and satisfying dish.<br\/><br\/>Veg Fried Rice Price: CA$9.99 Broccoli-infused rice with a medley of vegetables, offering a delightful Indo-Chinese flavour.<br\/><br\/>Drinks<br\/>Mango Milkshake Price: CA$7.00 Sweet and refreshing blend of mango pur&#233;e and creamy milk. Popular (Image: Glass filled with yellow mango milkshake and a small bowl of mango pieces next to it.)<br\/><br\/>POP drink Price: CA$2.00 Refreshing drink.<br\/><br\/>Sandwiches &amp; Burgers<br\/>Veg Open Sandwich Price: CA$8.99 Description: Broccoli, zucchini, corn, olives, and dill pickle on an open sandwich with basil...<br\/><br\/>Chilli Paneer Sandwich Price: CA$9.99 Description: Spicy jalape&#241;o and paneer sandwich, a fusion of flavours for a zesty bite.<br\/><br\/>Mumbai Sandwich Price: CA$8.99 Description: Mixed veg sandwich with spinach and cheese slice, offering a delightful blend...<br\/><br\/>Cole Slaw Sandwich Price: CA$9.99 Description: A delightful mixed veg sandwich with cole slaw for a refreshing crunch.<br\/><br\/>Pahadi Grill Sandwich Price: CA$12.99 Description: Grilled sandwich packed with zucchini, potato, cucumber, lettuce, and corn for...<br\/><br\/>Grill Sandwich Price: CA$9.99 Description: Crisp sandwich with cucumber and potato, grilled to perfection for a...<br\/><br\/>Main Dishes<br\/>Kadai Paneer - CA$9.99 Paneer and bell peppers in a vibrant yellow gravy, seasoned with aromatic spices.<br\/><br\/>Paneer Butter Masala - CA$12.99 Rich, creamy paneer in a cashew-based red gravy giving an elegant sweet and...<br\/><br\/>Paneer Rajwadi - CA$12.99 A rich North Indian dish with paneer, cooked in cashew-based creamy...<br\/><br\/>Paneer Tikka Masala Dry - CA$12.99 Spiced paneer with bell peppers, offering a burst of North Indian flavours in...<br\/><br\/>Paneer Tikka Masala Gravy - CA$9.99 Yogurt-based creamy gravy with paneer and bell peppers offering a rich blend of...<br\/><br\/>Mix Veg Sabji (Semi gravy) - CA$9.99 A medley of vegetables in a semi-gravy, offering a taste of North Indian flavours.<br\/><br\/>Malai Kofta - CA$12.99 Creamy dumplings in a rich, spiced tomato sauce, offering a taste of...<br\/><br\/>Veg Kofta Curry - CA$12.99 Delicious veg kofta in a rich red gravy, offering authentic North Indian flavours...<br\/><br\/>Dum Aloo Banarasi - CA$12.99 Tender potatoes in a rich, aromatic sauce, capturing the essence of Banara...<br\/><br\/>Friday: Festive Feast - CA$14.99 Mutter Paneer, Paratha (1 pc), Pulav Rice, Sweet, raita, Salad. (Popular)<br\/><br\/>Chole Puri (2 Puri) - CA$10.00 Traditional North Indian-style chickpea curry served with two soft, puffed...<br\/><br\/>Vedic Food Meal Platter - CA$14.99 Chole naan + khichadi + 3 pakora +1 sweet.<br\/><br\/>Extra Subji (8 Oz) - CA$5.00 As per the availability.<br\/><br\/>Masala Khichadi - CA$3.00 Traditional Indian comfort food made with a blend of spices and rice.<br\/><br\/>Chole Naan (1 Naan) - CA$8.00 Soft, leavened flatbread served with a rich, spicy chickpea curry.<br\/><br\/>Sweets<br\/>Gulab Jamun (2 pc) - CA$2.00 Delicious sweet (Popular)<br\/><br\/>Assorted Indian Sweet (5 Pcs) - CA$10.00 Assorted Indian sweets, 5 pieces.<br\/><br\/>Assorted Indian Sweet (1 Pc) - CA$3.00 Traditional Indian sweet treat, perfect for satisfying your sweet tooth.<br\/><br\/>Indo-Chinese Dishes<br\/>Veg Chilli Potato Price: CA$8.99 Description: Crispy potatoes in a spicy Indo-Chinese sauce.<br\/><br\/>Veg Honey Chilli Potato Price: CA$8.99 Description: Crispy potatoes tossed in a sweet and spicy honey chilli sauce for a delightful combination.<br\/><br\/>Chilli Paneer Price: CA$10.99 Description: Spicy paneer cubes tossed with peppers, offering a zesty Indo-Chinese flavour.<br\/><br\/>Paneer Crispy Price: CA$10.99 Description: Crispy paneer bites with a blend of Indo-Chinese spices for a delightful crunch.<br\/><br\/>Veg Fried Rice Price: CA$9.99 Description: Broccoli-infused rice with a medley of vegetables, offering a delightful Indo-Chinese flavour.<br\/><br\/>Hot and Sour Soup (8 oz) Price: CA$6.99 Description: A tangy mix vegetable soup with a spicy kick, perfect for a warming and flavourful experience.<br\/><br\/>Veg Manchow Soup (8 oz) Price: CA$7.99 Description: Savoury soup with noodles, offering a delightful blend of vegetables and spices.<br\/><br\/>Sweet Corn Veg Soup Price: CA$6.99 Description: A comforting blend of sweet corn and vegetables in a savoury broth, perfect for a cosy meal.<br\/><br\/>Veg Manchurian Dry (8 pcs) Price: CA$8.99 Description: Crispy vegetable balls tossed in a tangy sauce, offering a delightful Indo-Chinese flavour.<br\/><br\/>Veg Manchurian Gravy (8 pcs) Price: CA$10.99 Description: Savoury vegetable balls in a rich, tangy sauce, perfect for a delightful Indo-Chinese experience.<br\/><br\/>Veg Hakka Noodles Price: CA$8.99 Description: Noodles tossed with paneer and vegetables, enhanced with a hint of Indo-Chinese spices.<br\/><br\/>Veg Singaporian Noodles Price: CA$9.99 Description: Noodles with baby corn, broccoli, and pineapple, offering a delightful fusion of flavours.",
    "image0": "img0.webp",
    "image1": "img1.webp",
    "image2": "img2.webp",
    "image3": "img3.webp",
    "image4": "img4.webp",
    "image5": "img5.webp",
    "image6": "img6.webp",
    "name": "Vedic Foods"
}